/* automatically generated by rust-bindgen 0.70.1 */

pub const XATOM_H: u32 = 1;
pub const XlibSpecificationRelease: u32 = 6;
pub const _SYS_TYPES_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __GLIBC_USE_ISOC23: u32 = 0;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __TIMESIZE: u32 = 64;
pub const __USE_TIME_BITS64: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_SCANF: u32 = 0;
pub const __GLIBC_USE_C23_STRTOL: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_60559_BFP__: u32 = 201404;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_IEC_60559_COMPLEX__: u32 = 201404;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;

pub const XkbXI_IndicatorStateMask: u32 = 16;
pub const XkbXI_UnsupportedFeatureMask: u32 = 32768;
pub const XkbXI_AllFeaturesMask: u32 = 31;
pub const XkbXI_AllDeviceFeaturesMask: u32 = 30;
pub const XkbXI_IndicatorsMask: u32 = 28;
pub const XkbAllExtensionDeviceEventsMask: u32 = 32799;
pub const XkbPCF_DetectableAutoRepeatMask: u32 = 1;
pub const XkbPCF_GrabsUseXKBStateMask: u32 = 2;
pub const XkbPCF_AutoResetControlsMask: u32 = 4;
pub const XkbPCF_LookupStateWhenGrabbed: u32 = 8;
pub const XkbPCF_SendEventUsesXKBState: u32 = 16;
pub const XkbPCF_AllFlagsMask: u32 = 31;
pub const XkbDF_DisableLocks: u32 = 1;
pub const XkbAnyActionDataSize: u32 = 7;
pub const XkbOD_Success: u32 = 0;
pub const XkbOD_BadLibraryVersion: u32 = 1;
pub const XkbOD_ConnectionRefused: u32 = 2;
pub const XkbOD_NonXkbServer: u32 = 3;
pub const XkbOD_BadServerVersion: u32 = 4;
pub const XkbLC_ForceLatin1Lookup: u32 = 1;
pub const XkbLC_ConsumeLookupMods: u32 = 2;
pub const XkbLC_AlwaysConsumeShiftAndLock: u32 = 4;
pub const XkbLC_IgnoreNewKeyboards: u32 = 8;
pub const XkbLC_ControlFallback: u32 = 16;
pub const XkbLC_ConsumeKeysOnComposeFail: u32 = 536870912;
pub const XkbLC_ComposeLED: u32 = 1073741824;
pub const XkbLC_BeepOnComposeFail: u32 = 2147483648;
pub const XkbLC_AllComposeControls: u32 = 3221225472;
pub const XkbLC_AllControls: u32 = 3221225503;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
extern "C" {
    pub fn select(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *mut timeval,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pselect(
        __nfds: ::std::os::raw::c_int,
        __readfds: *mut fd_set,
        __writefds: *mut fd_set,
        __exceptfds: *mut fd_set,
        __timeout: *const timespec,
        __sigmask: *const __sigset_t,
    ) -> ::std::os::raw::c_int;
}
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"]
        [::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"]
        [::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"]
        [::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"]
        [::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"]
        [::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"]
        [::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"]
        [::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"]
        [::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"]
        [::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"]
        [::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"]
        [::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"]
        [::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"]
        [::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"]
        [::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"]
        [::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"]
        [::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"]
        [::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"]
        [::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"]
        [::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"]
        [::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"]
        [::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"]
        [::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"]
        [::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"]
        [::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"]
        [::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"]
        [::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"]
        [::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"]
        [::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"]
        [::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"]
        [::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"]
        [::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"]
        [::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"]
        [::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"]
        [::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
pub type XID = ::std::os::raw::c_ulong;
pub type Mask = ::std::os::raw::c_ulong;
pub type Atom = ::std::os::raw::c_ulong;
pub type VisualID = ::std::os::raw::c_ulong;
pub type Time = ::std::os::raw::c_ulong;
pub type Window = XID;
pub type Drawable = XID;
pub type Font = XID;
pub type Pixmap = XID;
pub type Cursor = XID;
pub type Colormap = XID;
pub type GContext = XID;
pub type KeySym = XID;
pub type KeyCode = ::std::os::raw::c_uchar;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of max_align_t"][::std::mem::size_of::<max_align_t>() - 32usize];
    ["Alignment of max_align_t"][::std::mem::align_of::<max_align_t>() - 16usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce1"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce1) - 0usize];
    ["Offset of field: max_align_t::__clang_max_align_nonce2"]
        [::std::mem::offset_of!(max_align_t, __clang_max_align_nonce2) - 16usize];
};
extern "C" {
    pub fn _Xmblen(
        str_: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
pub type XPointer = *mut ::std::os::raw::c_char;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XExtData {
    pub number: ::std::os::raw::c_int,
    pub next: *mut _XExtData,
    pub free_private: ::std::option::Option<
        unsafe extern "C" fn(extension: *mut _XExtData) -> ::std::os::raw::c_int,
    >,
    pub private_data: XPointer,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XExtData"][::std::mem::size_of::<_XExtData>() - 32usize];
    ["Alignment of _XExtData"][::std::mem::align_of::<_XExtData>() - 8usize];
    ["Offset of field: _XExtData::number"][::std::mem::offset_of!(_XExtData, number) - 0usize];
    ["Offset of field: _XExtData::next"][::std::mem::offset_of!(_XExtData, next) - 8usize];
    ["Offset of field: _XExtData::free_private"]
        [::std::mem::offset_of!(_XExtData, free_private) - 16usize];
    ["Offset of field: _XExtData::private_data"]
        [::std::mem::offset_of!(_XExtData, private_data) - 24usize];
};
pub type XExtData = _XExtData;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XExtCodes {
    pub extension: ::std::os::raw::c_int,
    pub major_opcode: ::std::os::raw::c_int,
    pub first_event: ::std::os::raw::c_int,
    pub first_error: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XExtCodes"][::std::mem::size_of::<XExtCodes>() - 16usize];
    ["Alignment of XExtCodes"][::std::mem::align_of::<XExtCodes>() - 4usize];
    ["Offset of field: XExtCodes::extension"]
        [::std::mem::offset_of!(XExtCodes, extension) - 0usize];
    ["Offset of field: XExtCodes::major_opcode"]
        [::std::mem::offset_of!(XExtCodes, major_opcode) - 4usize];
    ["Offset of field: XExtCodes::first_event"]
        [::std::mem::offset_of!(XExtCodes, first_event) - 8usize];
    ["Offset of field: XExtCodes::first_error"]
        [::std::mem::offset_of!(XExtCodes, first_error) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XPixmapFormatValues {
    pub depth: ::std::os::raw::c_int,
    pub bits_per_pixel: ::std::os::raw::c_int,
    pub scanline_pad: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XPixmapFormatValues"][::std::mem::size_of::<XPixmapFormatValues>() - 12usize];
    ["Alignment of XPixmapFormatValues"][::std::mem::align_of::<XPixmapFormatValues>() - 4usize];
    ["Offset of field: XPixmapFormatValues::depth"]
        [::std::mem::offset_of!(XPixmapFormatValues, depth) - 0usize];
    ["Offset of field: XPixmapFormatValues::bits_per_pixel"]
        [::std::mem::offset_of!(XPixmapFormatValues, bits_per_pixel) - 4usize];
    ["Offset of field: XPixmapFormatValues::scanline_pad"]
        [::std::mem::offset_of!(XPixmapFormatValues, scanline_pad) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XGCValues {
    pub function: ::std::os::raw::c_int,
    pub plane_mask: ::std::os::raw::c_ulong,
    pub foreground: ::std::os::raw::c_ulong,
    pub background: ::std::os::raw::c_ulong,
    pub line_width: ::std::os::raw::c_int,
    pub line_style: ::std::os::raw::c_int,
    pub cap_style: ::std::os::raw::c_int,
    pub join_style: ::std::os::raw::c_int,
    pub fill_style: ::std::os::raw::c_int,
    pub fill_rule: ::std::os::raw::c_int,
    pub arc_mode: ::std::os::raw::c_int,
    pub tile: Pixmap,
    pub stipple: Pixmap,
    pub ts_x_origin: ::std::os::raw::c_int,
    pub ts_y_origin: ::std::os::raw::c_int,
    pub font: Font,
    pub subwindow_mode: ::std::os::raw::c_int,
    pub graphics_exposures: ::std::os::raw::c_int,
    pub clip_x_origin: ::std::os::raw::c_int,
    pub clip_y_origin: ::std::os::raw::c_int,
    pub clip_mask: Pixmap,
    pub dash_offset: ::std::os::raw::c_int,
    pub dashes: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XGCValues"][::std::mem::size_of::<XGCValues>() - 128usize];
    ["Alignment of XGCValues"][::std::mem::align_of::<XGCValues>() - 8usize];
    ["Offset of field: XGCValues::function"][::std::mem::offset_of!(XGCValues, function) - 0usize];
    ["Offset of field: XGCValues::plane_mask"]
        [::std::mem::offset_of!(XGCValues, plane_mask) - 8usize];
    ["Offset of field: XGCValues::foreground"]
        [::std::mem::offset_of!(XGCValues, foreground) - 16usize];
    ["Offset of field: XGCValues::background"]
        [::std::mem::offset_of!(XGCValues, background) - 24usize];
    ["Offset of field: XGCValues::line_width"]
        [::std::mem::offset_of!(XGCValues, line_width) - 32usize];
    ["Offset of field: XGCValues::line_style"]
        [::std::mem::offset_of!(XGCValues, line_style) - 36usize];
    ["Offset of field: XGCValues::cap_style"]
        [::std::mem::offset_of!(XGCValues, cap_style) - 40usize];
    ["Offset of field: XGCValues::join_style"]
        [::std::mem::offset_of!(XGCValues, join_style) - 44usize];
    ["Offset of field: XGCValues::fill_style"]
        [::std::mem::offset_of!(XGCValues, fill_style) - 48usize];
    ["Offset of field: XGCValues::fill_rule"]
        [::std::mem::offset_of!(XGCValues, fill_rule) - 52usize];
    ["Offset of field: XGCValues::arc_mode"][::std::mem::offset_of!(XGCValues, arc_mode) - 56usize];
    ["Offset of field: XGCValues::tile"][::std::mem::offset_of!(XGCValues, tile) - 64usize];
    ["Offset of field: XGCValues::stipple"][::std::mem::offset_of!(XGCValues, stipple) - 72usize];
    ["Offset of field: XGCValues::ts_x_origin"]
        [::std::mem::offset_of!(XGCValues, ts_x_origin) - 80usize];
    ["Offset of field: XGCValues::ts_y_origin"]
        [::std::mem::offset_of!(XGCValues, ts_y_origin) - 84usize];
    ["Offset of field: XGCValues::font"][::std::mem::offset_of!(XGCValues, font) - 88usize];
    ["Offset of field: XGCValues::subwindow_mode"]
        [::std::mem::offset_of!(XGCValues, subwindow_mode) - 96usize];
    ["Offset of field: XGCValues::graphics_exposures"]
        [::std::mem::offset_of!(XGCValues, graphics_exposures) - 100usize];
    ["Offset of field: XGCValues::clip_x_origin"]
        [::std::mem::offset_of!(XGCValues, clip_x_origin) - 104usize];
    ["Offset of field: XGCValues::clip_y_origin"]
        [::std::mem::offset_of!(XGCValues, clip_y_origin) - 108usize];
    ["Offset of field: XGCValues::clip_mask"]
        [::std::mem::offset_of!(XGCValues, clip_mask) - 112usize];
    ["Offset of field: XGCValues::dash_offset"]
        [::std::mem::offset_of!(XGCValues, dash_offset) - 120usize];
    ["Offset of field: XGCValues::dashes"][::std::mem::offset_of!(XGCValues, dashes) - 124usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XGC {
    _unused: [u8; 0],
}
pub type GC = *mut _XGC;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Visual {
    pub ext_data: *mut XExtData,
    pub visualid: VisualID,
    pub class: ::std::os::raw::c_int,
    pub red_mask: ::std::os::raw::c_ulong,
    pub green_mask: ::std::os::raw::c_ulong,
    pub blue_mask: ::std::os::raw::c_ulong,
    pub bits_per_rgb: ::std::os::raw::c_int,
    pub map_entries: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Visual"][::std::mem::size_of::<Visual>() - 56usize];
    ["Alignment of Visual"][::std::mem::align_of::<Visual>() - 8usize];
    ["Offset of field: Visual::ext_data"][::std::mem::offset_of!(Visual, ext_data) - 0usize];
    ["Offset of field: Visual::visualid"][::std::mem::offset_of!(Visual, visualid) - 8usize];
    ["Offset of field: Visual::class"][::std::mem::offset_of!(Visual, class) - 16usize];
    ["Offset of field: Visual::red_mask"][::std::mem::offset_of!(Visual, red_mask) - 24usize];
    ["Offset of field: Visual::green_mask"][::std::mem::offset_of!(Visual, green_mask) - 32usize];
    ["Offset of field: Visual::blue_mask"][::std::mem::offset_of!(Visual, blue_mask) - 40usize];
    ["Offset of field: Visual::bits_per_rgb"]
        [::std::mem::offset_of!(Visual, bits_per_rgb) - 48usize];
    ["Offset of field: Visual::map_entries"][::std::mem::offset_of!(Visual, map_entries) - 52usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Depth {
    pub depth: ::std::os::raw::c_int,
    pub nvisuals: ::std::os::raw::c_int,
    pub visuals: *mut Visual,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Depth"][::std::mem::size_of::<Depth>() - 16usize];
    ["Alignment of Depth"][::std::mem::align_of::<Depth>() - 8usize];
    ["Offset of field: Depth::depth"][::std::mem::offset_of!(Depth, depth) - 0usize];
    ["Offset of field: Depth::nvisuals"][::std::mem::offset_of!(Depth, nvisuals) - 4usize];
    ["Offset of field: Depth::visuals"][::std::mem::offset_of!(Depth, visuals) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XDisplay {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Screen {
    pub ext_data: *mut XExtData,
    pub display: *mut _XDisplay,
    pub root: Window,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub mwidth: ::std::os::raw::c_int,
    pub mheight: ::std::os::raw::c_int,
    pub ndepths: ::std::os::raw::c_int,
    pub depths: *mut Depth,
    pub root_depth: ::std::os::raw::c_int,
    pub root_visual: *mut Visual,
    pub default_gc: GC,
    pub cmap: Colormap,
    pub white_pixel: ::std::os::raw::c_ulong,
    pub black_pixel: ::std::os::raw::c_ulong,
    pub max_maps: ::std::os::raw::c_int,
    pub min_maps: ::std::os::raw::c_int,
    pub backing_store: ::std::os::raw::c_int,
    pub save_unders: ::std::os::raw::c_int,
    pub root_input_mask: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Screen"][::std::mem::size_of::<Screen>() - 128usize];
    ["Alignment of Screen"][::std::mem::align_of::<Screen>() - 8usize];
    ["Offset of field: Screen::ext_data"][::std::mem::offset_of!(Screen, ext_data) - 0usize];
    ["Offset of field: Screen::display"][::std::mem::offset_of!(Screen, display) - 8usize];
    ["Offset of field: Screen::root"][::std::mem::offset_of!(Screen, root) - 16usize];
    ["Offset of field: Screen::width"][::std::mem::offset_of!(Screen, width) - 24usize];
    ["Offset of field: Screen::height"][::std::mem::offset_of!(Screen, height) - 28usize];
    ["Offset of field: Screen::mwidth"][::std::mem::offset_of!(Screen, mwidth) - 32usize];
    ["Offset of field: Screen::mheight"][::std::mem::offset_of!(Screen, mheight) - 36usize];
    ["Offset of field: Screen::ndepths"][::std::mem::offset_of!(Screen, ndepths) - 40usize];
    ["Offset of field: Screen::depths"][::std::mem::offset_of!(Screen, depths) - 48usize];
    ["Offset of field: Screen::root_depth"][::std::mem::offset_of!(Screen, root_depth) - 56usize];
    ["Offset of field: Screen::root_visual"][::std::mem::offset_of!(Screen, root_visual) - 64usize];
    ["Offset of field: Screen::default_gc"][::std::mem::offset_of!(Screen, default_gc) - 72usize];
    ["Offset of field: Screen::cmap"][::std::mem::offset_of!(Screen, cmap) - 80usize];
    ["Offset of field: Screen::white_pixel"][::std::mem::offset_of!(Screen, white_pixel) - 88usize];
    ["Offset of field: Screen::black_pixel"][::std::mem::offset_of!(Screen, black_pixel) - 96usize];
    ["Offset of field: Screen::max_maps"][::std::mem::offset_of!(Screen, max_maps) - 104usize];
    ["Offset of field: Screen::min_maps"][::std::mem::offset_of!(Screen, min_maps) - 108usize];
    ["Offset of field: Screen::backing_store"]
        [::std::mem::offset_of!(Screen, backing_store) - 112usize];
    ["Offset of field: Screen::save_unders"]
        [::std::mem::offset_of!(Screen, save_unders) - 116usize];
    ["Offset of field: Screen::root_input_mask"]
        [::std::mem::offset_of!(Screen, root_input_mask) - 120usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ScreenFormat {
    pub ext_data: *mut XExtData,
    pub depth: ::std::os::raw::c_int,
    pub bits_per_pixel: ::std::os::raw::c_int,
    pub scanline_pad: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ScreenFormat"][::std::mem::size_of::<ScreenFormat>() - 24usize];
    ["Alignment of ScreenFormat"][::std::mem::align_of::<ScreenFormat>() - 8usize];
    ["Offset of field: ScreenFormat::ext_data"]
        [::std::mem::offset_of!(ScreenFormat, ext_data) - 0usize];
    ["Offset of field: ScreenFormat::depth"][::std::mem::offset_of!(ScreenFormat, depth) - 8usize];
    ["Offset of field: ScreenFormat::bits_per_pixel"]
        [::std::mem::offset_of!(ScreenFormat, bits_per_pixel) - 12usize];
    ["Offset of field: ScreenFormat::scanline_pad"]
        [::std::mem::offset_of!(ScreenFormat, scanline_pad) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XSetWindowAttributes {
    pub background_pixmap: Pixmap,
    pub background_pixel: ::std::os::raw::c_ulong,
    pub border_pixmap: Pixmap,
    pub border_pixel: ::std::os::raw::c_ulong,
    pub bit_gravity: ::std::os::raw::c_int,
    pub win_gravity: ::std::os::raw::c_int,
    pub backing_store: ::std::os::raw::c_int,
    pub backing_planes: ::std::os::raw::c_ulong,
    pub backing_pixel: ::std::os::raw::c_ulong,
    pub save_under: ::std::os::raw::c_int,
    pub event_mask: ::std::os::raw::c_long,
    pub do_not_propagate_mask: ::std::os::raw::c_long,
    pub override_redirect: ::std::os::raw::c_int,
    pub colormap: Colormap,
    pub cursor: Cursor,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XSetWindowAttributes"][::std::mem::size_of::<XSetWindowAttributes>() - 112usize];
    ["Alignment of XSetWindowAttributes"][::std::mem::align_of::<XSetWindowAttributes>() - 8usize];
    ["Offset of field: XSetWindowAttributes::background_pixmap"]
        [::std::mem::offset_of!(XSetWindowAttributes, background_pixmap) - 0usize];
    ["Offset of field: XSetWindowAttributes::background_pixel"]
        [::std::mem::offset_of!(XSetWindowAttributes, background_pixel) - 8usize];
    ["Offset of field: XSetWindowAttributes::border_pixmap"]
        [::std::mem::offset_of!(XSetWindowAttributes, border_pixmap) - 16usize];
    ["Offset of field: XSetWindowAttributes::border_pixel"]
        [::std::mem::offset_of!(XSetWindowAttributes, border_pixel) - 24usize];
    ["Offset of field: XSetWindowAttributes::bit_gravity"]
        [::std::mem::offset_of!(XSetWindowAttributes, bit_gravity) - 32usize];
    ["Offset of field: XSetWindowAttributes::win_gravity"]
        [::std::mem::offset_of!(XSetWindowAttributes, win_gravity) - 36usize];
    ["Offset of field: XSetWindowAttributes::backing_store"]
        [::std::mem::offset_of!(XSetWindowAttributes, backing_store) - 40usize];
    ["Offset of field: XSetWindowAttributes::backing_planes"]
        [::std::mem::offset_of!(XSetWindowAttributes, backing_planes) - 48usize];
    ["Offset of field: XSetWindowAttributes::backing_pixel"]
        [::std::mem::offset_of!(XSetWindowAttributes, backing_pixel) - 56usize];
    ["Offset of field: XSetWindowAttributes::save_under"]
        [::std::mem::offset_of!(XSetWindowAttributes, save_under) - 64usize];
    ["Offset of field: XSetWindowAttributes::event_mask"]
        [::std::mem::offset_of!(XSetWindowAttributes, event_mask) - 72usize];
    ["Offset of field: XSetWindowAttributes::do_not_propagate_mask"]
        [::std::mem::offset_of!(XSetWindowAttributes, do_not_propagate_mask) - 80usize];
    ["Offset of field: XSetWindowAttributes::override_redirect"]
        [::std::mem::offset_of!(XSetWindowAttributes, override_redirect) - 88usize];
    ["Offset of field: XSetWindowAttributes::colormap"]
        [::std::mem::offset_of!(XSetWindowAttributes, colormap) - 96usize];
    ["Offset of field: XSetWindowAttributes::cursor"]
        [::std::mem::offset_of!(XSetWindowAttributes, cursor) - 104usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XWindowAttributes {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub border_width: ::std::os::raw::c_int,
    pub depth: ::std::os::raw::c_int,
    pub visual: *mut Visual,
    pub root: Window,
    pub class: ::std::os::raw::c_int,
    pub bit_gravity: ::std::os::raw::c_int,
    pub win_gravity: ::std::os::raw::c_int,
    pub backing_store: ::std::os::raw::c_int,
    pub backing_planes: ::std::os::raw::c_ulong,
    pub backing_pixel: ::std::os::raw::c_ulong,
    pub save_under: ::std::os::raw::c_int,
    pub colormap: Colormap,
    pub map_installed: ::std::os::raw::c_int,
    pub map_state: ::std::os::raw::c_int,
    pub all_event_masks: ::std::os::raw::c_long,
    pub your_event_mask: ::std::os::raw::c_long,
    pub do_not_propagate_mask: ::std::os::raw::c_long,
    pub override_redirect: ::std::os::raw::c_int,
    pub screen: *mut Screen,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XWindowAttributes"][::std::mem::size_of::<XWindowAttributes>() - 136usize];
    ["Alignment of XWindowAttributes"][::std::mem::align_of::<XWindowAttributes>() - 8usize];
    ["Offset of field: XWindowAttributes::x"]
        [::std::mem::offset_of!(XWindowAttributes, x) - 0usize];
    ["Offset of field: XWindowAttributes::y"]
        [::std::mem::offset_of!(XWindowAttributes, y) - 4usize];
    ["Offset of field: XWindowAttributes::width"]
        [::std::mem::offset_of!(XWindowAttributes, width) - 8usize];
    ["Offset of field: XWindowAttributes::height"]
        [::std::mem::offset_of!(XWindowAttributes, height) - 12usize];
    ["Offset of field: XWindowAttributes::border_width"]
        [::std::mem::offset_of!(XWindowAttributes, border_width) - 16usize];
    ["Offset of field: XWindowAttributes::depth"]
        [::std::mem::offset_of!(XWindowAttributes, depth) - 20usize];
    ["Offset of field: XWindowAttributes::visual"]
        [::std::mem::offset_of!(XWindowAttributes, visual) - 24usize];
    ["Offset of field: XWindowAttributes::root"]
        [::std::mem::offset_of!(XWindowAttributes, root) - 32usize];
    ["Offset of field: XWindowAttributes::class"]
        [::std::mem::offset_of!(XWindowAttributes, class) - 40usize];
    ["Offset of field: XWindowAttributes::bit_gravity"]
        [::std::mem::offset_of!(XWindowAttributes, bit_gravity) - 44usize];
    ["Offset of field: XWindowAttributes::win_gravity"]
        [::std::mem::offset_of!(XWindowAttributes, win_gravity) - 48usize];
    ["Offset of field: XWindowAttributes::backing_store"]
        [::std::mem::offset_of!(XWindowAttributes, backing_store) - 52usize];
    ["Offset of field: XWindowAttributes::backing_planes"]
        [::std::mem::offset_of!(XWindowAttributes, backing_planes) - 56usize];
    ["Offset of field: XWindowAttributes::backing_pixel"]
        [::std::mem::offset_of!(XWindowAttributes, backing_pixel) - 64usize];
    ["Offset of field: XWindowAttributes::save_under"]
        [::std::mem::offset_of!(XWindowAttributes, save_under) - 72usize];
    ["Offset of field: XWindowAttributes::colormap"]
        [::std::mem::offset_of!(XWindowAttributes, colormap) - 80usize];
    ["Offset of field: XWindowAttributes::map_installed"]
        [::std::mem::offset_of!(XWindowAttributes, map_installed) - 88usize];
    ["Offset of field: XWindowAttributes::map_state"]
        [::std::mem::offset_of!(XWindowAttributes, map_state) - 92usize];
    ["Offset of field: XWindowAttributes::all_event_masks"]
        [::std::mem::offset_of!(XWindowAttributes, all_event_masks) - 96usize];
    ["Offset of field: XWindowAttributes::your_event_mask"]
        [::std::mem::offset_of!(XWindowAttributes, your_event_mask) - 104usize];
    ["Offset of field: XWindowAttributes::do_not_propagate_mask"]
        [::std::mem::offset_of!(XWindowAttributes, do_not_propagate_mask) - 112usize];
    ["Offset of field: XWindowAttributes::override_redirect"]
        [::std::mem::offset_of!(XWindowAttributes, override_redirect) - 120usize];
    ["Offset of field: XWindowAttributes::screen"]
        [::std::mem::offset_of!(XWindowAttributes, screen) - 128usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XHostAddress {
    pub family: ::std::os::raw::c_int,
    pub length: ::std::os::raw::c_int,
    pub address: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XHostAddress"][::std::mem::size_of::<XHostAddress>() - 16usize];
    ["Alignment of XHostAddress"][::std::mem::align_of::<XHostAddress>() - 8usize];
    ["Offset of field: XHostAddress::family"]
        [::std::mem::offset_of!(XHostAddress, family) - 0usize];
    ["Offset of field: XHostAddress::length"]
        [::std::mem::offset_of!(XHostAddress, length) - 4usize];
    ["Offset of field: XHostAddress::address"]
        [::std::mem::offset_of!(XHostAddress, address) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XServerInterpretedAddress {
    pub typelength: ::std::os::raw::c_int,
    pub valuelength: ::std::os::raw::c_int,
    pub type_: *mut ::std::os::raw::c_char,
    pub value: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XServerInterpretedAddress"]
        [::std::mem::size_of::<XServerInterpretedAddress>() - 24usize];
    ["Alignment of XServerInterpretedAddress"]
        [::std::mem::align_of::<XServerInterpretedAddress>() - 8usize];
    ["Offset of field: XServerInterpretedAddress::typelength"]
        [::std::mem::offset_of!(XServerInterpretedAddress, typelength) - 0usize];
    ["Offset of field: XServerInterpretedAddress::valuelength"]
        [::std::mem::offset_of!(XServerInterpretedAddress, valuelength) - 4usize];
    ["Offset of field: XServerInterpretedAddress::type_"]
        [::std::mem::offset_of!(XServerInterpretedAddress, type_) - 8usize];
    ["Offset of field: XServerInterpretedAddress::value"]
        [::std::mem::offset_of!(XServerInterpretedAddress, value) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XImage {
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub xoffset: ::std::os::raw::c_int,
    pub format: ::std::os::raw::c_int,
    pub data: *mut ::std::os::raw::c_char,
    pub byte_order: ::std::os::raw::c_int,
    pub bitmap_unit: ::std::os::raw::c_int,
    pub bitmap_bit_order: ::std::os::raw::c_int,
    pub bitmap_pad: ::std::os::raw::c_int,
    pub depth: ::std::os::raw::c_int,
    pub bytes_per_line: ::std::os::raw::c_int,
    pub bits_per_pixel: ::std::os::raw::c_int,
    pub red_mask: ::std::os::raw::c_ulong,
    pub green_mask: ::std::os::raw::c_ulong,
    pub blue_mask: ::std::os::raw::c_ulong,
    pub obdata: XPointer,
    pub f: _XImage_funcs,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XImage_funcs {
    pub create_image: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _XDisplay,
            arg2: *mut Visual,
            arg3: ::std::os::raw::c_uint,
            arg4: ::std::os::raw::c_int,
            arg5: ::std::os::raw::c_int,
            arg6: *mut ::std::os::raw::c_char,
            arg7: ::std::os::raw::c_uint,
            arg8: ::std::os::raw::c_uint,
            arg9: ::std::os::raw::c_int,
            arg10: ::std::os::raw::c_int,
        ) -> *mut _XImage,
    >,
    pub destroy_image:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut _XImage) -> ::std::os::raw::c_int>,
    pub get_pixel: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _XImage,
            arg2: ::std::os::raw::c_int,
            arg3: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_ulong,
    >,
    pub put_pixel: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _XImage,
            arg2: ::std::os::raw::c_int,
            arg3: ::std::os::raw::c_int,
            arg4: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_int,
    >,
    pub sub_image: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _XImage,
            arg2: ::std::os::raw::c_int,
            arg3: ::std::os::raw::c_int,
            arg4: ::std::os::raw::c_uint,
            arg5: ::std::os::raw::c_uint,
        ) -> *mut _XImage,
    >,
    pub add_pixel: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut _XImage,
            arg2: ::std::os::raw::c_long,
        ) -> ::std::os::raw::c_int,
    >,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XImage_funcs"][::std::mem::size_of::<_XImage_funcs>() - 48usize];
    ["Alignment of _XImage_funcs"][::std::mem::align_of::<_XImage_funcs>() - 8usize];
    ["Offset of field: _XImage_funcs::create_image"]
        [::std::mem::offset_of!(_XImage_funcs, create_image) - 0usize];
    ["Offset of field: _XImage_funcs::destroy_image"]
        [::std::mem::offset_of!(_XImage_funcs, destroy_image) - 8usize];
    ["Offset of field: _XImage_funcs::get_pixel"]
        [::std::mem::offset_of!(_XImage_funcs, get_pixel) - 16usize];
    ["Offset of field: _XImage_funcs::put_pixel"]
        [::std::mem::offset_of!(_XImage_funcs, put_pixel) - 24usize];
    ["Offset of field: _XImage_funcs::sub_image"]
        [::std::mem::offset_of!(_XImage_funcs, sub_image) - 32usize];
    ["Offset of field: _XImage_funcs::add_pixel"]
        [::std::mem::offset_of!(_XImage_funcs, add_pixel) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XImage"][::std::mem::size_of::<_XImage>() - 136usize];
    ["Alignment of _XImage"][::std::mem::align_of::<_XImage>() - 8usize];
    ["Offset of field: _XImage::width"][::std::mem::offset_of!(_XImage, width) - 0usize];
    ["Offset of field: _XImage::height"][::std::mem::offset_of!(_XImage, height) - 4usize];
    ["Offset of field: _XImage::xoffset"][::std::mem::offset_of!(_XImage, xoffset) - 8usize];
    ["Offset of field: _XImage::format"][::std::mem::offset_of!(_XImage, format) - 12usize];
    ["Offset of field: _XImage::data"][::std::mem::offset_of!(_XImage, data) - 16usize];
    ["Offset of field: _XImage::byte_order"][::std::mem::offset_of!(_XImage, byte_order) - 24usize];
    ["Offset of field: _XImage::bitmap_unit"]
        [::std::mem::offset_of!(_XImage, bitmap_unit) - 28usize];
    ["Offset of field: _XImage::bitmap_bit_order"]
        [::std::mem::offset_of!(_XImage, bitmap_bit_order) - 32usize];
    ["Offset of field: _XImage::bitmap_pad"][::std::mem::offset_of!(_XImage, bitmap_pad) - 36usize];
    ["Offset of field: _XImage::depth"][::std::mem::offset_of!(_XImage, depth) - 40usize];
    ["Offset of field: _XImage::bytes_per_line"]
        [::std::mem::offset_of!(_XImage, bytes_per_line) - 44usize];
    ["Offset of field: _XImage::bits_per_pixel"]
        [::std::mem::offset_of!(_XImage, bits_per_pixel) - 48usize];
    ["Offset of field: _XImage::red_mask"][::std::mem::offset_of!(_XImage, red_mask) - 56usize];
    ["Offset of field: _XImage::green_mask"][::std::mem::offset_of!(_XImage, green_mask) - 64usize];
    ["Offset of field: _XImage::blue_mask"][::std::mem::offset_of!(_XImage, blue_mask) - 72usize];
    ["Offset of field: _XImage::obdata"][::std::mem::offset_of!(_XImage, obdata) - 80usize];
    ["Offset of field: _XImage::f"][::std::mem::offset_of!(_XImage, f) - 88usize];
};
pub type XImage = _XImage;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XWindowChanges {
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub border_width: ::std::os::raw::c_int,
    pub sibling: Window,
    pub stack_mode: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XWindowChanges"][::std::mem::size_of::<XWindowChanges>() - 40usize];
    ["Alignment of XWindowChanges"][::std::mem::align_of::<XWindowChanges>() - 8usize];
    ["Offset of field: XWindowChanges::x"][::std::mem::offset_of!(XWindowChanges, x) - 0usize];
    ["Offset of field: XWindowChanges::y"][::std::mem::offset_of!(XWindowChanges, y) - 4usize];
    ["Offset of field: XWindowChanges::width"]
        [::std::mem::offset_of!(XWindowChanges, width) - 8usize];
    ["Offset of field: XWindowChanges::height"]
        [::std::mem::offset_of!(XWindowChanges, height) - 12usize];
    ["Offset of field: XWindowChanges::border_width"]
        [::std::mem::offset_of!(XWindowChanges, border_width) - 16usize];
    ["Offset of field: XWindowChanges::sibling"]
        [::std::mem::offset_of!(XWindowChanges, sibling) - 24usize];
    ["Offset of field: XWindowChanges::stack_mode"]
        [::std::mem::offset_of!(XWindowChanges, stack_mode) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XColor {
    pub pixel: ::std::os::raw::c_ulong,
    pub red: ::std::os::raw::c_ushort,
    pub green: ::std::os::raw::c_ushort,
    pub blue: ::std::os::raw::c_ushort,
    pub flags: ::std::os::raw::c_char,
    pub pad: ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XColor"][::std::mem::size_of::<XColor>() - 16usize];
    ["Alignment of XColor"][::std::mem::align_of::<XColor>() - 8usize];
    ["Offset of field: XColor::pixel"][::std::mem::offset_of!(XColor, pixel) - 0usize];
    ["Offset of field: XColor::red"][::std::mem::offset_of!(XColor, red) - 8usize];
    ["Offset of field: XColor::green"][::std::mem::offset_of!(XColor, green) - 10usize];
    ["Offset of field: XColor::blue"][::std::mem::offset_of!(XColor, blue) - 12usize];
    ["Offset of field: XColor::flags"][::std::mem::offset_of!(XColor, flags) - 14usize];
    ["Offset of field: XColor::pad"][::std::mem::offset_of!(XColor, pad) - 15usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XSegment {
    pub x1: ::std::os::raw::c_short,
    pub y1: ::std::os::raw::c_short,
    pub x2: ::std::os::raw::c_short,
    pub y2: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XSegment"][::std::mem::size_of::<XSegment>() - 8usize];
    ["Alignment of XSegment"][::std::mem::align_of::<XSegment>() - 2usize];
    ["Offset of field: XSegment::x1"][::std::mem::offset_of!(XSegment, x1) - 0usize];
    ["Offset of field: XSegment::y1"][::std::mem::offset_of!(XSegment, y1) - 2usize];
    ["Offset of field: XSegment::x2"][::std::mem::offset_of!(XSegment, x2) - 4usize];
    ["Offset of field: XSegment::y2"][::std::mem::offset_of!(XSegment, y2) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XPoint {
    pub x: ::std::os::raw::c_short,
    pub y: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XPoint"][::std::mem::size_of::<XPoint>() - 4usize];
    ["Alignment of XPoint"][::std::mem::align_of::<XPoint>() - 2usize];
    ["Offset of field: XPoint::x"][::std::mem::offset_of!(XPoint, x) - 0usize];
    ["Offset of field: XPoint::y"][::std::mem::offset_of!(XPoint, y) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XRectangle {
    pub x: ::std::os::raw::c_short,
    pub y: ::std::os::raw::c_short,
    pub width: ::std::os::raw::c_ushort,
    pub height: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XRectangle"][::std::mem::size_of::<XRectangle>() - 8usize];
    ["Alignment of XRectangle"][::std::mem::align_of::<XRectangle>() - 2usize];
    ["Offset of field: XRectangle::x"][::std::mem::offset_of!(XRectangle, x) - 0usize];
    ["Offset of field: XRectangle::y"][::std::mem::offset_of!(XRectangle, y) - 2usize];
    ["Offset of field: XRectangle::width"][::std::mem::offset_of!(XRectangle, width) - 4usize];
    ["Offset of field: XRectangle::height"][::std::mem::offset_of!(XRectangle, height) - 6usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XArc {
    pub x: ::std::os::raw::c_short,
    pub y: ::std::os::raw::c_short,
    pub width: ::std::os::raw::c_ushort,
    pub height: ::std::os::raw::c_ushort,
    pub angle1: ::std::os::raw::c_short,
    pub angle2: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XArc"][::std::mem::size_of::<XArc>() - 12usize];
    ["Alignment of XArc"][::std::mem::align_of::<XArc>() - 2usize];
    ["Offset of field: XArc::x"][::std::mem::offset_of!(XArc, x) - 0usize];
    ["Offset of field: XArc::y"][::std::mem::offset_of!(XArc, y) - 2usize];
    ["Offset of field: XArc::width"][::std::mem::offset_of!(XArc, width) - 4usize];
    ["Offset of field: XArc::height"][::std::mem::offset_of!(XArc, height) - 6usize];
    ["Offset of field: XArc::angle1"][::std::mem::offset_of!(XArc, angle1) - 8usize];
    ["Offset of field: XArc::angle2"][::std::mem::offset_of!(XArc, angle2) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XKeyboardControl {
    pub key_click_percent: ::std::os::raw::c_int,
    pub bell_percent: ::std::os::raw::c_int,
    pub bell_pitch: ::std::os::raw::c_int,
    pub bell_duration: ::std::os::raw::c_int,
    pub led: ::std::os::raw::c_int,
    pub led_mode: ::std::os::raw::c_int,
    pub key: ::std::os::raw::c_int,
    pub auto_repeat_mode: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XKeyboardControl"][::std::mem::size_of::<XKeyboardControl>() - 32usize];
    ["Alignment of XKeyboardControl"][::std::mem::align_of::<XKeyboardControl>() - 4usize];
    ["Offset of field: XKeyboardControl::key_click_percent"]
        [::std::mem::offset_of!(XKeyboardControl, key_click_percent) - 0usize];
    ["Offset of field: XKeyboardControl::bell_percent"]
        [::std::mem::offset_of!(XKeyboardControl, bell_percent) - 4usize];
    ["Offset of field: XKeyboardControl::bell_pitch"]
        [::std::mem::offset_of!(XKeyboardControl, bell_pitch) - 8usize];
    ["Offset of field: XKeyboardControl::bell_duration"]
        [::std::mem::offset_of!(XKeyboardControl, bell_duration) - 12usize];
    ["Offset of field: XKeyboardControl::led"]
        [::std::mem::offset_of!(XKeyboardControl, led) - 16usize];
    ["Offset of field: XKeyboardControl::led_mode"]
        [::std::mem::offset_of!(XKeyboardControl, led_mode) - 20usize];
    ["Offset of field: XKeyboardControl::key"]
        [::std::mem::offset_of!(XKeyboardControl, key) - 24usize];
    ["Offset of field: XKeyboardControl::auto_repeat_mode"]
        [::std::mem::offset_of!(XKeyboardControl, auto_repeat_mode) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XKeyboardState {
    pub key_click_percent: ::std::os::raw::c_int,
    pub bell_percent: ::std::os::raw::c_int,
    pub bell_pitch: ::std::os::raw::c_uint,
    pub bell_duration: ::std::os::raw::c_uint,
    pub led_mask: ::std::os::raw::c_ulong,
    pub global_auto_repeat: ::std::os::raw::c_int,
    pub auto_repeats: [::std::os::raw::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XKeyboardState"][::std::mem::size_of::<XKeyboardState>() - 64usize];
    ["Alignment of XKeyboardState"][::std::mem::align_of::<XKeyboardState>() - 8usize];
    ["Offset of field: XKeyboardState::key_click_percent"]
        [::std::mem::offset_of!(XKeyboardState, key_click_percent) - 0usize];
    ["Offset of field: XKeyboardState::bell_percent"]
        [::std::mem::offset_of!(XKeyboardState, bell_percent) - 4usize];
    ["Offset of field: XKeyboardState::bell_pitch"]
        [::std::mem::offset_of!(XKeyboardState, bell_pitch) - 8usize];
    ["Offset of field: XKeyboardState::bell_duration"]
        [::std::mem::offset_of!(XKeyboardState, bell_duration) - 12usize];
    ["Offset of field: XKeyboardState::led_mask"]
        [::std::mem::offset_of!(XKeyboardState, led_mask) - 16usize];
    ["Offset of field: XKeyboardState::global_auto_repeat"]
        [::std::mem::offset_of!(XKeyboardState, global_auto_repeat) - 24usize];
    ["Offset of field: XKeyboardState::auto_repeats"]
        [::std::mem::offset_of!(XKeyboardState, auto_repeats) - 28usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XTimeCoord {
    pub time: Time,
    pub x: ::std::os::raw::c_short,
    pub y: ::std::os::raw::c_short,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XTimeCoord"][::std::mem::size_of::<XTimeCoord>() - 16usize];
    ["Alignment of XTimeCoord"][::std::mem::align_of::<XTimeCoord>() - 8usize];
    ["Offset of field: XTimeCoord::time"][::std::mem::offset_of!(XTimeCoord, time) - 0usize];
    ["Offset of field: XTimeCoord::x"][::std::mem::offset_of!(XTimeCoord, x) - 8usize];
    ["Offset of field: XTimeCoord::y"][::std::mem::offset_of!(XTimeCoord, y) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XModifierKeymap {
    pub max_keypermod: ::std::os::raw::c_int,
    pub modifiermap: *mut KeyCode,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XModifierKeymap"][::std::mem::size_of::<XModifierKeymap>() - 16usize];
    ["Alignment of XModifierKeymap"][::std::mem::align_of::<XModifierKeymap>() - 8usize];
    ["Offset of field: XModifierKeymap::max_keypermod"]
        [::std::mem::offset_of!(XModifierKeymap, max_keypermod) - 0usize];
    ["Offset of field: XModifierKeymap::modifiermap"]
        [::std::mem::offset_of!(XModifierKeymap, modifiermap) - 8usize];
};
pub type Display = _XDisplay;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XPrivate {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XrmHashBucketRec {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _bindgen_ty_1 {
    pub ext_data: *mut XExtData,
    pub private1: *mut _XPrivate,
    pub fd: ::std::os::raw::c_int,
    pub private2: ::std::os::raw::c_int,
    pub proto_major_version: ::std::os::raw::c_int,
    pub proto_minor_version: ::std::os::raw::c_int,
    pub vendor: *mut ::std::os::raw::c_char,
    pub private3: XID,
    pub private4: XID,
    pub private5: XID,
    pub private6: ::std::os::raw::c_int,
    pub resource_alloc: ::std::option::Option<unsafe extern "C" fn(arg1: *mut _XDisplay) -> XID>,
    pub byte_order: ::std::os::raw::c_int,
    pub bitmap_unit: ::std::os::raw::c_int,
    pub bitmap_pad: ::std::os::raw::c_int,
    pub bitmap_bit_order: ::std::os::raw::c_int,
    pub nformats: ::std::os::raw::c_int,
    pub pixmap_format: *mut ScreenFormat,
    pub private8: ::std::os::raw::c_int,
    pub release: ::std::os::raw::c_int,
    pub private9: *mut _XPrivate,
    pub private10: *mut _XPrivate,
    pub qlen: ::std::os::raw::c_int,
    pub last_request_read: ::std::os::raw::c_ulong,
    pub request: ::std::os::raw::c_ulong,
    pub private11: XPointer,
    pub private12: XPointer,
    pub private13: XPointer,
    pub private14: XPointer,
    pub max_request_size: ::std::os::raw::c_uint,
    pub db: *mut _XrmHashBucketRec,
    pub private15:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut _XDisplay) -> ::std::os::raw::c_int>,
    pub display_name: *mut ::std::os::raw::c_char,
    pub default_screen: ::std::os::raw::c_int,
    pub nscreens: ::std::os::raw::c_int,
    pub screens: *mut Screen,
    pub motion_buffer: ::std::os::raw::c_ulong,
    pub private16: ::std::os::raw::c_ulong,
    pub min_keycode: ::std::os::raw::c_int,
    pub max_keycode: ::std::os::raw::c_int,
    pub private17: XPointer,
    pub private18: XPointer,
    pub private19: ::std::os::raw::c_int,
    pub xdefaults: *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _bindgen_ty_1"][::std::mem::size_of::<_bindgen_ty_1>() - 296usize];
    ["Alignment of _bindgen_ty_1"][::std::mem::align_of::<_bindgen_ty_1>() - 8usize];
    ["Offset of field: _bindgen_ty_1::ext_data"]
        [::std::mem::offset_of!(_bindgen_ty_1, ext_data) - 0usize];
    ["Offset of field: _bindgen_ty_1::private1"]
        [::std::mem::offset_of!(_bindgen_ty_1, private1) - 8usize];
    ["Offset of field: _bindgen_ty_1::fd"][::std::mem::offset_of!(_bindgen_ty_1, fd) - 16usize];
    ["Offset of field: _bindgen_ty_1::private2"]
        [::std::mem::offset_of!(_bindgen_ty_1, private2) - 20usize];
    ["Offset of field: _bindgen_ty_1::proto_major_version"]
        [::std::mem::offset_of!(_bindgen_ty_1, proto_major_version) - 24usize];
    ["Offset of field: _bindgen_ty_1::proto_minor_version"]
        [::std::mem::offset_of!(_bindgen_ty_1, proto_minor_version) - 28usize];
    ["Offset of field: _bindgen_ty_1::vendor"]
        [::std::mem::offset_of!(_bindgen_ty_1, vendor) - 32usize];
    ["Offset of field: _bindgen_ty_1::private3"]
        [::std::mem::offset_of!(_bindgen_ty_1, private3) - 40usize];
    ["Offset of field: _bindgen_ty_1::private4"]
        [::std::mem::offset_of!(_bindgen_ty_1, private4) - 48usize];
    ["Offset of field: _bindgen_ty_1::private5"]
        [::std::mem::offset_of!(_bindgen_ty_1, private5) - 56usize];
    ["Offset of field: _bindgen_ty_1::private6"]
        [::std::mem::offset_of!(_bindgen_ty_1, private6) - 64usize];
    ["Offset of field: _bindgen_ty_1::resource_alloc"]
        [::std::mem::offset_of!(_bindgen_ty_1, resource_alloc) - 72usize];
    ["Offset of field: _bindgen_ty_1::byte_order"]
        [::std::mem::offset_of!(_bindgen_ty_1, byte_order) - 80usize];
    ["Offset of field: _bindgen_ty_1::bitmap_unit"]
        [::std::mem::offset_of!(_bindgen_ty_1, bitmap_unit) - 84usize];
    ["Offset of field: _bindgen_ty_1::bitmap_pad"]
        [::std::mem::offset_of!(_bindgen_ty_1, bitmap_pad) - 88usize];
    ["Offset of field: _bindgen_ty_1::bitmap_bit_order"]
        [::std::mem::offset_of!(_bindgen_ty_1, bitmap_bit_order) - 92usize];
    ["Offset of field: _bindgen_ty_1::nformats"]
        [::std::mem::offset_of!(_bindgen_ty_1, nformats) - 96usize];
    ["Offset of field: _bindgen_ty_1::pixmap_format"]
        [::std::mem::offset_of!(_bindgen_ty_1, pixmap_format) - 104usize];
    ["Offset of field: _bindgen_ty_1::private8"]
        [::std::mem::offset_of!(_bindgen_ty_1, private8) - 112usize];
    ["Offset of field: _bindgen_ty_1::release"]
        [::std::mem::offset_of!(_bindgen_ty_1, release) - 116usize];
    ["Offset of field: _bindgen_ty_1::private9"]
        [::std::mem::offset_of!(_bindgen_ty_1, private9) - 120usize];
    ["Offset of field: _bindgen_ty_1::private10"]
        [::std::mem::offset_of!(_bindgen_ty_1, private10) - 128usize];
    ["Offset of field: _bindgen_ty_1::qlen"]
        [::std::mem::offset_of!(_bindgen_ty_1, qlen) - 136usize];
    ["Offset of field: _bindgen_ty_1::last_request_read"]
        [::std::mem::offset_of!(_bindgen_ty_1, last_request_read) - 144usize];
    ["Offset of field: _bindgen_ty_1::request"]
        [::std::mem::offset_of!(_bindgen_ty_1, request) - 152usize];
    ["Offset of field: _bindgen_ty_1::private11"]
        [::std::mem::offset_of!(_bindgen_ty_1, private11) - 160usize];
    ["Offset of field: _bindgen_ty_1::private12"]
        [::std::mem::offset_of!(_bindgen_ty_1, private12) - 168usize];
    ["Offset of field: _bindgen_ty_1::private13"]
        [::std::mem::offset_of!(_bindgen_ty_1, private13) - 176usize];
    ["Offset of field: _bindgen_ty_1::private14"]
        [::std::mem::offset_of!(_bindgen_ty_1, private14) - 184usize];
    ["Offset of field: _bindgen_ty_1::max_request_size"]
        [::std::mem::offset_of!(_bindgen_ty_1, max_request_size) - 192usize];
    ["Offset of field: _bindgen_ty_1::db"][::std::mem::offset_of!(_bindgen_ty_1, db) - 200usize];
    ["Offset of field: _bindgen_ty_1::private15"]
        [::std::mem::offset_of!(_bindgen_ty_1, private15) - 208usize];
    ["Offset of field: _bindgen_ty_1::display_name"]
        [::std::mem::offset_of!(_bindgen_ty_1, display_name) - 216usize];
    ["Offset of field: _bindgen_ty_1::default_screen"]
        [::std::mem::offset_of!(_bindgen_ty_1, default_screen) - 224usize];
    ["Offset of field: _bindgen_ty_1::nscreens"]
        [::std::mem::offset_of!(_bindgen_ty_1, nscreens) - 228usize];
    ["Offset of field: _bindgen_ty_1::screens"]
        [::std::mem::offset_of!(_bindgen_ty_1, screens) - 232usize];
    ["Offset of field: _bindgen_ty_1::motion_buffer"]
        [::std::mem::offset_of!(_bindgen_ty_1, motion_buffer) - 240usize];
    ["Offset of field: _bindgen_ty_1::private16"]
        [::std::mem::offset_of!(_bindgen_ty_1, private16) - 248usize];
    ["Offset of field: _bindgen_ty_1::min_keycode"]
        [::std::mem::offset_of!(_bindgen_ty_1, min_keycode) - 256usize];
    ["Offset of field: _bindgen_ty_1::max_keycode"]
        [::std::mem::offset_of!(_bindgen_ty_1, max_keycode) - 260usize];
    ["Offset of field: _bindgen_ty_1::private17"]
        [::std::mem::offset_of!(_bindgen_ty_1, private17) - 264usize];
    ["Offset of field: _bindgen_ty_1::private18"]
        [::std::mem::offset_of!(_bindgen_ty_1, private18) - 272usize];
    ["Offset of field: _bindgen_ty_1::private19"]
        [::std::mem::offset_of!(_bindgen_ty_1, private19) - 280usize];
    ["Offset of field: _bindgen_ty_1::xdefaults"]
        [::std::mem::offset_of!(_bindgen_ty_1, xdefaults) - 288usize];
};
pub type _XPrivDisplay = *mut _bindgen_ty_1;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XKeyEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub window: Window,
    pub root: Window,
    pub subwindow: Window,
    pub time: Time,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub x_root: ::std::os::raw::c_int,
    pub y_root: ::std::os::raw::c_int,
    pub state: ::std::os::raw::c_uint,
    pub keycode: ::std::os::raw::c_uint,
    pub same_screen: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XKeyEvent"][::std::mem::size_of::<XKeyEvent>() - 96usize];
    ["Alignment of XKeyEvent"][::std::mem::align_of::<XKeyEvent>() - 8usize];
    ["Offset of field: XKeyEvent::type_"][::std::mem::offset_of!(XKeyEvent, type_) - 0usize];
    ["Offset of field: XKeyEvent::serial"][::std::mem::offset_of!(XKeyEvent, serial) - 8usize];
    ["Offset of field: XKeyEvent::send_event"]
        [::std::mem::offset_of!(XKeyEvent, send_event) - 16usize];
    ["Offset of field: XKeyEvent::display"][::std::mem::offset_of!(XKeyEvent, display) - 24usize];
    ["Offset of field: XKeyEvent::window"][::std::mem::offset_of!(XKeyEvent, window) - 32usize];
    ["Offset of field: XKeyEvent::root"][::std::mem::offset_of!(XKeyEvent, root) - 40usize];
    ["Offset of field: XKeyEvent::subwindow"]
        [::std::mem::offset_of!(XKeyEvent, subwindow) - 48usize];
    ["Offset of field: XKeyEvent::time"][::std::mem::offset_of!(XKeyEvent, time) - 56usize];
    ["Offset of field: XKeyEvent::x"][::std::mem::offset_of!(XKeyEvent, x) - 64usize];
    ["Offset of field: XKeyEvent::y"][::std::mem::offset_of!(XKeyEvent, y) - 68usize];
    ["Offset of field: XKeyEvent::x_root"][::std::mem::offset_of!(XKeyEvent, x_root) - 72usize];
    ["Offset of field: XKeyEvent::y_root"][::std::mem::offset_of!(XKeyEvent, y_root) - 76usize];
    ["Offset of field: XKeyEvent::state"][::std::mem::offset_of!(XKeyEvent, state) - 80usize];
    ["Offset of field: XKeyEvent::keycode"][::std::mem::offset_of!(XKeyEvent, keycode) - 84usize];
    ["Offset of field: XKeyEvent::same_screen"]
        [::std::mem::offset_of!(XKeyEvent, same_screen) - 88usize];
};
pub type XKeyPressedEvent = XKeyEvent;
pub type XKeyReleasedEvent = XKeyEvent;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XButtonEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub window: Window,
    pub root: Window,
    pub subwindow: Window,
    pub time: Time,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub x_root: ::std::os::raw::c_int,
    pub y_root: ::std::os::raw::c_int,
    pub state: ::std::os::raw::c_uint,
    pub button: ::std::os::raw::c_uint,
    pub same_screen: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XButtonEvent"][::std::mem::size_of::<XButtonEvent>() - 96usize];
    ["Alignment of XButtonEvent"][::std::mem::align_of::<XButtonEvent>() - 8usize];
    ["Offset of field: XButtonEvent::type_"][::std::mem::offset_of!(XButtonEvent, type_) - 0usize];
    ["Offset of field: XButtonEvent::serial"]
        [::std::mem::offset_of!(XButtonEvent, serial) - 8usize];
    ["Offset of field: XButtonEvent::send_event"]
        [::std::mem::offset_of!(XButtonEvent, send_event) - 16usize];
    ["Offset of field: XButtonEvent::display"]
        [::std::mem::offset_of!(XButtonEvent, display) - 24usize];
    ["Offset of field: XButtonEvent::window"]
        [::std::mem::offset_of!(XButtonEvent, window) - 32usize];
    ["Offset of field: XButtonEvent::root"][::std::mem::offset_of!(XButtonEvent, root) - 40usize];
    ["Offset of field: XButtonEvent::subwindow"]
        [::std::mem::offset_of!(XButtonEvent, subwindow) - 48usize];
    ["Offset of field: XButtonEvent::time"][::std::mem::offset_of!(XButtonEvent, time) - 56usize];
    ["Offset of field: XButtonEvent::x"][::std::mem::offset_of!(XButtonEvent, x) - 64usize];
    ["Offset of field: XButtonEvent::y"][::std::mem::offset_of!(XButtonEvent, y) - 68usize];
    ["Offset of field: XButtonEvent::x_root"]
        [::std::mem::offset_of!(XButtonEvent, x_root) - 72usize];
    ["Offset of field: XButtonEvent::y_root"]
        [::std::mem::offset_of!(XButtonEvent, y_root) - 76usize];
    ["Offset of field: XButtonEvent::state"][::std::mem::offset_of!(XButtonEvent, state) - 80usize];
    ["Offset of field: XButtonEvent::button"]
        [::std::mem::offset_of!(XButtonEvent, button) - 84usize];
    ["Offset of field: XButtonEvent::same_screen"]
        [::std::mem::offset_of!(XButtonEvent, same_screen) - 88usize];
};
pub type XButtonPressedEvent = XButtonEvent;
pub type XButtonReleasedEvent = XButtonEvent;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XMotionEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub window: Window,
    pub root: Window,
    pub subwindow: Window,
    pub time: Time,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub x_root: ::std::os::raw::c_int,
    pub y_root: ::std::os::raw::c_int,
    pub state: ::std::os::raw::c_uint,
    pub is_hint: ::std::os::raw::c_char,
    pub same_screen: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XMotionEvent"][::std::mem::size_of::<XMotionEvent>() - 96usize];
    ["Alignment of XMotionEvent"][::std::mem::align_of::<XMotionEvent>() - 8usize];
    ["Offset of field: XMotionEvent::type_"][::std::mem::offset_of!(XMotionEvent, type_) - 0usize];
    ["Offset of field: XMotionEvent::serial"]
        [::std::mem::offset_of!(XMotionEvent, serial) - 8usize];
    ["Offset of field: XMotionEvent::send_event"]
        [::std::mem::offset_of!(XMotionEvent, send_event) - 16usize];
    ["Offset of field: XMotionEvent::display"]
        [::std::mem::offset_of!(XMotionEvent, display) - 24usize];
    ["Offset of field: XMotionEvent::window"]
        [::std::mem::offset_of!(XMotionEvent, window) - 32usize];
    ["Offset of field: XMotionEvent::root"][::std::mem::offset_of!(XMotionEvent, root) - 40usize];
    ["Offset of field: XMotionEvent::subwindow"]
        [::std::mem::offset_of!(XMotionEvent, subwindow) - 48usize];
    ["Offset of field: XMotionEvent::time"][::std::mem::offset_of!(XMotionEvent, time) - 56usize];
    ["Offset of field: XMotionEvent::x"][::std::mem::offset_of!(XMotionEvent, x) - 64usize];
    ["Offset of field: XMotionEvent::y"][::std::mem::offset_of!(XMotionEvent, y) - 68usize];
    ["Offset of field: XMotionEvent::x_root"]
        [::std::mem::offset_of!(XMotionEvent, x_root) - 72usize];
    ["Offset of field: XMotionEvent::y_root"]
        [::std::mem::offset_of!(XMotionEvent, y_root) - 76usize];
    ["Offset of field: XMotionEvent::state"][::std::mem::offset_of!(XMotionEvent, state) - 80usize];
    ["Offset of field: XMotionEvent::is_hint"]
        [::std::mem::offset_of!(XMotionEvent, is_hint) - 84usize];
    ["Offset of field: XMotionEvent::same_screen"]
        [::std::mem::offset_of!(XMotionEvent, same_screen) - 88usize];
};
pub type XPointerMovedEvent = XMotionEvent;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XCrossingEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub window: Window,
    pub root: Window,
    pub subwindow: Window,
    pub time: Time,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub x_root: ::std::os::raw::c_int,
    pub y_root: ::std::os::raw::c_int,
    pub mode: ::std::os::raw::c_int,
    pub detail: ::std::os::raw::c_int,
    pub same_screen: ::std::os::raw::c_int,
    pub focus: ::std::os::raw::c_int,
    pub state: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XCrossingEvent"][::std::mem::size_of::<XCrossingEvent>() - 104usize];
    ["Alignment of XCrossingEvent"][::std::mem::align_of::<XCrossingEvent>() - 8usize];
    ["Offset of field: XCrossingEvent::type_"]
        [::std::mem::offset_of!(XCrossingEvent, type_) - 0usize];
    ["Offset of field: XCrossingEvent::serial"]
        [::std::mem::offset_of!(XCrossingEvent, serial) - 8usize];
    ["Offset of field: XCrossingEvent::send_event"]
        [::std::mem::offset_of!(XCrossingEvent, send_event) - 16usize];
    ["Offset of field: XCrossingEvent::display"]
        [::std::mem::offset_of!(XCrossingEvent, display) - 24usize];
    ["Offset of field: XCrossingEvent::window"]
        [::std::mem::offset_of!(XCrossingEvent, window) - 32usize];
    ["Offset of field: XCrossingEvent::root"]
        [::std::mem::offset_of!(XCrossingEvent, root) - 40usize];
    ["Offset of field: XCrossingEvent::subwindow"]
        [::std::mem::offset_of!(XCrossingEvent, subwindow) - 48usize];
    ["Offset of field: XCrossingEvent::time"]
        [::std::mem::offset_of!(XCrossingEvent, time) - 56usize];
    ["Offset of field: XCrossingEvent::x"][::std::mem::offset_of!(XCrossingEvent, x) - 64usize];
    ["Offset of field: XCrossingEvent::y"][::std::mem::offset_of!(XCrossingEvent, y) - 68usize];
    ["Offset of field: XCrossingEvent::x_root"]
        [::std::mem::offset_of!(XCrossingEvent, x_root) - 72usize];
    ["Offset of field: XCrossingEvent::y_root"]
        [::std::mem::offset_of!(XCrossingEvent, y_root) - 76usize];
    ["Offset of field: XCrossingEvent::mode"]
        [::std::mem::offset_of!(XCrossingEvent, mode) - 80usize];
    ["Offset of field: XCrossingEvent::detail"]
        [::std::mem::offset_of!(XCrossingEvent, detail) - 84usize];
    ["Offset of field: XCrossingEvent::same_screen"]
        [::std::mem::offset_of!(XCrossingEvent, same_screen) - 88usize];
    ["Offset of field: XCrossingEvent::focus"]
        [::std::mem::offset_of!(XCrossingEvent, focus) - 92usize];
    ["Offset of field: XCrossingEvent::state"]
        [::std::mem::offset_of!(XCrossingEvent, state) - 96usize];
};
pub type XEnterWindowEvent = XCrossingEvent;
pub type XLeaveWindowEvent = XCrossingEvent;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XFocusChangeEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub window: Window,
    pub mode: ::std::os::raw::c_int,
    pub detail: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XFocusChangeEvent"][::std::mem::size_of::<XFocusChangeEvent>() - 48usize];
    ["Alignment of XFocusChangeEvent"][::std::mem::align_of::<XFocusChangeEvent>() - 8usize];
    ["Offset of field: XFocusChangeEvent::type_"]
        [::std::mem::offset_of!(XFocusChangeEvent, type_) - 0usize];
    ["Offset of field: XFocusChangeEvent::serial"]
        [::std::mem::offset_of!(XFocusChangeEvent, serial) - 8usize];
    ["Offset of field: XFocusChangeEvent::send_event"]
        [::std::mem::offset_of!(XFocusChangeEvent, send_event) - 16usize];
    ["Offset of field: XFocusChangeEvent::display"]
        [::std::mem::offset_of!(XFocusChangeEvent, display) - 24usize];
    ["Offset of field: XFocusChangeEvent::window"]
        [::std::mem::offset_of!(XFocusChangeEvent, window) - 32usize];
    ["Offset of field: XFocusChangeEvent::mode"]
        [::std::mem::offset_of!(XFocusChangeEvent, mode) - 40usize];
    ["Offset of field: XFocusChangeEvent::detail"]
        [::std::mem::offset_of!(XFocusChangeEvent, detail) - 44usize];
};
pub type XFocusInEvent = XFocusChangeEvent;
pub type XFocusOutEvent = XFocusChangeEvent;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XKeymapEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub window: Window,
    pub key_vector: [::std::os::raw::c_char; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XKeymapEvent"][::std::mem::size_of::<XKeymapEvent>() - 72usize];
    ["Alignment of XKeymapEvent"][::std::mem::align_of::<XKeymapEvent>() - 8usize];
    ["Offset of field: XKeymapEvent::type_"][::std::mem::offset_of!(XKeymapEvent, type_) - 0usize];
    ["Offset of field: XKeymapEvent::serial"]
        [::std::mem::offset_of!(XKeymapEvent, serial) - 8usize];
    ["Offset of field: XKeymapEvent::send_event"]
        [::std::mem::offset_of!(XKeymapEvent, send_event) - 16usize];
    ["Offset of field: XKeymapEvent::display"]
        [::std::mem::offset_of!(XKeymapEvent, display) - 24usize];
    ["Offset of field: XKeymapEvent::window"]
        [::std::mem::offset_of!(XKeymapEvent, window) - 32usize];
    ["Offset of field: XKeymapEvent::key_vector"]
        [::std::mem::offset_of!(XKeymapEvent, key_vector) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XExposeEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub window: Window,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub count: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XExposeEvent"][::std::mem::size_of::<XExposeEvent>() - 64usize];
    ["Alignment of XExposeEvent"][::std::mem::align_of::<XExposeEvent>() - 8usize];
    ["Offset of field: XExposeEvent::type_"][::std::mem::offset_of!(XExposeEvent, type_) - 0usize];
    ["Offset of field: XExposeEvent::serial"]
        [::std::mem::offset_of!(XExposeEvent, serial) - 8usize];
    ["Offset of field: XExposeEvent::send_event"]
        [::std::mem::offset_of!(XExposeEvent, send_event) - 16usize];
    ["Offset of field: XExposeEvent::display"]
        [::std::mem::offset_of!(XExposeEvent, display) - 24usize];
    ["Offset of field: XExposeEvent::window"]
        [::std::mem::offset_of!(XExposeEvent, window) - 32usize];
    ["Offset of field: XExposeEvent::x"][::std::mem::offset_of!(XExposeEvent, x) - 40usize];
    ["Offset of field: XExposeEvent::y"][::std::mem::offset_of!(XExposeEvent, y) - 44usize];
    ["Offset of field: XExposeEvent::width"][::std::mem::offset_of!(XExposeEvent, width) - 48usize];
    ["Offset of field: XExposeEvent::height"]
        [::std::mem::offset_of!(XExposeEvent, height) - 52usize];
    ["Offset of field: XExposeEvent::count"][::std::mem::offset_of!(XExposeEvent, count) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XGraphicsExposeEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub drawable: Drawable,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub count: ::std::os::raw::c_int,
    pub major_code: ::std::os::raw::c_int,
    pub minor_code: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XGraphicsExposeEvent"][::std::mem::size_of::<XGraphicsExposeEvent>() - 72usize];
    ["Alignment of XGraphicsExposeEvent"][::std::mem::align_of::<XGraphicsExposeEvent>() - 8usize];
    ["Offset of field: XGraphicsExposeEvent::type_"]
        [::std::mem::offset_of!(XGraphicsExposeEvent, type_) - 0usize];
    ["Offset of field: XGraphicsExposeEvent::serial"]
        [::std::mem::offset_of!(XGraphicsExposeEvent, serial) - 8usize];
    ["Offset of field: XGraphicsExposeEvent::send_event"]
        [::std::mem::offset_of!(XGraphicsExposeEvent, send_event) - 16usize];
    ["Offset of field: XGraphicsExposeEvent::display"]
        [::std::mem::offset_of!(XGraphicsExposeEvent, display) - 24usize];
    ["Offset of field: XGraphicsExposeEvent::drawable"]
        [::std::mem::offset_of!(XGraphicsExposeEvent, drawable) - 32usize];
    ["Offset of field: XGraphicsExposeEvent::x"]
        [::std::mem::offset_of!(XGraphicsExposeEvent, x) - 40usize];
    ["Offset of field: XGraphicsExposeEvent::y"]
        [::std::mem::offset_of!(XGraphicsExposeEvent, y) - 44usize];
    ["Offset of field: XGraphicsExposeEvent::width"]
        [::std::mem::offset_of!(XGraphicsExposeEvent, width) - 48usize];
    ["Offset of field: XGraphicsExposeEvent::height"]
        [::std::mem::offset_of!(XGraphicsExposeEvent, height) - 52usize];
    ["Offset of field: XGraphicsExposeEvent::count"]
        [::std::mem::offset_of!(XGraphicsExposeEvent, count) - 56usize];
    ["Offset of field: XGraphicsExposeEvent::major_code"]
        [::std::mem::offset_of!(XGraphicsExposeEvent, major_code) - 60usize];
    ["Offset of field: XGraphicsExposeEvent::minor_code"]
        [::std::mem::offset_of!(XGraphicsExposeEvent, minor_code) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XNoExposeEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub drawable: Drawable,
    pub major_code: ::std::os::raw::c_int,
    pub minor_code: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XNoExposeEvent"][::std::mem::size_of::<XNoExposeEvent>() - 48usize];
    ["Alignment of XNoExposeEvent"][::std::mem::align_of::<XNoExposeEvent>() - 8usize];
    ["Offset of field: XNoExposeEvent::type_"]
        [::std::mem::offset_of!(XNoExposeEvent, type_) - 0usize];
    ["Offset of field: XNoExposeEvent::serial"]
        [::std::mem::offset_of!(XNoExposeEvent, serial) - 8usize];
    ["Offset of field: XNoExposeEvent::send_event"]
        [::std::mem::offset_of!(XNoExposeEvent, send_event) - 16usize];
    ["Offset of field: XNoExposeEvent::display"]
        [::std::mem::offset_of!(XNoExposeEvent, display) - 24usize];
    ["Offset of field: XNoExposeEvent::drawable"]
        [::std::mem::offset_of!(XNoExposeEvent, drawable) - 32usize];
    ["Offset of field: XNoExposeEvent::major_code"]
        [::std::mem::offset_of!(XNoExposeEvent, major_code) - 40usize];
    ["Offset of field: XNoExposeEvent::minor_code"]
        [::std::mem::offset_of!(XNoExposeEvent, minor_code) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XVisibilityEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub window: Window,
    pub state: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XVisibilityEvent"][::std::mem::size_of::<XVisibilityEvent>() - 48usize];
    ["Alignment of XVisibilityEvent"][::std::mem::align_of::<XVisibilityEvent>() - 8usize];
    ["Offset of field: XVisibilityEvent::type_"]
        [::std::mem::offset_of!(XVisibilityEvent, type_) - 0usize];
    ["Offset of field: XVisibilityEvent::serial"]
        [::std::mem::offset_of!(XVisibilityEvent, serial) - 8usize];
    ["Offset of field: XVisibilityEvent::send_event"]
        [::std::mem::offset_of!(XVisibilityEvent, send_event) - 16usize];
    ["Offset of field: XVisibilityEvent::display"]
        [::std::mem::offset_of!(XVisibilityEvent, display) - 24usize];
    ["Offset of field: XVisibilityEvent::window"]
        [::std::mem::offset_of!(XVisibilityEvent, window) - 32usize];
    ["Offset of field: XVisibilityEvent::state"]
        [::std::mem::offset_of!(XVisibilityEvent, state) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XCreateWindowEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub parent: Window,
    pub window: Window,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub border_width: ::std::os::raw::c_int,
    pub override_redirect: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XCreateWindowEvent"][::std::mem::size_of::<XCreateWindowEvent>() - 72usize];
    ["Alignment of XCreateWindowEvent"][::std::mem::align_of::<XCreateWindowEvent>() - 8usize];
    ["Offset of field: XCreateWindowEvent::type_"]
        [::std::mem::offset_of!(XCreateWindowEvent, type_) - 0usize];
    ["Offset of field: XCreateWindowEvent::serial"]
        [::std::mem::offset_of!(XCreateWindowEvent, serial) - 8usize];
    ["Offset of field: XCreateWindowEvent::send_event"]
        [::std::mem::offset_of!(XCreateWindowEvent, send_event) - 16usize];
    ["Offset of field: XCreateWindowEvent::display"]
        [::std::mem::offset_of!(XCreateWindowEvent, display) - 24usize];
    ["Offset of field: XCreateWindowEvent::parent"]
        [::std::mem::offset_of!(XCreateWindowEvent, parent) - 32usize];
    ["Offset of field: XCreateWindowEvent::window"]
        [::std::mem::offset_of!(XCreateWindowEvent, window) - 40usize];
    ["Offset of field: XCreateWindowEvent::x"]
        [::std::mem::offset_of!(XCreateWindowEvent, x) - 48usize];
    ["Offset of field: XCreateWindowEvent::y"]
        [::std::mem::offset_of!(XCreateWindowEvent, y) - 52usize];
    ["Offset of field: XCreateWindowEvent::width"]
        [::std::mem::offset_of!(XCreateWindowEvent, width) - 56usize];
    ["Offset of field: XCreateWindowEvent::height"]
        [::std::mem::offset_of!(XCreateWindowEvent, height) - 60usize];
    ["Offset of field: XCreateWindowEvent::border_width"]
        [::std::mem::offset_of!(XCreateWindowEvent, border_width) - 64usize];
    ["Offset of field: XCreateWindowEvent::override_redirect"]
        [::std::mem::offset_of!(XCreateWindowEvent, override_redirect) - 68usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XDestroyWindowEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub event: Window,
    pub window: Window,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XDestroyWindowEvent"][::std::mem::size_of::<XDestroyWindowEvent>() - 48usize];
    ["Alignment of XDestroyWindowEvent"][::std::mem::align_of::<XDestroyWindowEvent>() - 8usize];
    ["Offset of field: XDestroyWindowEvent::type_"]
        [::std::mem::offset_of!(XDestroyWindowEvent, type_) - 0usize];
    ["Offset of field: XDestroyWindowEvent::serial"]
        [::std::mem::offset_of!(XDestroyWindowEvent, serial) - 8usize];
    ["Offset of field: XDestroyWindowEvent::send_event"]
        [::std::mem::offset_of!(XDestroyWindowEvent, send_event) - 16usize];
    ["Offset of field: XDestroyWindowEvent::display"]
        [::std::mem::offset_of!(XDestroyWindowEvent, display) - 24usize];
    ["Offset of field: XDestroyWindowEvent::event"]
        [::std::mem::offset_of!(XDestroyWindowEvent, event) - 32usize];
    ["Offset of field: XDestroyWindowEvent::window"]
        [::std::mem::offset_of!(XDestroyWindowEvent, window) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XUnmapEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub event: Window,
    pub window: Window,
    pub from_configure: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XUnmapEvent"][::std::mem::size_of::<XUnmapEvent>() - 56usize];
    ["Alignment of XUnmapEvent"][::std::mem::align_of::<XUnmapEvent>() - 8usize];
    ["Offset of field: XUnmapEvent::type_"][::std::mem::offset_of!(XUnmapEvent, type_) - 0usize];
    ["Offset of field: XUnmapEvent::serial"][::std::mem::offset_of!(XUnmapEvent, serial) - 8usize];
    ["Offset of field: XUnmapEvent::send_event"]
        [::std::mem::offset_of!(XUnmapEvent, send_event) - 16usize];
    ["Offset of field: XUnmapEvent::display"]
        [::std::mem::offset_of!(XUnmapEvent, display) - 24usize];
    ["Offset of field: XUnmapEvent::event"][::std::mem::offset_of!(XUnmapEvent, event) - 32usize];
    ["Offset of field: XUnmapEvent::window"][::std::mem::offset_of!(XUnmapEvent, window) - 40usize];
    ["Offset of field: XUnmapEvent::from_configure"]
        [::std::mem::offset_of!(XUnmapEvent, from_configure) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XMapEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub event: Window,
    pub window: Window,
    pub override_redirect: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XMapEvent"][::std::mem::size_of::<XMapEvent>() - 56usize];
    ["Alignment of XMapEvent"][::std::mem::align_of::<XMapEvent>() - 8usize];
    ["Offset of field: XMapEvent::type_"][::std::mem::offset_of!(XMapEvent, type_) - 0usize];
    ["Offset of field: XMapEvent::serial"][::std::mem::offset_of!(XMapEvent, serial) - 8usize];
    ["Offset of field: XMapEvent::send_event"]
        [::std::mem::offset_of!(XMapEvent, send_event) - 16usize];
    ["Offset of field: XMapEvent::display"][::std::mem::offset_of!(XMapEvent, display) - 24usize];
    ["Offset of field: XMapEvent::event"][::std::mem::offset_of!(XMapEvent, event) - 32usize];
    ["Offset of field: XMapEvent::window"][::std::mem::offset_of!(XMapEvent, window) - 40usize];
    ["Offset of field: XMapEvent::override_redirect"]
        [::std::mem::offset_of!(XMapEvent, override_redirect) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XMapRequestEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub parent: Window,
    pub window: Window,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XMapRequestEvent"][::std::mem::size_of::<XMapRequestEvent>() - 48usize];
    ["Alignment of XMapRequestEvent"][::std::mem::align_of::<XMapRequestEvent>() - 8usize];
    ["Offset of field: XMapRequestEvent::type_"]
        [::std::mem::offset_of!(XMapRequestEvent, type_) - 0usize];
    ["Offset of field: XMapRequestEvent::serial"]
        [::std::mem::offset_of!(XMapRequestEvent, serial) - 8usize];
    ["Offset of field: XMapRequestEvent::send_event"]
        [::std::mem::offset_of!(XMapRequestEvent, send_event) - 16usize];
    ["Offset of field: XMapRequestEvent::display"]
        [::std::mem::offset_of!(XMapRequestEvent, display) - 24usize];
    ["Offset of field: XMapRequestEvent::parent"]
        [::std::mem::offset_of!(XMapRequestEvent, parent) - 32usize];
    ["Offset of field: XMapRequestEvent::window"]
        [::std::mem::offset_of!(XMapRequestEvent, window) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XReparentEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub event: Window,
    pub window: Window,
    pub parent: Window,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub override_redirect: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XReparentEvent"][::std::mem::size_of::<XReparentEvent>() - 72usize];
    ["Alignment of XReparentEvent"][::std::mem::align_of::<XReparentEvent>() - 8usize];
    ["Offset of field: XReparentEvent::type_"]
        [::std::mem::offset_of!(XReparentEvent, type_) - 0usize];
    ["Offset of field: XReparentEvent::serial"]
        [::std::mem::offset_of!(XReparentEvent, serial) - 8usize];
    ["Offset of field: XReparentEvent::send_event"]
        [::std::mem::offset_of!(XReparentEvent, send_event) - 16usize];
    ["Offset of field: XReparentEvent::display"]
        [::std::mem::offset_of!(XReparentEvent, display) - 24usize];
    ["Offset of field: XReparentEvent::event"]
        [::std::mem::offset_of!(XReparentEvent, event) - 32usize];
    ["Offset of field: XReparentEvent::window"]
        [::std::mem::offset_of!(XReparentEvent, window) - 40usize];
    ["Offset of field: XReparentEvent::parent"]
        [::std::mem::offset_of!(XReparentEvent, parent) - 48usize];
    ["Offset of field: XReparentEvent::x"][::std::mem::offset_of!(XReparentEvent, x) - 56usize];
    ["Offset of field: XReparentEvent::y"][::std::mem::offset_of!(XReparentEvent, y) - 60usize];
    ["Offset of field: XReparentEvent::override_redirect"]
        [::std::mem::offset_of!(XReparentEvent, override_redirect) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XConfigureEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub event: Window,
    pub window: Window,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub border_width: ::std::os::raw::c_int,
    pub above: Window,
    pub override_redirect: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XConfigureEvent"][::std::mem::size_of::<XConfigureEvent>() - 88usize];
    ["Alignment of XConfigureEvent"][::std::mem::align_of::<XConfigureEvent>() - 8usize];
    ["Offset of field: XConfigureEvent::type_"]
        [::std::mem::offset_of!(XConfigureEvent, type_) - 0usize];
    ["Offset of field: XConfigureEvent::serial"]
        [::std::mem::offset_of!(XConfigureEvent, serial) - 8usize];
    ["Offset of field: XConfigureEvent::send_event"]
        [::std::mem::offset_of!(XConfigureEvent, send_event) - 16usize];
    ["Offset of field: XConfigureEvent::display"]
        [::std::mem::offset_of!(XConfigureEvent, display) - 24usize];
    ["Offset of field: XConfigureEvent::event"]
        [::std::mem::offset_of!(XConfigureEvent, event) - 32usize];
    ["Offset of field: XConfigureEvent::window"]
        [::std::mem::offset_of!(XConfigureEvent, window) - 40usize];
    ["Offset of field: XConfigureEvent::x"][::std::mem::offset_of!(XConfigureEvent, x) - 48usize];
    ["Offset of field: XConfigureEvent::y"][::std::mem::offset_of!(XConfigureEvent, y) - 52usize];
    ["Offset of field: XConfigureEvent::width"]
        [::std::mem::offset_of!(XConfigureEvent, width) - 56usize];
    ["Offset of field: XConfigureEvent::height"]
        [::std::mem::offset_of!(XConfigureEvent, height) - 60usize];
    ["Offset of field: XConfigureEvent::border_width"]
        [::std::mem::offset_of!(XConfigureEvent, border_width) - 64usize];
    ["Offset of field: XConfigureEvent::above"]
        [::std::mem::offset_of!(XConfigureEvent, above) - 72usize];
    ["Offset of field: XConfigureEvent::override_redirect"]
        [::std::mem::offset_of!(XConfigureEvent, override_redirect) - 80usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XGravityEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub event: Window,
    pub window: Window,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XGravityEvent"][::std::mem::size_of::<XGravityEvent>() - 56usize];
    ["Alignment of XGravityEvent"][::std::mem::align_of::<XGravityEvent>() - 8usize];
    ["Offset of field: XGravityEvent::type_"]
        [::std::mem::offset_of!(XGravityEvent, type_) - 0usize];
    ["Offset of field: XGravityEvent::serial"]
        [::std::mem::offset_of!(XGravityEvent, serial) - 8usize];
    ["Offset of field: XGravityEvent::send_event"]
        [::std::mem::offset_of!(XGravityEvent, send_event) - 16usize];
    ["Offset of field: XGravityEvent::display"]
        [::std::mem::offset_of!(XGravityEvent, display) - 24usize];
    ["Offset of field: XGravityEvent::event"]
        [::std::mem::offset_of!(XGravityEvent, event) - 32usize];
    ["Offset of field: XGravityEvent::window"]
        [::std::mem::offset_of!(XGravityEvent, window) - 40usize];
    ["Offset of field: XGravityEvent::x"][::std::mem::offset_of!(XGravityEvent, x) - 48usize];
    ["Offset of field: XGravityEvent::y"][::std::mem::offset_of!(XGravityEvent, y) - 52usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XResizeRequestEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub window: Window,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XResizeRequestEvent"][::std::mem::size_of::<XResizeRequestEvent>() - 48usize];
    ["Alignment of XResizeRequestEvent"][::std::mem::align_of::<XResizeRequestEvent>() - 8usize];
    ["Offset of field: XResizeRequestEvent::type_"]
        [::std::mem::offset_of!(XResizeRequestEvent, type_) - 0usize];
    ["Offset of field: XResizeRequestEvent::serial"]
        [::std::mem::offset_of!(XResizeRequestEvent, serial) - 8usize];
    ["Offset of field: XResizeRequestEvent::send_event"]
        [::std::mem::offset_of!(XResizeRequestEvent, send_event) - 16usize];
    ["Offset of field: XResizeRequestEvent::display"]
        [::std::mem::offset_of!(XResizeRequestEvent, display) - 24usize];
    ["Offset of field: XResizeRequestEvent::window"]
        [::std::mem::offset_of!(XResizeRequestEvent, window) - 32usize];
    ["Offset of field: XResizeRequestEvent::width"]
        [::std::mem::offset_of!(XResizeRequestEvent, width) - 40usize];
    ["Offset of field: XResizeRequestEvent::height"]
        [::std::mem::offset_of!(XResizeRequestEvent, height) - 44usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XConfigureRequestEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub parent: Window,
    pub window: Window,
    pub x: ::std::os::raw::c_int,
    pub y: ::std::os::raw::c_int,
    pub width: ::std::os::raw::c_int,
    pub height: ::std::os::raw::c_int,
    pub border_width: ::std::os::raw::c_int,
    pub above: Window,
    pub detail: ::std::os::raw::c_int,
    pub value_mask: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XConfigureRequestEvent"][::std::mem::size_of::<XConfigureRequestEvent>() - 96usize];
    ["Alignment of XConfigureRequestEvent"]
        [::std::mem::align_of::<XConfigureRequestEvent>() - 8usize];
    ["Offset of field: XConfigureRequestEvent::type_"]
        [::std::mem::offset_of!(XConfigureRequestEvent, type_) - 0usize];
    ["Offset of field: XConfigureRequestEvent::serial"]
        [::std::mem::offset_of!(XConfigureRequestEvent, serial) - 8usize];
    ["Offset of field: XConfigureRequestEvent::send_event"]
        [::std::mem::offset_of!(XConfigureRequestEvent, send_event) - 16usize];
    ["Offset of field: XConfigureRequestEvent::display"]
        [::std::mem::offset_of!(XConfigureRequestEvent, display) - 24usize];
    ["Offset of field: XConfigureRequestEvent::parent"]
        [::std::mem::offset_of!(XConfigureRequestEvent, parent) - 32usize];
    ["Offset of field: XConfigureRequestEvent::window"]
        [::std::mem::offset_of!(XConfigureRequestEvent, window) - 40usize];
    ["Offset of field: XConfigureRequestEvent::x"]
        [::std::mem::offset_of!(XConfigureRequestEvent, x) - 48usize];
    ["Offset of field: XConfigureRequestEvent::y"]
        [::std::mem::offset_of!(XConfigureRequestEvent, y) - 52usize];
    ["Offset of field: XConfigureRequestEvent::width"]
        [::std::mem::offset_of!(XConfigureRequestEvent, width) - 56usize];
    ["Offset of field: XConfigureRequestEvent::height"]
        [::std::mem::offset_of!(XConfigureRequestEvent, height) - 60usize];
    ["Offset of field: XConfigureRequestEvent::border_width"]
        [::std::mem::offset_of!(XConfigureRequestEvent, border_width) - 64usize];
    ["Offset of field: XConfigureRequestEvent::above"]
        [::std::mem::offset_of!(XConfigureRequestEvent, above) - 72usize];
    ["Offset of field: XConfigureRequestEvent::detail"]
        [::std::mem::offset_of!(XConfigureRequestEvent, detail) - 80usize];
    ["Offset of field: XConfigureRequestEvent::value_mask"]
        [::std::mem::offset_of!(XConfigureRequestEvent, value_mask) - 88usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XCirculateEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub event: Window,
    pub window: Window,
    pub place: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XCirculateEvent"][::std::mem::size_of::<XCirculateEvent>() - 56usize];
    ["Alignment of XCirculateEvent"][::std::mem::align_of::<XCirculateEvent>() - 8usize];
    ["Offset of field: XCirculateEvent::type_"]
        [::std::mem::offset_of!(XCirculateEvent, type_) - 0usize];
    ["Offset of field: XCirculateEvent::serial"]
        [::std::mem::offset_of!(XCirculateEvent, serial) - 8usize];
    ["Offset of field: XCirculateEvent::send_event"]
        [::std::mem::offset_of!(XCirculateEvent, send_event) - 16usize];
    ["Offset of field: XCirculateEvent::display"]
        [::std::mem::offset_of!(XCirculateEvent, display) - 24usize];
    ["Offset of field: XCirculateEvent::event"]
        [::std::mem::offset_of!(XCirculateEvent, event) - 32usize];
    ["Offset of field: XCirculateEvent::window"]
        [::std::mem::offset_of!(XCirculateEvent, window) - 40usize];
    ["Offset of field: XCirculateEvent::place"]
        [::std::mem::offset_of!(XCirculateEvent, place) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XCirculateRequestEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub parent: Window,
    pub window: Window,
    pub place: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XCirculateRequestEvent"][::std::mem::size_of::<XCirculateRequestEvent>() - 56usize];
    ["Alignment of XCirculateRequestEvent"]
        [::std::mem::align_of::<XCirculateRequestEvent>() - 8usize];
    ["Offset of field: XCirculateRequestEvent::type_"]
        [::std::mem::offset_of!(XCirculateRequestEvent, type_) - 0usize];
    ["Offset of field: XCirculateRequestEvent::serial"]
        [::std::mem::offset_of!(XCirculateRequestEvent, serial) - 8usize];
    ["Offset of field: XCirculateRequestEvent::send_event"]
        [::std::mem::offset_of!(XCirculateRequestEvent, send_event) - 16usize];
    ["Offset of field: XCirculateRequestEvent::display"]
        [::std::mem::offset_of!(XCirculateRequestEvent, display) - 24usize];
    ["Offset of field: XCirculateRequestEvent::parent"]
        [::std::mem::offset_of!(XCirculateRequestEvent, parent) - 32usize];
    ["Offset of field: XCirculateRequestEvent::window"]
        [::std::mem::offset_of!(XCirculateRequestEvent, window) - 40usize];
    ["Offset of field: XCirculateRequestEvent::place"]
        [::std::mem::offset_of!(XCirculateRequestEvent, place) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XPropertyEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub window: Window,
    pub atom: Atom,
    pub time: Time,
    pub state: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XPropertyEvent"][::std::mem::size_of::<XPropertyEvent>() - 64usize];
    ["Alignment of XPropertyEvent"][::std::mem::align_of::<XPropertyEvent>() - 8usize];
    ["Offset of field: XPropertyEvent::type_"]
        [::std::mem::offset_of!(XPropertyEvent, type_) - 0usize];
    ["Offset of field: XPropertyEvent::serial"]
        [::std::mem::offset_of!(XPropertyEvent, serial) - 8usize];
    ["Offset of field: XPropertyEvent::send_event"]
        [::std::mem::offset_of!(XPropertyEvent, send_event) - 16usize];
    ["Offset of field: XPropertyEvent::display"]
        [::std::mem::offset_of!(XPropertyEvent, display) - 24usize];
    ["Offset of field: XPropertyEvent::window"]
        [::std::mem::offset_of!(XPropertyEvent, window) - 32usize];
    ["Offset of field: XPropertyEvent::atom"]
        [::std::mem::offset_of!(XPropertyEvent, atom) - 40usize];
    ["Offset of field: XPropertyEvent::time"]
        [::std::mem::offset_of!(XPropertyEvent, time) - 48usize];
    ["Offset of field: XPropertyEvent::state"]
        [::std::mem::offset_of!(XPropertyEvent, state) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XSelectionClearEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub window: Window,
    pub selection: Atom,
    pub time: Time,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XSelectionClearEvent"][::std::mem::size_of::<XSelectionClearEvent>() - 56usize];
    ["Alignment of XSelectionClearEvent"][::std::mem::align_of::<XSelectionClearEvent>() - 8usize];
    ["Offset of field: XSelectionClearEvent::type_"]
        [::std::mem::offset_of!(XSelectionClearEvent, type_) - 0usize];
    ["Offset of field: XSelectionClearEvent::serial"]
        [::std::mem::offset_of!(XSelectionClearEvent, serial) - 8usize];
    ["Offset of field: XSelectionClearEvent::send_event"]
        [::std::mem::offset_of!(XSelectionClearEvent, send_event) - 16usize];
    ["Offset of field: XSelectionClearEvent::display"]
        [::std::mem::offset_of!(XSelectionClearEvent, display) - 24usize];
    ["Offset of field: XSelectionClearEvent::window"]
        [::std::mem::offset_of!(XSelectionClearEvent, window) - 32usize];
    ["Offset of field: XSelectionClearEvent::selection"]
        [::std::mem::offset_of!(XSelectionClearEvent, selection) - 40usize];
    ["Offset of field: XSelectionClearEvent::time"]
        [::std::mem::offset_of!(XSelectionClearEvent, time) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XSelectionRequestEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub owner: Window,
    pub requestor: Window,
    pub selection: Atom,
    pub target: Atom,
    pub property: Atom,
    pub time: Time,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XSelectionRequestEvent"][::std::mem::size_of::<XSelectionRequestEvent>() - 80usize];
    ["Alignment of XSelectionRequestEvent"]
        [::std::mem::align_of::<XSelectionRequestEvent>() - 8usize];
    ["Offset of field: XSelectionRequestEvent::type_"]
        [::std::mem::offset_of!(XSelectionRequestEvent, type_) - 0usize];
    ["Offset of field: XSelectionRequestEvent::serial"]
        [::std::mem::offset_of!(XSelectionRequestEvent, serial) - 8usize];
    ["Offset of field: XSelectionRequestEvent::send_event"]
        [::std::mem::offset_of!(XSelectionRequestEvent, send_event) - 16usize];
    ["Offset of field: XSelectionRequestEvent::display"]
        [::std::mem::offset_of!(XSelectionRequestEvent, display) - 24usize];
    ["Offset of field: XSelectionRequestEvent::owner"]
        [::std::mem::offset_of!(XSelectionRequestEvent, owner) - 32usize];
    ["Offset of field: XSelectionRequestEvent::requestor"]
        [::std::mem::offset_of!(XSelectionRequestEvent, requestor) - 40usize];
    ["Offset of field: XSelectionRequestEvent::selection"]
        [::std::mem::offset_of!(XSelectionRequestEvent, selection) - 48usize];
    ["Offset of field: XSelectionRequestEvent::target"]
        [::std::mem::offset_of!(XSelectionRequestEvent, target) - 56usize];
    ["Offset of field: XSelectionRequestEvent::property"]
        [::std::mem::offset_of!(XSelectionRequestEvent, property) - 64usize];
    ["Offset of field: XSelectionRequestEvent::time"]
        [::std::mem::offset_of!(XSelectionRequestEvent, time) - 72usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XSelectionEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub requestor: Window,
    pub selection: Atom,
    pub target: Atom,
    pub property: Atom,
    pub time: Time,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XSelectionEvent"][::std::mem::size_of::<XSelectionEvent>() - 72usize];
    ["Alignment of XSelectionEvent"][::std::mem::align_of::<XSelectionEvent>() - 8usize];
    ["Offset of field: XSelectionEvent::type_"]
        [::std::mem::offset_of!(XSelectionEvent, type_) - 0usize];
    ["Offset of field: XSelectionEvent::serial"]
        [::std::mem::offset_of!(XSelectionEvent, serial) - 8usize];
    ["Offset of field: XSelectionEvent::send_event"]
        [::std::mem::offset_of!(XSelectionEvent, send_event) - 16usize];
    ["Offset of field: XSelectionEvent::display"]
        [::std::mem::offset_of!(XSelectionEvent, display) - 24usize];
    ["Offset of field: XSelectionEvent::requestor"]
        [::std::mem::offset_of!(XSelectionEvent, requestor) - 32usize];
    ["Offset of field: XSelectionEvent::selection"]
        [::std::mem::offset_of!(XSelectionEvent, selection) - 40usize];
    ["Offset of field: XSelectionEvent::target"]
        [::std::mem::offset_of!(XSelectionEvent, target) - 48usize];
    ["Offset of field: XSelectionEvent::property"]
        [::std::mem::offset_of!(XSelectionEvent, property) - 56usize];
    ["Offset of field: XSelectionEvent::time"]
        [::std::mem::offset_of!(XSelectionEvent, time) - 64usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XColormapEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub window: Window,
    pub colormap: Colormap,
    pub new: ::std::os::raw::c_int,
    pub state: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XColormapEvent"][::std::mem::size_of::<XColormapEvent>() - 56usize];
    ["Alignment of XColormapEvent"][::std::mem::align_of::<XColormapEvent>() - 8usize];
    ["Offset of field: XColormapEvent::type_"]
        [::std::mem::offset_of!(XColormapEvent, type_) - 0usize];
    ["Offset of field: XColormapEvent::serial"]
        [::std::mem::offset_of!(XColormapEvent, serial) - 8usize];
    ["Offset of field: XColormapEvent::send_event"]
        [::std::mem::offset_of!(XColormapEvent, send_event) - 16usize];
    ["Offset of field: XColormapEvent::display"]
        [::std::mem::offset_of!(XColormapEvent, display) - 24usize];
    ["Offset of field: XColormapEvent::window"]
        [::std::mem::offset_of!(XColormapEvent, window) - 32usize];
    ["Offset of field: XColormapEvent::colormap"]
        [::std::mem::offset_of!(XColormapEvent, colormap) - 40usize];
    ["Offset of field: XColormapEvent::new"][::std::mem::offset_of!(XColormapEvent, new) - 48usize];
    ["Offset of field: XColormapEvent::state"]
        [::std::mem::offset_of!(XColormapEvent, state) - 52usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct XClientMessageEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub window: Window,
    pub message_type: Atom,
    pub format: ::std::os::raw::c_int,
    pub data: XClientMessageEvent__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union XClientMessageEvent__bindgen_ty_1 {
    pub b: [::std::os::raw::c_char; 20usize],
    pub s: [::std::os::raw::c_short; 10usize],
    pub l: [::std::os::raw::c_long; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XClientMessageEvent__bindgen_ty_1"]
        [::std::mem::size_of::<XClientMessageEvent__bindgen_ty_1>() - 40usize];
    ["Alignment of XClientMessageEvent__bindgen_ty_1"]
        [::std::mem::align_of::<XClientMessageEvent__bindgen_ty_1>() - 8usize];
    ["Offset of field: XClientMessageEvent__bindgen_ty_1::b"]
        [::std::mem::offset_of!(XClientMessageEvent__bindgen_ty_1, b) - 0usize];
    ["Offset of field: XClientMessageEvent__bindgen_ty_1::s"]
        [::std::mem::offset_of!(XClientMessageEvent__bindgen_ty_1, s) - 0usize];
    ["Offset of field: XClientMessageEvent__bindgen_ty_1::l"]
        [::std::mem::offset_of!(XClientMessageEvent__bindgen_ty_1, l) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XClientMessageEvent"][::std::mem::size_of::<XClientMessageEvent>() - 96usize];
    ["Alignment of XClientMessageEvent"][::std::mem::align_of::<XClientMessageEvent>() - 8usize];
    ["Offset of field: XClientMessageEvent::type_"]
        [::std::mem::offset_of!(XClientMessageEvent, type_) - 0usize];
    ["Offset of field: XClientMessageEvent::serial"]
        [::std::mem::offset_of!(XClientMessageEvent, serial) - 8usize];
    ["Offset of field: XClientMessageEvent::send_event"]
        [::std::mem::offset_of!(XClientMessageEvent, send_event) - 16usize];
    ["Offset of field: XClientMessageEvent::display"]
        [::std::mem::offset_of!(XClientMessageEvent, display) - 24usize];
    ["Offset of field: XClientMessageEvent::window"]
        [::std::mem::offset_of!(XClientMessageEvent, window) - 32usize];
    ["Offset of field: XClientMessageEvent::message_type"]
        [::std::mem::offset_of!(XClientMessageEvent, message_type) - 40usize];
    ["Offset of field: XClientMessageEvent::format"]
        [::std::mem::offset_of!(XClientMessageEvent, format) - 48usize];
    ["Offset of field: XClientMessageEvent::data"]
        [::std::mem::offset_of!(XClientMessageEvent, data) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XMappingEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub window: Window,
    pub request: ::std::os::raw::c_int,
    pub first_keycode: ::std::os::raw::c_int,
    pub count: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XMappingEvent"][::std::mem::size_of::<XMappingEvent>() - 56usize];
    ["Alignment of XMappingEvent"][::std::mem::align_of::<XMappingEvent>() - 8usize];
    ["Offset of field: XMappingEvent::type_"]
        [::std::mem::offset_of!(XMappingEvent, type_) - 0usize];
    ["Offset of field: XMappingEvent::serial"]
        [::std::mem::offset_of!(XMappingEvent, serial) - 8usize];
    ["Offset of field: XMappingEvent::send_event"]
        [::std::mem::offset_of!(XMappingEvent, send_event) - 16usize];
    ["Offset of field: XMappingEvent::display"]
        [::std::mem::offset_of!(XMappingEvent, display) - 24usize];
    ["Offset of field: XMappingEvent::window"]
        [::std::mem::offset_of!(XMappingEvent, window) - 32usize];
    ["Offset of field: XMappingEvent::request"]
        [::std::mem::offset_of!(XMappingEvent, request) - 40usize];
    ["Offset of field: XMappingEvent::first_keycode"]
        [::std::mem::offset_of!(XMappingEvent, first_keycode) - 44usize];
    ["Offset of field: XMappingEvent::count"]
        [::std::mem::offset_of!(XMappingEvent, count) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XErrorEvent {
    pub type_: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub resourceid: XID,
    pub serial: ::std::os::raw::c_ulong,
    pub error_code: ::std::os::raw::c_uchar,
    pub request_code: ::std::os::raw::c_uchar,
    pub minor_code: ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XErrorEvent"][::std::mem::size_of::<XErrorEvent>() - 40usize];
    ["Alignment of XErrorEvent"][::std::mem::align_of::<XErrorEvent>() - 8usize];
    ["Offset of field: XErrorEvent::type_"][::std::mem::offset_of!(XErrorEvent, type_) - 0usize];
    ["Offset of field: XErrorEvent::display"]
        [::std::mem::offset_of!(XErrorEvent, display) - 8usize];
    ["Offset of field: XErrorEvent::resourceid"]
        [::std::mem::offset_of!(XErrorEvent, resourceid) - 16usize];
    ["Offset of field: XErrorEvent::serial"][::std::mem::offset_of!(XErrorEvent, serial) - 24usize];
    ["Offset of field: XErrorEvent::error_code"]
        [::std::mem::offset_of!(XErrorEvent, error_code) - 32usize];
    ["Offset of field: XErrorEvent::request_code"]
        [::std::mem::offset_of!(XErrorEvent, request_code) - 33usize];
    ["Offset of field: XErrorEvent::minor_code"]
        [::std::mem::offset_of!(XErrorEvent, minor_code) - 34usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XAnyEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub window: Window,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XAnyEvent"][::std::mem::size_of::<XAnyEvent>() - 40usize];
    ["Alignment of XAnyEvent"][::std::mem::align_of::<XAnyEvent>() - 8usize];
    ["Offset of field: XAnyEvent::type_"][::std::mem::offset_of!(XAnyEvent, type_) - 0usize];
    ["Offset of field: XAnyEvent::serial"][::std::mem::offset_of!(XAnyEvent, serial) - 8usize];
    ["Offset of field: XAnyEvent::send_event"]
        [::std::mem::offset_of!(XAnyEvent, send_event) - 16usize];
    ["Offset of field: XAnyEvent::display"][::std::mem::offset_of!(XAnyEvent, display) - 24usize];
    ["Offset of field: XAnyEvent::window"][::std::mem::offset_of!(XAnyEvent, window) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XGenericEvent {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub extension: ::std::os::raw::c_int,
    pub evtype: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XGenericEvent"][::std::mem::size_of::<XGenericEvent>() - 40usize];
    ["Alignment of XGenericEvent"][::std::mem::align_of::<XGenericEvent>() - 8usize];
    ["Offset of field: XGenericEvent::type_"]
        [::std::mem::offset_of!(XGenericEvent, type_) - 0usize];
    ["Offset of field: XGenericEvent::serial"]
        [::std::mem::offset_of!(XGenericEvent, serial) - 8usize];
    ["Offset of field: XGenericEvent::send_event"]
        [::std::mem::offset_of!(XGenericEvent, send_event) - 16usize];
    ["Offset of field: XGenericEvent::display"]
        [::std::mem::offset_of!(XGenericEvent, display) - 24usize];
    ["Offset of field: XGenericEvent::extension"]
        [::std::mem::offset_of!(XGenericEvent, extension) - 32usize];
    ["Offset of field: XGenericEvent::evtype"]
        [::std::mem::offset_of!(XGenericEvent, evtype) - 36usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XGenericEventCookie {
    pub type_: ::std::os::raw::c_int,
    pub serial: ::std::os::raw::c_ulong,
    pub send_event: ::std::os::raw::c_int,
    pub display: *mut Display,
    pub extension: ::std::os::raw::c_int,
    pub evtype: ::std::os::raw::c_int,
    pub cookie: ::std::os::raw::c_uint,
    pub data: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XGenericEventCookie"][::std::mem::size_of::<XGenericEventCookie>() - 56usize];
    ["Alignment of XGenericEventCookie"][::std::mem::align_of::<XGenericEventCookie>() - 8usize];
    ["Offset of field: XGenericEventCookie::type_"]
        [::std::mem::offset_of!(XGenericEventCookie, type_) - 0usize];
    ["Offset of field: XGenericEventCookie::serial"]
        [::std::mem::offset_of!(XGenericEventCookie, serial) - 8usize];
    ["Offset of field: XGenericEventCookie::send_event"]
        [::std::mem::offset_of!(XGenericEventCookie, send_event) - 16usize];
    ["Offset of field: XGenericEventCookie::display"]
        [::std::mem::offset_of!(XGenericEventCookie, display) - 24usize];
    ["Offset of field: XGenericEventCookie::extension"]
        [::std::mem::offset_of!(XGenericEventCookie, extension) - 32usize];
    ["Offset of field: XGenericEventCookie::evtype"]
        [::std::mem::offset_of!(XGenericEventCookie, evtype) - 36usize];
    ["Offset of field: XGenericEventCookie::cookie"]
        [::std::mem::offset_of!(XGenericEventCookie, cookie) - 40usize];
    ["Offset of field: XGenericEventCookie::data"]
        [::std::mem::offset_of!(XGenericEventCookie, data) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union _XEvent {
    pub type_: ::std::os::raw::c_int,
    pub xany: XAnyEvent,
    pub xkey: XKeyEvent,
    pub xbutton: XButtonEvent,
    pub xmotion: XMotionEvent,
    pub xcrossing: XCrossingEvent,
    pub xfocus: XFocusChangeEvent,
    pub xexpose: XExposeEvent,
    pub xgraphicsexpose: XGraphicsExposeEvent,
    pub xnoexpose: XNoExposeEvent,
    pub xvisibility: XVisibilityEvent,
    pub xcreatewindow: XCreateWindowEvent,
    pub xdestroywindow: XDestroyWindowEvent,
    pub xunmap: XUnmapEvent,
    pub xmap: XMapEvent,
    pub xmaprequest: XMapRequestEvent,
    pub xreparent: XReparentEvent,
    pub xconfigure: XConfigureEvent,
    pub xgravity: XGravityEvent,
    pub xresizerequest: XResizeRequestEvent,
    pub xconfigurerequest: XConfigureRequestEvent,
    pub xcirculate: XCirculateEvent,
    pub xcirculaterequest: XCirculateRequestEvent,
    pub xproperty: XPropertyEvent,
    pub xselectionclear: XSelectionClearEvent,
    pub xselectionrequest: XSelectionRequestEvent,
    pub xselection: XSelectionEvent,
    pub xcolormap: XColormapEvent,
    pub xclient: XClientMessageEvent,
    pub xmapping: XMappingEvent,
    pub xerror: XErrorEvent,
    pub xkeymap: XKeymapEvent,
    pub xgeneric: XGenericEvent,
    pub xcookie: XGenericEventCookie,
    pub pad: [::std::os::raw::c_long; 24usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XEvent"][::std::mem::size_of::<_XEvent>() - 192usize];
    ["Alignment of _XEvent"][::std::mem::align_of::<_XEvent>() - 8usize];
    ["Offset of field: _XEvent::type_"][::std::mem::offset_of!(_XEvent, type_) - 0usize];
    ["Offset of field: _XEvent::xany"][::std::mem::offset_of!(_XEvent, xany) - 0usize];
    ["Offset of field: _XEvent::xkey"][::std::mem::offset_of!(_XEvent, xkey) - 0usize];
    ["Offset of field: _XEvent::xbutton"][::std::mem::offset_of!(_XEvent, xbutton) - 0usize];
    ["Offset of field: _XEvent::xmotion"][::std::mem::offset_of!(_XEvent, xmotion) - 0usize];
    ["Offset of field: _XEvent::xcrossing"][::std::mem::offset_of!(_XEvent, xcrossing) - 0usize];
    ["Offset of field: _XEvent::xfocus"][::std::mem::offset_of!(_XEvent, xfocus) - 0usize];
    ["Offset of field: _XEvent::xexpose"][::std::mem::offset_of!(_XEvent, xexpose) - 0usize];
    ["Offset of field: _XEvent::xgraphicsexpose"]
        [::std::mem::offset_of!(_XEvent, xgraphicsexpose) - 0usize];
    ["Offset of field: _XEvent::xnoexpose"][::std::mem::offset_of!(_XEvent, xnoexpose) - 0usize];
    ["Offset of field: _XEvent::xvisibility"]
        [::std::mem::offset_of!(_XEvent, xvisibility) - 0usize];
    ["Offset of field: _XEvent::xcreatewindow"]
        [::std::mem::offset_of!(_XEvent, xcreatewindow) - 0usize];
    ["Offset of field: _XEvent::xdestroywindow"]
        [::std::mem::offset_of!(_XEvent, xdestroywindow) - 0usize];
    ["Offset of field: _XEvent::xunmap"][::std::mem::offset_of!(_XEvent, xunmap) - 0usize];
    ["Offset of field: _XEvent::xmap"][::std::mem::offset_of!(_XEvent, xmap) - 0usize];
    ["Offset of field: _XEvent::xmaprequest"]
        [::std::mem::offset_of!(_XEvent, xmaprequest) - 0usize];
    ["Offset of field: _XEvent::xreparent"][::std::mem::offset_of!(_XEvent, xreparent) - 0usize];
    ["Offset of field: _XEvent::xconfigure"][::std::mem::offset_of!(_XEvent, xconfigure) - 0usize];
    ["Offset of field: _XEvent::xgravity"][::std::mem::offset_of!(_XEvent, xgravity) - 0usize];
    ["Offset of field: _XEvent::xresizerequest"]
        [::std::mem::offset_of!(_XEvent, xresizerequest) - 0usize];
    ["Offset of field: _XEvent::xconfigurerequest"]
        [::std::mem::offset_of!(_XEvent, xconfigurerequest) - 0usize];
    ["Offset of field: _XEvent::xcirculate"][::std::mem::offset_of!(_XEvent, xcirculate) - 0usize];
    ["Offset of field: _XEvent::xcirculaterequest"]
        [::std::mem::offset_of!(_XEvent, xcirculaterequest) - 0usize];
    ["Offset of field: _XEvent::xproperty"][::std::mem::offset_of!(_XEvent, xproperty) - 0usize];
    ["Offset of field: _XEvent::xselectionclear"]
        [::std::mem::offset_of!(_XEvent, xselectionclear) - 0usize];
    ["Offset of field: _XEvent::xselectionrequest"]
        [::std::mem::offset_of!(_XEvent, xselectionrequest) - 0usize];
    ["Offset of field: _XEvent::xselection"][::std::mem::offset_of!(_XEvent, xselection) - 0usize];
    ["Offset of field: _XEvent::xcolormap"][::std::mem::offset_of!(_XEvent, xcolormap) - 0usize];
    ["Offset of field: _XEvent::xclient"][::std::mem::offset_of!(_XEvent, xclient) - 0usize];
    ["Offset of field: _XEvent::xmapping"][::std::mem::offset_of!(_XEvent, xmapping) - 0usize];
    ["Offset of field: _XEvent::xerror"][::std::mem::offset_of!(_XEvent, xerror) - 0usize];
    ["Offset of field: _XEvent::xkeymap"][::std::mem::offset_of!(_XEvent, xkeymap) - 0usize];
    ["Offset of field: _XEvent::xgeneric"][::std::mem::offset_of!(_XEvent, xgeneric) - 0usize];
    ["Offset of field: _XEvent::xcookie"][::std::mem::offset_of!(_XEvent, xcookie) - 0usize];
    ["Offset of field: _XEvent::pad"][::std::mem::offset_of!(_XEvent, pad) - 0usize];
};
pub type XEvent = _XEvent;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XCharStruct {
    pub lbearing: ::std::os::raw::c_short,
    pub rbearing: ::std::os::raw::c_short,
    pub width: ::std::os::raw::c_short,
    pub ascent: ::std::os::raw::c_short,
    pub descent: ::std::os::raw::c_short,
    pub attributes: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XCharStruct"][::std::mem::size_of::<XCharStruct>() - 12usize];
    ["Alignment of XCharStruct"][::std::mem::align_of::<XCharStruct>() - 2usize];
    ["Offset of field: XCharStruct::lbearing"]
        [::std::mem::offset_of!(XCharStruct, lbearing) - 0usize];
    ["Offset of field: XCharStruct::rbearing"]
        [::std::mem::offset_of!(XCharStruct, rbearing) - 2usize];
    ["Offset of field: XCharStruct::width"][::std::mem::offset_of!(XCharStruct, width) - 4usize];
    ["Offset of field: XCharStruct::ascent"][::std::mem::offset_of!(XCharStruct, ascent) - 6usize];
    ["Offset of field: XCharStruct::descent"]
        [::std::mem::offset_of!(XCharStruct, descent) - 8usize];
    ["Offset of field: XCharStruct::attributes"]
        [::std::mem::offset_of!(XCharStruct, attributes) - 10usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XFontProp {
    pub name: Atom,
    pub card32: ::std::os::raw::c_ulong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XFontProp"][::std::mem::size_of::<XFontProp>() - 16usize];
    ["Alignment of XFontProp"][::std::mem::align_of::<XFontProp>() - 8usize];
    ["Offset of field: XFontProp::name"][::std::mem::offset_of!(XFontProp, name) - 0usize];
    ["Offset of field: XFontProp::card32"][::std::mem::offset_of!(XFontProp, card32) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XFontStruct {
    pub ext_data: *mut XExtData,
    pub fid: Font,
    pub direction: ::std::os::raw::c_uint,
    pub min_char_or_byte2: ::std::os::raw::c_uint,
    pub max_char_or_byte2: ::std::os::raw::c_uint,
    pub min_byte1: ::std::os::raw::c_uint,
    pub max_byte1: ::std::os::raw::c_uint,
    pub all_chars_exist: ::std::os::raw::c_int,
    pub default_char: ::std::os::raw::c_uint,
    pub n_properties: ::std::os::raw::c_int,
    pub properties: *mut XFontProp,
    pub min_bounds: XCharStruct,
    pub max_bounds: XCharStruct,
    pub per_char: *mut XCharStruct,
    pub ascent: ::std::os::raw::c_int,
    pub descent: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XFontStruct"][::std::mem::size_of::<XFontStruct>() - 96usize];
    ["Alignment of XFontStruct"][::std::mem::align_of::<XFontStruct>() - 8usize];
    ["Offset of field: XFontStruct::ext_data"]
        [::std::mem::offset_of!(XFontStruct, ext_data) - 0usize];
    ["Offset of field: XFontStruct::fid"][::std::mem::offset_of!(XFontStruct, fid) - 8usize];
    ["Offset of field: XFontStruct::direction"]
        [::std::mem::offset_of!(XFontStruct, direction) - 16usize];
    ["Offset of field: XFontStruct::min_char_or_byte2"]
        [::std::mem::offset_of!(XFontStruct, min_char_or_byte2) - 20usize];
    ["Offset of field: XFontStruct::max_char_or_byte2"]
        [::std::mem::offset_of!(XFontStruct, max_char_or_byte2) - 24usize];
    ["Offset of field: XFontStruct::min_byte1"]
        [::std::mem::offset_of!(XFontStruct, min_byte1) - 28usize];
    ["Offset of field: XFontStruct::max_byte1"]
        [::std::mem::offset_of!(XFontStruct, max_byte1) - 32usize];
    ["Offset of field: XFontStruct::all_chars_exist"]
        [::std::mem::offset_of!(XFontStruct, all_chars_exist) - 36usize];
    ["Offset of field: XFontStruct::default_char"]
        [::std::mem::offset_of!(XFontStruct, default_char) - 40usize];
    ["Offset of field: XFontStruct::n_properties"]
        [::std::mem::offset_of!(XFontStruct, n_properties) - 44usize];
    ["Offset of field: XFontStruct::properties"]
        [::std::mem::offset_of!(XFontStruct, properties) - 48usize];
    ["Offset of field: XFontStruct::min_bounds"]
        [::std::mem::offset_of!(XFontStruct, min_bounds) - 56usize];
    ["Offset of field: XFontStruct::max_bounds"]
        [::std::mem::offset_of!(XFontStruct, max_bounds) - 68usize];
    ["Offset of field: XFontStruct::per_char"]
        [::std::mem::offset_of!(XFontStruct, per_char) - 80usize];
    ["Offset of field: XFontStruct::ascent"][::std::mem::offset_of!(XFontStruct, ascent) - 88usize];
    ["Offset of field: XFontStruct::descent"]
        [::std::mem::offset_of!(XFontStruct, descent) - 92usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XTextItem {
    pub chars: *mut ::std::os::raw::c_char,
    pub nchars: ::std::os::raw::c_int,
    pub delta: ::std::os::raw::c_int,
    pub font: Font,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XTextItem"][::std::mem::size_of::<XTextItem>() - 24usize];
    ["Alignment of XTextItem"][::std::mem::align_of::<XTextItem>() - 8usize];
    ["Offset of field: XTextItem::chars"][::std::mem::offset_of!(XTextItem, chars) - 0usize];
    ["Offset of field: XTextItem::nchars"][::std::mem::offset_of!(XTextItem, nchars) - 8usize];
    ["Offset of field: XTextItem::delta"][::std::mem::offset_of!(XTextItem, delta) - 12usize];
    ["Offset of field: XTextItem::font"][::std::mem::offset_of!(XTextItem, font) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XChar2b {
    pub byte1: ::std::os::raw::c_uchar,
    pub byte2: ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XChar2b"][::std::mem::size_of::<XChar2b>() - 2usize];
    ["Alignment of XChar2b"][::std::mem::align_of::<XChar2b>() - 1usize];
    ["Offset of field: XChar2b::byte1"][::std::mem::offset_of!(XChar2b, byte1) - 0usize];
    ["Offset of field: XChar2b::byte2"][::std::mem::offset_of!(XChar2b, byte2) - 1usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XTextItem16 {
    pub chars: *mut XChar2b,
    pub nchars: ::std::os::raw::c_int,
    pub delta: ::std::os::raw::c_int,
    pub font: Font,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XTextItem16"][::std::mem::size_of::<XTextItem16>() - 24usize];
    ["Alignment of XTextItem16"][::std::mem::align_of::<XTextItem16>() - 8usize];
    ["Offset of field: XTextItem16::chars"][::std::mem::offset_of!(XTextItem16, chars) - 0usize];
    ["Offset of field: XTextItem16::nchars"][::std::mem::offset_of!(XTextItem16, nchars) - 8usize];
    ["Offset of field: XTextItem16::delta"][::std::mem::offset_of!(XTextItem16, delta) - 12usize];
    ["Offset of field: XTextItem16::font"][::std::mem::offset_of!(XTextItem16, font) - 16usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union XEDataObject {
    pub display: *mut Display,
    pub gc: GC,
    pub visual: *mut Visual,
    pub screen: *mut Screen,
    pub pixmap_format: *mut ScreenFormat,
    pub font: *mut XFontStruct,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XEDataObject"][::std::mem::size_of::<XEDataObject>() - 8usize];
    ["Alignment of XEDataObject"][::std::mem::align_of::<XEDataObject>() - 8usize];
    ["Offset of field: XEDataObject::display"]
        [::std::mem::offset_of!(XEDataObject, display) - 0usize];
    ["Offset of field: XEDataObject::gc"][::std::mem::offset_of!(XEDataObject, gc) - 0usize];
    ["Offset of field: XEDataObject::visual"]
        [::std::mem::offset_of!(XEDataObject, visual) - 0usize];
    ["Offset of field: XEDataObject::screen"]
        [::std::mem::offset_of!(XEDataObject, screen) - 0usize];
    ["Offset of field: XEDataObject::pixmap_format"]
        [::std::mem::offset_of!(XEDataObject, pixmap_format) - 0usize];
    ["Offset of field: XEDataObject::font"][::std::mem::offset_of!(XEDataObject, font) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XFontSetExtents {
    pub max_ink_extent: XRectangle,
    pub max_logical_extent: XRectangle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XFontSetExtents"][::std::mem::size_of::<XFontSetExtents>() - 16usize];
    ["Alignment of XFontSetExtents"][::std::mem::align_of::<XFontSetExtents>() - 2usize];
    ["Offset of field: XFontSetExtents::max_ink_extent"]
        [::std::mem::offset_of!(XFontSetExtents, max_ink_extent) - 0usize];
    ["Offset of field: XFontSetExtents::max_logical_extent"]
        [::std::mem::offset_of!(XFontSetExtents, max_logical_extent) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XOM {
    _unused: [u8; 0],
}
pub type XOM = *mut _XOM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XOC {
    _unused: [u8; 0],
}
pub type XOC = *mut _XOC;
pub type XFontSet = *mut _XOC;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XmbTextItem {
    pub chars: *mut ::std::os::raw::c_char,
    pub nchars: ::std::os::raw::c_int,
    pub delta: ::std::os::raw::c_int,
    pub font_set: XFontSet,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XmbTextItem"][::std::mem::size_of::<XmbTextItem>() - 24usize];
    ["Alignment of XmbTextItem"][::std::mem::align_of::<XmbTextItem>() - 8usize];
    ["Offset of field: XmbTextItem::chars"][::std::mem::offset_of!(XmbTextItem, chars) - 0usize];
    ["Offset of field: XmbTextItem::nchars"][::std::mem::offset_of!(XmbTextItem, nchars) - 8usize];
    ["Offset of field: XmbTextItem::delta"][::std::mem::offset_of!(XmbTextItem, delta) - 12usize];
    ["Offset of field: XmbTextItem::font_set"]
        [::std::mem::offset_of!(XmbTextItem, font_set) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XwcTextItem {
    pub chars: *mut wchar_t,
    pub nchars: ::std::os::raw::c_int,
    pub delta: ::std::os::raw::c_int,
    pub font_set: XFontSet,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XwcTextItem"][::std::mem::size_of::<XwcTextItem>() - 24usize];
    ["Alignment of XwcTextItem"][::std::mem::align_of::<XwcTextItem>() - 8usize];
    ["Offset of field: XwcTextItem::chars"][::std::mem::offset_of!(XwcTextItem, chars) - 0usize];
    ["Offset of field: XwcTextItem::nchars"][::std::mem::offset_of!(XwcTextItem, nchars) - 8usize];
    ["Offset of field: XwcTextItem::delta"][::std::mem::offset_of!(XwcTextItem, delta) - 12usize];
    ["Offset of field: XwcTextItem::font_set"]
        [::std::mem::offset_of!(XwcTextItem, font_set) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XOMCharSetList {
    pub charset_count: ::std::os::raw::c_int,
    pub charset_list: *mut *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XOMCharSetList"][::std::mem::size_of::<XOMCharSetList>() - 16usize];
    ["Alignment of XOMCharSetList"][::std::mem::align_of::<XOMCharSetList>() - 8usize];
    ["Offset of field: XOMCharSetList::charset_count"]
        [::std::mem::offset_of!(XOMCharSetList, charset_count) - 0usize];
    ["Offset of field: XOMCharSetList::charset_list"]
        [::std::mem::offset_of!(XOMCharSetList, charset_list) - 8usize];
};
pub const XOrientation_XOMOrientation_LTR_TTB: XOrientation = 0;
pub const XOrientation_XOMOrientation_RTL_TTB: XOrientation = 1;
pub const XOrientation_XOMOrientation_TTB_LTR: XOrientation = 2;
pub const XOrientation_XOMOrientation_TTB_RTL: XOrientation = 3;
pub const XOrientation_XOMOrientation_Context: XOrientation = 4;
pub type XOrientation = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XOMOrientation {
    pub num_orientation: ::std::os::raw::c_int,
    pub orientation: *mut XOrientation,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XOMOrientation"][::std::mem::size_of::<XOMOrientation>() - 16usize];
    ["Alignment of XOMOrientation"][::std::mem::align_of::<XOMOrientation>() - 8usize];
    ["Offset of field: XOMOrientation::num_orientation"]
        [::std::mem::offset_of!(XOMOrientation, num_orientation) - 0usize];
    ["Offset of field: XOMOrientation::orientation"]
        [::std::mem::offset_of!(XOMOrientation, orientation) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XOMFontInfo {
    pub num_font: ::std::os::raw::c_int,
    pub font_struct_list: *mut *mut XFontStruct,
    pub font_name_list: *mut *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XOMFontInfo"][::std::mem::size_of::<XOMFontInfo>() - 24usize];
    ["Alignment of XOMFontInfo"][::std::mem::align_of::<XOMFontInfo>() - 8usize];
    ["Offset of field: XOMFontInfo::num_font"]
        [::std::mem::offset_of!(XOMFontInfo, num_font) - 0usize];
    ["Offset of field: XOMFontInfo::font_struct_list"]
        [::std::mem::offset_of!(XOMFontInfo, font_struct_list) - 8usize];
    ["Offset of field: XOMFontInfo::font_name_list"]
        [::std::mem::offset_of!(XOMFontInfo, font_name_list) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XIM {
    _unused: [u8; 0],
}
pub type XIM = *mut _XIM;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XIC {
    _unused: [u8; 0],
}
pub type XIC = *mut _XIC;
pub type XIMProc =
    ::std::option::Option<unsafe extern "C" fn(arg1: XIM, arg2: XPointer, arg3: XPointer)>;
pub type XICProc = ::std::option::Option<
    unsafe extern "C" fn(arg1: XIC, arg2: XPointer, arg3: XPointer) -> ::std::os::raw::c_int,
>;
pub type XIDProc =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut Display, arg2: XPointer, arg3: XPointer)>;
pub type XIMStyle = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XIMStyles {
    pub count_styles: ::std::os::raw::c_ushort,
    pub supported_styles: *mut XIMStyle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XIMStyles"][::std::mem::size_of::<XIMStyles>() - 16usize];
    ["Alignment of XIMStyles"][::std::mem::align_of::<XIMStyles>() - 8usize];
    ["Offset of field: XIMStyles::count_styles"]
        [::std::mem::offset_of!(XIMStyles, count_styles) - 0usize];
    ["Offset of field: XIMStyles::supported_styles"]
        [::std::mem::offset_of!(XIMStyles, supported_styles) - 8usize];
};
pub type XVaNestedList = *mut ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XIMCallback {
    pub client_data: XPointer,
    pub callback: XIMProc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XIMCallback"][::std::mem::size_of::<XIMCallback>() - 16usize];
    ["Alignment of XIMCallback"][::std::mem::align_of::<XIMCallback>() - 8usize];
    ["Offset of field: XIMCallback::client_data"]
        [::std::mem::offset_of!(XIMCallback, client_data) - 0usize];
    ["Offset of field: XIMCallback::callback"]
        [::std::mem::offset_of!(XIMCallback, callback) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XICCallback {
    pub client_data: XPointer,
    pub callback: XICProc,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XICCallback"][::std::mem::size_of::<XICCallback>() - 16usize];
    ["Alignment of XICCallback"][::std::mem::align_of::<XICCallback>() - 8usize];
    ["Offset of field: XICCallback::client_data"]
        [::std::mem::offset_of!(XICCallback, client_data) - 0usize];
    ["Offset of field: XICCallback::callback"]
        [::std::mem::offset_of!(XICCallback, callback) - 8usize];
};
pub type XIMFeedback = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _XIMText {
    pub length: ::std::os::raw::c_ushort,
    pub feedback: *mut XIMFeedback,
    pub encoding_is_wchar: ::std::os::raw::c_int,
    pub string: _XIMText__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _XIMText__bindgen_ty_1 {
    pub multi_byte: *mut ::std::os::raw::c_char,
    pub wide_char: *mut wchar_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XIMText__bindgen_ty_1"][::std::mem::size_of::<_XIMText__bindgen_ty_1>() - 8usize];
    ["Alignment of _XIMText__bindgen_ty_1"]
        [::std::mem::align_of::<_XIMText__bindgen_ty_1>() - 8usize];
    ["Offset of field: _XIMText__bindgen_ty_1::multi_byte"]
        [::std::mem::offset_of!(_XIMText__bindgen_ty_1, multi_byte) - 0usize];
    ["Offset of field: _XIMText__bindgen_ty_1::wide_char"]
        [::std::mem::offset_of!(_XIMText__bindgen_ty_1, wide_char) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XIMText"][::std::mem::size_of::<_XIMText>() - 32usize];
    ["Alignment of _XIMText"][::std::mem::align_of::<_XIMText>() - 8usize];
    ["Offset of field: _XIMText::length"][::std::mem::offset_of!(_XIMText, length) - 0usize];
    ["Offset of field: _XIMText::feedback"][::std::mem::offset_of!(_XIMText, feedback) - 8usize];
    ["Offset of field: _XIMText::encoding_is_wchar"]
        [::std::mem::offset_of!(_XIMText, encoding_is_wchar) - 16usize];
    ["Offset of field: _XIMText::string"][::std::mem::offset_of!(_XIMText, string) - 24usize];
};
pub type XIMText = _XIMText;
pub type XIMPreeditState = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XIMPreeditStateNotifyCallbackStruct {
    pub state: XIMPreeditState,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XIMPreeditStateNotifyCallbackStruct"]
        [::std::mem::size_of::<_XIMPreeditStateNotifyCallbackStruct>() - 8usize];
    ["Alignment of _XIMPreeditStateNotifyCallbackStruct"]
        [::std::mem::align_of::<_XIMPreeditStateNotifyCallbackStruct>() - 8usize];
    ["Offset of field: _XIMPreeditStateNotifyCallbackStruct::state"]
        [::std::mem::offset_of!(_XIMPreeditStateNotifyCallbackStruct, state) - 0usize];
};
pub type XIMPreeditStateNotifyCallbackStruct = _XIMPreeditStateNotifyCallbackStruct;
pub type XIMResetState = ::std::os::raw::c_ulong;
pub type XIMStringConversionFeedback = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _XIMStringConversionText {
    pub length: ::std::os::raw::c_ushort,
    pub feedback: *mut XIMStringConversionFeedback,
    pub encoding_is_wchar: ::std::os::raw::c_int,
    pub string: _XIMStringConversionText__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _XIMStringConversionText__bindgen_ty_1 {
    pub mbs: *mut ::std::os::raw::c_char,
    pub wcs: *mut wchar_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XIMStringConversionText__bindgen_ty_1"]
        [::std::mem::size_of::<_XIMStringConversionText__bindgen_ty_1>() - 8usize];
    ["Alignment of _XIMStringConversionText__bindgen_ty_1"]
        [::std::mem::align_of::<_XIMStringConversionText__bindgen_ty_1>() - 8usize];
    ["Offset of field: _XIMStringConversionText__bindgen_ty_1::mbs"]
        [::std::mem::offset_of!(_XIMStringConversionText__bindgen_ty_1, mbs) - 0usize];
    ["Offset of field: _XIMStringConversionText__bindgen_ty_1::wcs"]
        [::std::mem::offset_of!(_XIMStringConversionText__bindgen_ty_1, wcs) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XIMStringConversionText"]
        [::std::mem::size_of::<_XIMStringConversionText>() - 32usize];
    ["Alignment of _XIMStringConversionText"]
        [::std::mem::align_of::<_XIMStringConversionText>() - 8usize];
    ["Offset of field: _XIMStringConversionText::length"]
        [::std::mem::offset_of!(_XIMStringConversionText, length) - 0usize];
    ["Offset of field: _XIMStringConversionText::feedback"]
        [::std::mem::offset_of!(_XIMStringConversionText, feedback) - 8usize];
    ["Offset of field: _XIMStringConversionText::encoding_is_wchar"]
        [::std::mem::offset_of!(_XIMStringConversionText, encoding_is_wchar) - 16usize];
    ["Offset of field: _XIMStringConversionText::string"]
        [::std::mem::offset_of!(_XIMStringConversionText, string) - 24usize];
};
pub type XIMStringConversionText = _XIMStringConversionText;
pub type XIMStringConversionPosition = ::std::os::raw::c_ushort;
pub type XIMStringConversionType = ::std::os::raw::c_ushort;
pub type XIMStringConversionOperation = ::std::os::raw::c_ushort;
pub const XIMCaretDirection_XIMForwardChar: XIMCaretDirection = 0;
pub const XIMCaretDirection_XIMBackwardChar: XIMCaretDirection = 1;
pub const XIMCaretDirection_XIMForwardWord: XIMCaretDirection = 2;
pub const XIMCaretDirection_XIMBackwardWord: XIMCaretDirection = 3;
pub const XIMCaretDirection_XIMCaretUp: XIMCaretDirection = 4;
pub const XIMCaretDirection_XIMCaretDown: XIMCaretDirection = 5;
pub const XIMCaretDirection_XIMNextLine: XIMCaretDirection = 6;
pub const XIMCaretDirection_XIMPreviousLine: XIMCaretDirection = 7;
pub const XIMCaretDirection_XIMLineStart: XIMCaretDirection = 8;
pub const XIMCaretDirection_XIMLineEnd: XIMCaretDirection = 9;
pub const XIMCaretDirection_XIMAbsolutePosition: XIMCaretDirection = 10;
pub const XIMCaretDirection_XIMDontChange: XIMCaretDirection = 11;
pub type XIMCaretDirection = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XIMStringConversionCallbackStruct {
    pub position: XIMStringConversionPosition,
    pub direction: XIMCaretDirection,
    pub operation: XIMStringConversionOperation,
    pub factor: ::std::os::raw::c_ushort,
    pub text: *mut XIMStringConversionText,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XIMStringConversionCallbackStruct"]
        [::std::mem::size_of::<_XIMStringConversionCallbackStruct>() - 24usize];
    ["Alignment of _XIMStringConversionCallbackStruct"]
        [::std::mem::align_of::<_XIMStringConversionCallbackStruct>() - 8usize];
    ["Offset of field: _XIMStringConversionCallbackStruct::position"]
        [::std::mem::offset_of!(_XIMStringConversionCallbackStruct, position) - 0usize];
    ["Offset of field: _XIMStringConversionCallbackStruct::direction"]
        [::std::mem::offset_of!(_XIMStringConversionCallbackStruct, direction) - 4usize];
    ["Offset of field: _XIMStringConversionCallbackStruct::operation"]
        [::std::mem::offset_of!(_XIMStringConversionCallbackStruct, operation) - 8usize];
    ["Offset of field: _XIMStringConversionCallbackStruct::factor"]
        [::std::mem::offset_of!(_XIMStringConversionCallbackStruct, factor) - 10usize];
    ["Offset of field: _XIMStringConversionCallbackStruct::text"]
        [::std::mem::offset_of!(_XIMStringConversionCallbackStruct, text) - 16usize];
};
pub type XIMStringConversionCallbackStruct = _XIMStringConversionCallbackStruct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XIMPreeditDrawCallbackStruct {
    pub caret: ::std::os::raw::c_int,
    pub chg_first: ::std::os::raw::c_int,
    pub chg_length: ::std::os::raw::c_int,
    pub text: *mut XIMText,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XIMPreeditDrawCallbackStruct"]
        [::std::mem::size_of::<_XIMPreeditDrawCallbackStruct>() - 24usize];
    ["Alignment of _XIMPreeditDrawCallbackStruct"]
        [::std::mem::align_of::<_XIMPreeditDrawCallbackStruct>() - 8usize];
    ["Offset of field: _XIMPreeditDrawCallbackStruct::caret"]
        [::std::mem::offset_of!(_XIMPreeditDrawCallbackStruct, caret) - 0usize];
    ["Offset of field: _XIMPreeditDrawCallbackStruct::chg_first"]
        [::std::mem::offset_of!(_XIMPreeditDrawCallbackStruct, chg_first) - 4usize];
    ["Offset of field: _XIMPreeditDrawCallbackStruct::chg_length"]
        [::std::mem::offset_of!(_XIMPreeditDrawCallbackStruct, chg_length) - 8usize];
    ["Offset of field: _XIMPreeditDrawCallbackStruct::text"]
        [::std::mem::offset_of!(_XIMPreeditDrawCallbackStruct, text) - 16usize];
};
pub type XIMPreeditDrawCallbackStruct = _XIMPreeditDrawCallbackStruct;
pub const XIMCaretStyle_XIMIsInvisible: XIMCaretStyle = 0;
pub const XIMCaretStyle_XIMIsPrimary: XIMCaretStyle = 1;
pub const XIMCaretStyle_XIMIsSecondary: XIMCaretStyle = 2;
pub type XIMCaretStyle = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XIMPreeditCaretCallbackStruct {
    pub position: ::std::os::raw::c_int,
    pub direction: XIMCaretDirection,
    pub style: XIMCaretStyle,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XIMPreeditCaretCallbackStruct"]
        [::std::mem::size_of::<_XIMPreeditCaretCallbackStruct>() - 12usize];
    ["Alignment of _XIMPreeditCaretCallbackStruct"]
        [::std::mem::align_of::<_XIMPreeditCaretCallbackStruct>() - 4usize];
    ["Offset of field: _XIMPreeditCaretCallbackStruct::position"]
        [::std::mem::offset_of!(_XIMPreeditCaretCallbackStruct, position) - 0usize];
    ["Offset of field: _XIMPreeditCaretCallbackStruct::direction"]
        [::std::mem::offset_of!(_XIMPreeditCaretCallbackStruct, direction) - 4usize];
    ["Offset of field: _XIMPreeditCaretCallbackStruct::style"]
        [::std::mem::offset_of!(_XIMPreeditCaretCallbackStruct, style) - 8usize];
};
pub type XIMPreeditCaretCallbackStruct = _XIMPreeditCaretCallbackStruct;
pub const XIMStatusDataType_XIMTextType: XIMStatusDataType = 0;
pub const XIMStatusDataType_XIMBitmapType: XIMStatusDataType = 1;
pub type XIMStatusDataType = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _XIMStatusDrawCallbackStruct {
    pub type_: XIMStatusDataType,
    pub data: _XIMStatusDrawCallbackStruct__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _XIMStatusDrawCallbackStruct__bindgen_ty_1 {
    pub text: *mut XIMText,
    pub bitmap: Pixmap,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XIMStatusDrawCallbackStruct__bindgen_ty_1"]
        [::std::mem::size_of::<_XIMStatusDrawCallbackStruct__bindgen_ty_1>() - 8usize];
    ["Alignment of _XIMStatusDrawCallbackStruct__bindgen_ty_1"]
        [::std::mem::align_of::<_XIMStatusDrawCallbackStruct__bindgen_ty_1>() - 8usize];
    ["Offset of field: _XIMStatusDrawCallbackStruct__bindgen_ty_1::text"]
        [::std::mem::offset_of!(_XIMStatusDrawCallbackStruct__bindgen_ty_1, text) - 0usize];
    ["Offset of field: _XIMStatusDrawCallbackStruct__bindgen_ty_1::bitmap"]
        [::std::mem::offset_of!(_XIMStatusDrawCallbackStruct__bindgen_ty_1, bitmap) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XIMStatusDrawCallbackStruct"]
        [::std::mem::size_of::<_XIMStatusDrawCallbackStruct>() - 16usize];
    ["Alignment of _XIMStatusDrawCallbackStruct"]
        [::std::mem::align_of::<_XIMStatusDrawCallbackStruct>() - 8usize];
    ["Offset of field: _XIMStatusDrawCallbackStruct::type_"]
        [::std::mem::offset_of!(_XIMStatusDrawCallbackStruct, type_) - 0usize];
    ["Offset of field: _XIMStatusDrawCallbackStruct::data"]
        [::std::mem::offset_of!(_XIMStatusDrawCallbackStruct, data) - 8usize];
};
pub type XIMStatusDrawCallbackStruct = _XIMStatusDrawCallbackStruct;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XIMHotKeyTrigger {
    pub keysym: KeySym,
    pub modifier: ::std::os::raw::c_int,
    pub modifier_mask: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XIMHotKeyTrigger"][::std::mem::size_of::<_XIMHotKeyTrigger>() - 16usize];
    ["Alignment of _XIMHotKeyTrigger"][::std::mem::align_of::<_XIMHotKeyTrigger>() - 8usize];
    ["Offset of field: _XIMHotKeyTrigger::keysym"]
        [::std::mem::offset_of!(_XIMHotKeyTrigger, keysym) - 0usize];
    ["Offset of field: _XIMHotKeyTrigger::modifier"]
        [::std::mem::offset_of!(_XIMHotKeyTrigger, modifier) - 8usize];
    ["Offset of field: _XIMHotKeyTrigger::modifier_mask"]
        [::std::mem::offset_of!(_XIMHotKeyTrigger, modifier_mask) - 12usize];
};
pub type XIMHotKeyTrigger = _XIMHotKeyTrigger;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _XIMHotKeyTriggers {
    pub num_hot_key: ::std::os::raw::c_int,
    pub key: *mut XIMHotKeyTrigger,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _XIMHotKeyTriggers"][::std::mem::size_of::<_XIMHotKeyTriggers>() - 16usize];
    ["Alignment of _XIMHotKeyTriggers"][::std::mem::align_of::<_XIMHotKeyTriggers>() - 8usize];
    ["Offset of field: _XIMHotKeyTriggers::num_hot_key"]
        [::std::mem::offset_of!(_XIMHotKeyTriggers, num_hot_key) - 0usize];
    ["Offset of field: _XIMHotKeyTriggers::key"]
        [::std::mem::offset_of!(_XIMHotKeyTriggers, key) - 8usize];
};
pub type XIMHotKeyTriggers = _XIMHotKeyTriggers;
pub type XIMHotKeyState = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct XIMValuesList {
    pub count_values: ::std::os::raw::c_ushort,
    pub supported_values: *mut *mut ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of XIMValuesList"][::std::mem::size_of::<XIMValuesList>() - 16usize];
    ["Alignment of XIMValuesList"][::std::mem::align_of::<XIMValuesList>() - 8usize];
    ["Offset of field: XIMValuesList::count_values"]
        [::std::mem::offset_of!(XIMValuesList, count_values) - 0usize];
    ["Offset of field: XIMValuesList::supported_values"]
        [::std::mem::offset_of!(XIMValuesList, supported_values) - 8usize];
};
extern "C" {
    pub static mut _Xdebug: ::std::os::raw::c_int;
}
extern "C" {
    pub fn XLoadQueryFont(
        arg1: *mut Display,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut XFontStruct;
}
extern "C" {
    pub fn XQueryFont(arg1: *mut Display, arg2: XID) -> *mut XFontStruct;
}
extern "C" {
    pub fn XGetMotionEvents(
        arg1: *mut Display,
        arg2: Window,
        arg3: Time,
        arg4: Time,
        arg5: *mut ::std::os::raw::c_int,
    ) -> *mut XTimeCoord;
}
extern "C" {
    pub fn XDeleteModifiermapEntry(
        arg1: *mut XModifierKeymap,
        arg2: KeyCode,
        arg3: ::std::os::raw::c_int,
    ) -> *mut XModifierKeymap;
}
extern "C" {
    pub fn XGetModifierMapping(arg1: *mut Display) -> *mut XModifierKeymap;
}
extern "C" {
    pub fn XInsertModifiermapEntry(
        arg1: *mut XModifierKeymap,
        arg2: KeyCode,
        arg3: ::std::os::raw::c_int,
    ) -> *mut XModifierKeymap;
}
extern "C" {
    pub fn XNewModifiermap(arg1: ::std::os::raw::c_int) -> *mut XModifierKeymap;
}
extern "C" {
    pub fn XCreateImage(
        arg1: *mut Display,
        arg2: *mut Visual,
        arg3: ::std::os::raw::c_uint,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: *mut ::std::os::raw::c_char,
        arg7: ::std::os::raw::c_uint,
        arg8: ::std::os::raw::c_uint,
        arg9: ::std::os::raw::c_int,
        arg10: ::std::os::raw::c_int,
    ) -> *mut XImage;
}
extern "C" {
    pub fn XInitImage(arg1: *mut XImage) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetImage(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_uint,
        arg6: ::std::os::raw::c_uint,
        arg7: ::std::os::raw::c_ulong,
        arg8: ::std::os::raw::c_int,
    ) -> *mut XImage;
}
extern "C" {
    pub fn XGetSubImage(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_uint,
        arg6: ::std::os::raw::c_uint,
        arg7: ::std::os::raw::c_ulong,
        arg8: ::std::os::raw::c_int,
        arg9: *mut XImage,
        arg10: ::std::os::raw::c_int,
        arg11: ::std::os::raw::c_int,
    ) -> *mut XImage;
}
extern "C" {
    pub fn XOpenDisplay(arg1: *const ::std::os::raw::c_char) -> *mut Display;
}
extern "C" {
    pub fn XrmInitialize();
}
extern "C" {
    pub fn XFetchBytes(
        arg1: *mut Display,
        arg2: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XFetchBuffer(
        arg1: *mut Display,
        arg2: *mut ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XGetAtomName(arg1: *mut Display, arg2: Atom) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XGetAtomNames(
        arg1: *mut Display,
        arg2: *mut Atom,
        arg3: ::std::os::raw::c_int,
        arg4: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetDefault(
        arg1: *mut Display,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XDisplayName(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XKeysymToString(arg1: KeySym) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XSynchronize(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Display,
            arg2: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >;
}
extern "C" {
    pub fn XSetAfterFunction(
        arg1: *mut Display,
        arg2: ::std::option::Option<
            unsafe extern "C" fn(arg1: *mut Display) -> ::std::os::raw::c_int,
        >,
    ) -> ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut Display,
            arg2: ::std::option::Option<
                unsafe extern "C" fn(arg1: *mut Display) -> ::std::os::raw::c_int,
            >,
        ) -> ::std::os::raw::c_int,
    >;
}
extern "C" {
    pub fn XInternAtom(
        arg1: *mut Display,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> Atom;
}
extern "C" {
    pub fn XInternAtoms(
        arg1: *mut Display,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: *mut Atom,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XCopyColormapAndFree(arg1: *mut Display, arg2: Colormap) -> Colormap;
}
extern "C" {
    pub fn XCreateColormap(
        arg1: *mut Display,
        arg2: Window,
        arg3: *mut Visual,
        arg4: ::std::os::raw::c_int,
    ) -> Colormap;
}
extern "C" {
    pub fn XCreatePixmapCursor(
        arg1: *mut Display,
        arg2: Pixmap,
        arg3: Pixmap,
        arg4: *mut XColor,
        arg5: *mut XColor,
        arg6: ::std::os::raw::c_uint,
        arg7: ::std::os::raw::c_uint,
    ) -> Cursor;
}
extern "C" {
    pub fn XCreateGlyphCursor(
        arg1: *mut Display,
        arg2: Font,
        arg3: Font,
        arg4: ::std::os::raw::c_uint,
        arg5: ::std::os::raw::c_uint,
        arg6: *const XColor,
        arg7: *const XColor,
    ) -> Cursor;
}
extern "C" {
    pub fn XCreateFontCursor(arg1: *mut Display, arg2: ::std::os::raw::c_uint) -> Cursor;
}
extern "C" {
    pub fn XLoadFont(arg1: *mut Display, arg2: *const ::std::os::raw::c_char) -> Font;
}
extern "C" {
    pub fn XCreateGC(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: ::std::os::raw::c_ulong,
        arg4: *mut XGCValues,
    ) -> GC;
}
extern "C" {
    pub fn XGContextFromGC(arg1: GC) -> GContext;
}
extern "C" {
    pub fn XFlushGC(arg1: *mut Display, arg2: GC);
}
extern "C" {
    pub fn XCreatePixmap(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: ::std::os::raw::c_uint,
        arg4: ::std::os::raw::c_uint,
        arg5: ::std::os::raw::c_uint,
    ) -> Pixmap;
}
extern "C" {
    pub fn XCreateBitmapFromData(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: *const ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_uint,
        arg5: ::std::os::raw::c_uint,
    ) -> Pixmap;
}
extern "C" {
    pub fn XCreatePixmapFromBitmapData(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: *mut ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_uint,
        arg5: ::std::os::raw::c_uint,
        arg6: ::std::os::raw::c_ulong,
        arg7: ::std::os::raw::c_ulong,
        arg8: ::std::os::raw::c_uint,
    ) -> Pixmap;
}
extern "C" {
    pub fn XCreateSimpleWindow(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_uint,
        arg6: ::std::os::raw::c_uint,
        arg7: ::std::os::raw::c_uint,
        arg8: ::std::os::raw::c_ulong,
        arg9: ::std::os::raw::c_ulong,
    ) -> Window;
}
extern "C" {
    pub fn XGetSelectionOwner(arg1: *mut Display, arg2: Atom) -> Window;
}
extern "C" {
    pub fn XCreateWindow(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_uint,
        arg6: ::std::os::raw::c_uint,
        arg7: ::std::os::raw::c_uint,
        arg8: ::std::os::raw::c_int,
        arg9: ::std::os::raw::c_uint,
        arg10: *mut Visual,
        arg11: ::std::os::raw::c_ulong,
        arg12: *mut XSetWindowAttributes,
    ) -> Window;
}
extern "C" {
    pub fn XListInstalledColormaps(
        arg1: *mut Display,
        arg2: Window,
        arg3: *mut ::std::os::raw::c_int,
    ) -> *mut Colormap;
}
extern "C" {
    pub fn XListFonts(
        arg1: *mut Display,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XListFontsWithInfo(
        arg1: *mut Display,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
        arg5: *mut *mut XFontStruct,
    ) -> *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XGetFontPath(
        arg1: *mut Display,
        arg2: *mut ::std::os::raw::c_int,
    ) -> *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XListExtensions(
        arg1: *mut Display,
        arg2: *mut ::std::os::raw::c_int,
    ) -> *mut *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XListProperties(
        arg1: *mut Display,
        arg2: Window,
        arg3: *mut ::std::os::raw::c_int,
    ) -> *mut Atom;
}
extern "C" {
    pub fn XListHosts(
        arg1: *mut Display,
        arg2: *mut ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
    ) -> *mut XHostAddress;
}
extern "C" {
    pub fn XKeycodeToKeysym(
        arg1: *mut Display,
        arg2: KeyCode,
        arg3: ::std::os::raw::c_int,
    ) -> KeySym;
}
extern "C" {
    pub fn XLookupKeysym(arg1: *mut XKeyEvent, arg2: ::std::os::raw::c_int) -> KeySym;
}
extern "C" {
    pub fn XGetKeyboardMapping(
        arg1: *mut Display,
        arg2: KeyCode,
        arg3: ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> *mut KeySym;
}
extern "C" {
    pub fn XStringToKeysym(arg1: *const ::std::os::raw::c_char) -> KeySym;
}
extern "C" {
    pub fn XMaxRequestSize(arg1: *mut Display) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn XExtendedMaxRequestSize(arg1: *mut Display) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn XResourceManagerString(arg1: *mut Display) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XScreenResourceString(arg1: *mut Screen) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XDisplayMotionBufferSize(arg1: *mut Display) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn XVisualIDFromVisual(arg1: *mut Visual) -> VisualID;
}
extern "C" {
    pub fn XInitThreads() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFreeThreads() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XLockDisplay(arg1: *mut Display);
}
extern "C" {
    pub fn XUnlockDisplay(arg1: *mut Display);
}
extern "C" {
    pub fn XInitExtension(
        arg1: *mut Display,
        arg2: *const ::std::os::raw::c_char,
    ) -> *mut XExtCodes;
}
extern "C" {
    pub fn XAddExtension(arg1: *mut Display) -> *mut XExtCodes;
}
extern "C" {
    pub fn XFindOnExtensionList(
        arg1: *mut *mut XExtData,
        arg2: ::std::os::raw::c_int,
    ) -> *mut XExtData;
}
extern "C" {
    pub fn XEHeadOfExtensionList(arg1: XEDataObject) -> *mut *mut XExtData;
}
extern "C" {
    pub fn XRootWindow(arg1: *mut Display, arg2: ::std::os::raw::c_int) -> Window;
}
extern "C" {
    pub fn XDefaultRootWindow(arg1: *mut Display) -> Window;
}
extern "C" {
    pub fn XRootWindowOfScreen(arg1: *mut Screen) -> Window;
}
extern "C" {
    pub fn XDefaultVisual(arg1: *mut Display, arg2: ::std::os::raw::c_int) -> *mut Visual;
}
extern "C" {
    pub fn XDefaultVisualOfScreen(arg1: *mut Screen) -> *mut Visual;
}
extern "C" {
    pub fn XDefaultGC(arg1: *mut Display, arg2: ::std::os::raw::c_int) -> GC;
}
extern "C" {
    pub fn XDefaultGCOfScreen(arg1: *mut Screen) -> GC;
}
extern "C" {
    pub fn XBlackPixel(arg1: *mut Display, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn XWhitePixel(arg1: *mut Display, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn XAllPlanes() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn XBlackPixelOfScreen(arg1: *mut Screen) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn XWhitePixelOfScreen(arg1: *mut Screen) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn XNextRequest(arg1: *mut Display) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn XLastKnownRequestProcessed(arg1: *mut Display) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn XServerVendor(arg1: *mut Display) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XDisplayString(arg1: *mut Display) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XDefaultColormap(arg1: *mut Display, arg2: ::std::os::raw::c_int) -> Colormap;
}
extern "C" {
    pub fn XDefaultColormapOfScreen(arg1: *mut Screen) -> Colormap;
}
extern "C" {
    pub fn XDisplayOfScreen(arg1: *mut Screen) -> *mut Display;
}
extern "C" {
    pub fn XScreenOfDisplay(arg1: *mut Display, arg2: ::std::os::raw::c_int) -> *mut Screen;
}
extern "C" {
    pub fn XDefaultScreenOfDisplay(arg1: *mut Display) -> *mut Screen;
}
extern "C" {
    pub fn XEventMaskOfScreen(arg1: *mut Screen) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn XScreenNumberOfScreen(arg1: *mut Screen) -> ::std::os::raw::c_int;
}
pub type XErrorHandler = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut Display, arg2: *mut XErrorEvent) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn XSetErrorHandler(arg1: XErrorHandler) -> XErrorHandler;
}
pub type XIOErrorHandler =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut Display) -> ::std::os::raw::c_int>;
extern "C" {
    pub fn XSetIOErrorHandler(arg1: XIOErrorHandler) -> XIOErrorHandler;
}
pub type XIOErrorExitHandler = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut Display, arg2: *mut ::std::os::raw::c_void),
>;
extern "C" {
    pub fn XSetIOErrorExitHandler(
        arg1: *mut Display,
        arg2: XIOErrorExitHandler,
        arg3: *mut ::std::os::raw::c_void,
    );
}
extern "C" {
    pub fn XListPixmapFormats(
        arg1: *mut Display,
        arg2: *mut ::std::os::raw::c_int,
    ) -> *mut XPixmapFormatValues;
}
extern "C" {
    pub fn XListDepths(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn XReconfigureWMWindow(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_uint,
        arg5: *mut XWindowChanges,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetWMProtocols(
        arg1: *mut Display,
        arg2: Window,
        arg3: *mut *mut Atom,
        arg4: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetWMProtocols(
        arg1: *mut Display,
        arg2: Window,
        arg3: *mut Atom,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XIconifyWindow(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XWithdrawWindow(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetCommand(
        arg1: *mut Display,
        arg2: Window,
        arg3: *mut *mut *mut ::std::os::raw::c_char,
        arg4: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetWMColormapWindows(
        arg1: *mut Display,
        arg2: Window,
        arg3: *mut *mut Window,
        arg4: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetWMColormapWindows(
        arg1: *mut Display,
        arg2: Window,
        arg3: *mut Window,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFreeStringList(arg1: *mut *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn XSetTransientForHint(
        arg1: *mut Display,
        arg2: Window,
        arg3: Window,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XActivateScreenSaver(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XAddHost(arg1: *mut Display, arg2: *mut XHostAddress) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XAddHosts(
        arg1: *mut Display,
        arg2: *mut XHostAddress,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XAddToExtensionList(
        arg1: *mut *mut _XExtData,
        arg2: *mut XExtData,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XAddToSaveSet(arg1: *mut Display, arg2: Window) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XAllocColor(
        arg1: *mut Display,
        arg2: Colormap,
        arg3: *mut XColor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XAllocColorCells(
        arg1: *mut Display,
        arg2: Colormap,
        arg3: ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_ulong,
        arg5: ::std::os::raw::c_uint,
        arg6: *mut ::std::os::raw::c_ulong,
        arg7: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XAllocColorPlanes(
        arg1: *mut Display,
        arg2: Colormap,
        arg3: ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_ulong,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: ::std::os::raw::c_int,
        arg8: ::std::os::raw::c_int,
        arg9: *mut ::std::os::raw::c_ulong,
        arg10: *mut ::std::os::raw::c_ulong,
        arg11: *mut ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XAllocNamedColor(
        arg1: *mut Display,
        arg2: Colormap,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut XColor,
        arg5: *mut XColor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XAllowEvents(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
        arg3: Time,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XAutoRepeatOff(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XAutoRepeatOn(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XBell(arg1: *mut Display, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XBitmapBitOrder(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XBitmapPad(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XBitmapUnit(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XCellsOfScreen(arg1: *mut Screen) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XChangeActivePointerGrab(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_uint,
        arg3: Cursor,
        arg4: Time,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XChangeGC(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_ulong,
        arg4: *mut XGCValues,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XChangeKeyboardControl(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_ulong,
        arg3: *mut XKeyboardControl,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XChangeKeyboardMapping(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: *mut KeySym,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XChangePointerControl(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XChangeProperty(
        arg1: *mut Display,
        arg2: Window,
        arg3: Atom,
        arg4: Atom,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: *const ::std::os::raw::c_uchar,
        arg8: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XChangeSaveSet(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XChangeWindowAttributes(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_ulong,
        arg4: *mut XSetWindowAttributes,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XCheckIfEvent(
        arg1: *mut Display,
        arg2: *mut XEvent,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut Display,
                arg2: *mut XEvent,
                arg3: XPointer,
            ) -> ::std::os::raw::c_int,
        >,
        arg4: XPointer,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XCheckMaskEvent(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_long,
        arg3: *mut XEvent,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XCheckTypedEvent(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
        arg3: *mut XEvent,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XCheckTypedWindowEvent(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_int,
        arg4: *mut XEvent,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XCheckWindowEvent(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_long,
        arg4: *mut XEvent,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XCirculateSubwindows(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XCirculateSubwindowsDown(arg1: *mut Display, arg2: Window) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XCirculateSubwindowsUp(arg1: *mut Display, arg2: Window) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XClearArea(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_uint,
        arg6: ::std::os::raw::c_uint,
        arg7: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XClearWindow(arg1: *mut Display, arg2: Window) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XCloseDisplay(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XConfigureWindow(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_uint,
        arg4: *mut XWindowChanges,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XConnectionNumber(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XConvertSelection(
        arg1: *mut Display,
        arg2: Atom,
        arg3: Atom,
        arg4: Atom,
        arg5: Window,
        arg6: Time,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XCopyArea(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: Drawable,
        arg4: GC,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: ::std::os::raw::c_uint,
        arg8: ::std::os::raw::c_uint,
        arg9: ::std::os::raw::c_int,
        arg10: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XCopyGC(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_ulong,
        arg4: GC,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XCopyPlane(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: Drawable,
        arg4: GC,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: ::std::os::raw::c_uint,
        arg8: ::std::os::raw::c_uint,
        arg9: ::std::os::raw::c_int,
        arg10: ::std::os::raw::c_int,
        arg11: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDefaultDepth(arg1: *mut Display, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDefaultDepthOfScreen(arg1: *mut Screen) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDefaultScreen(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDefineCursor(arg1: *mut Display, arg2: Window, arg3: Cursor) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDeleteProperty(arg1: *mut Display, arg2: Window, arg3: Atom) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDestroyWindow(arg1: *mut Display, arg2: Window) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDestroySubwindows(arg1: *mut Display, arg2: Window) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDoesBackingStore(arg1: *mut Screen) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDoesSaveUnders(arg1: *mut Screen) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDisableAccessControl(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDisplayCells(arg1: *mut Display, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDisplayHeight(arg1: *mut Display, arg2: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDisplayHeightMM(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDisplayKeycodes(
        arg1: *mut Display,
        arg2: *mut ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDisplayPlanes(arg1: *mut Display, arg2: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDisplayWidth(arg1: *mut Display, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDisplayWidthMM(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDrawArc(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_uint,
        arg7: ::std::os::raw::c_uint,
        arg8: ::std::os::raw::c_int,
        arg9: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDrawArcs(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: *mut XArc,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDrawImageString(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: *const ::std::os::raw::c_char,
        arg7: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDrawImageString16(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: *const XChar2b,
        arg7: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDrawLine(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDrawLines(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: *mut XPoint,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDrawPoint(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDrawPoints(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: *mut XPoint,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDrawRectangle(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_uint,
        arg7: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDrawRectangles(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: *mut XRectangle,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDrawSegments(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: *mut XSegment,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDrawString(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: *const ::std::os::raw::c_char,
        arg7: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDrawString16(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: *const XChar2b,
        arg7: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDrawText(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: *mut XTextItem,
        arg7: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDrawText16(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: *mut XTextItem16,
        arg7: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XEnableAccessControl(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XEventsQueued(arg1: *mut Display, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFetchName(
        arg1: *mut Display,
        arg2: Window,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFillArc(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_uint,
        arg7: ::std::os::raw::c_uint,
        arg8: ::std::os::raw::c_int,
        arg9: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFillArcs(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: *mut XArc,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFillPolygon(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: *mut XPoint,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFillRectangle(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_uint,
        arg7: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFillRectangles(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: *mut XRectangle,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFlush(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XForceScreenSaver(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFree(arg1: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFreeColormap(arg1: *mut Display, arg2: Colormap) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFreeColors(
        arg1: *mut Display,
        arg2: Colormap,
        arg3: *mut ::std::os::raw::c_ulong,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFreeCursor(arg1: *mut Display, arg2: Cursor) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFreeExtensionList(arg1: *mut *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFreeFont(arg1: *mut Display, arg2: *mut XFontStruct) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFreeFontInfo(
        arg1: *mut *mut ::std::os::raw::c_char,
        arg2: *mut XFontStruct,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFreeFontNames(arg1: *mut *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFreeFontPath(arg1: *mut *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFreeGC(arg1: *mut Display, arg2: GC) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFreeModifiermap(arg1: *mut XModifierKeymap) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFreePixmap(arg1: *mut Display, arg2: Pixmap) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGeometry(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_uint,
        arg6: ::std::os::raw::c_uint,
        arg7: ::std::os::raw::c_uint,
        arg8: ::std::os::raw::c_int,
        arg9: ::std::os::raw::c_int,
        arg10: *mut ::std::os::raw::c_int,
        arg11: *mut ::std::os::raw::c_int,
        arg12: *mut ::std::os::raw::c_int,
        arg13: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetErrorDatabaseText(
        arg1: *mut Display,
        arg2: *const ::std::os::raw::c_char,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const ::std::os::raw::c_char,
        arg5: *mut ::std::os::raw::c_char,
        arg6: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetErrorText(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetFontProperty(
        arg1: *mut XFontStruct,
        arg2: Atom,
        arg3: *mut ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetGCValues(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_ulong,
        arg4: *mut XGCValues,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetGeometry(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: *mut Window,
        arg4: *mut ::std::os::raw::c_int,
        arg5: *mut ::std::os::raw::c_int,
        arg6: *mut ::std::os::raw::c_uint,
        arg7: *mut ::std::os::raw::c_uint,
        arg8: *mut ::std::os::raw::c_uint,
        arg9: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetIconName(
        arg1: *mut Display,
        arg2: Window,
        arg3: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetInputFocus(
        arg1: *mut Display,
        arg2: *mut Window,
        arg3: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetKeyboardControl(
        arg1: *mut Display,
        arg2: *mut XKeyboardState,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetPointerControl(
        arg1: *mut Display,
        arg2: *mut ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetPointerMapping(
        arg1: *mut Display,
        arg2: *mut ::std::os::raw::c_uchar,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetScreenSaver(
        arg1: *mut Display,
        arg2: *mut ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
        arg5: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetTransientForHint(
        arg1: *mut Display,
        arg2: Window,
        arg3: *mut Window,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetWindowProperty(
        arg1: *mut Display,
        arg2: Window,
        arg3: Atom,
        arg4: ::std::os::raw::c_long,
        arg5: ::std::os::raw::c_long,
        arg6: ::std::os::raw::c_int,
        arg7: Atom,
        arg8: *mut Atom,
        arg9: *mut ::std::os::raw::c_int,
        arg10: *mut ::std::os::raw::c_ulong,
        arg11: *mut ::std::os::raw::c_ulong,
        arg12: *mut *mut ::std::os::raw::c_uchar,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetWindowAttributes(
        arg1: *mut Display,
        arg2: Window,
        arg3: *mut XWindowAttributes,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGrabButton(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_uint,
        arg3: ::std::os::raw::c_uint,
        arg4: Window,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_uint,
        arg7: ::std::os::raw::c_int,
        arg8: ::std::os::raw::c_int,
        arg9: Window,
        arg10: Cursor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGrabKey(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_uint,
        arg4: Window,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGrabKeyboard(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: Time,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGrabPointer(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_uint,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: Window,
        arg8: Cursor,
        arg9: Time,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGrabServer(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XHeightMMOfScreen(arg1: *mut Screen) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XHeightOfScreen(arg1: *mut Screen) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XIfEvent(
        arg1: *mut Display,
        arg2: *mut XEvent,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut Display,
                arg2: *mut XEvent,
                arg3: XPointer,
            ) -> ::std::os::raw::c_int,
        >,
        arg4: XPointer,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XImageByteOrder(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XInstallColormap(arg1: *mut Display, arg2: Colormap) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XKeysymToKeycode(arg1: *mut Display, arg2: KeySym) -> KeyCode;
}
extern "C" {
    pub fn XKillClient(arg1: *mut Display, arg2: XID) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XLookupColor(
        arg1: *mut Display,
        arg2: Colormap,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut XColor,
        arg5: *mut XColor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XLowerWindow(arg1: *mut Display, arg2: Window) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XMapRaised(arg1: *mut Display, arg2: Window) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XMapSubwindows(arg1: *mut Display, arg2: Window) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XMapWindow(arg1: *mut Display, arg2: Window) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XMaskEvent(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_long,
        arg3: *mut XEvent,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XMaxCmapsOfScreen(arg1: *mut Screen) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XMinCmapsOfScreen(arg1: *mut Screen) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XMoveResizeWindow(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_uint,
        arg6: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XMoveWindow(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XNextEvent(arg1: *mut Display, arg2: *mut XEvent) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XNoOp(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XParseColor(
        arg1: *mut Display,
        arg2: Colormap,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut XColor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XParseGeometry(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_uint,
        arg5: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XPeekEvent(arg1: *mut Display, arg2: *mut XEvent) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XPeekIfEvent(
        arg1: *mut Display,
        arg2: *mut XEvent,
        arg3: ::std::option::Option<
            unsafe extern "C" fn(
                arg1: *mut Display,
                arg2: *mut XEvent,
                arg3: XPointer,
            ) -> ::std::os::raw::c_int,
        >,
        arg4: XPointer,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XPending(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XPlanesOfScreen(arg1: *mut Screen) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XProtocolRevision(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XProtocolVersion(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XPutBackEvent(arg1: *mut Display, arg2: *mut XEvent) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XPutImage(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: *mut XImage,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: ::std::os::raw::c_int,
        arg8: ::std::os::raw::c_int,
        arg9: ::std::os::raw::c_uint,
        arg10: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XQLength(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XQueryBestCursor(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: ::std::os::raw::c_uint,
        arg4: ::std::os::raw::c_uint,
        arg5: *mut ::std::os::raw::c_uint,
        arg6: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XQueryBestSize(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
        arg3: Drawable,
        arg4: ::std::os::raw::c_uint,
        arg5: ::std::os::raw::c_uint,
        arg6: *mut ::std::os::raw::c_uint,
        arg7: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XQueryBestStipple(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: ::std::os::raw::c_uint,
        arg4: ::std::os::raw::c_uint,
        arg5: *mut ::std::os::raw::c_uint,
        arg6: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XQueryBestTile(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: ::std::os::raw::c_uint,
        arg4: ::std::os::raw::c_uint,
        arg5: *mut ::std::os::raw::c_uint,
        arg6: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XQueryColor(
        arg1: *mut Display,
        arg2: Colormap,
        arg3: *mut XColor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XQueryColors(
        arg1: *mut Display,
        arg2: Colormap,
        arg3: *mut XColor,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XQueryExtension(
        arg1: *mut Display,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
        arg5: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XQueryKeymap(
        arg1: *mut Display,
        arg2: *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XQueryPointer(
        arg1: *mut Display,
        arg2: Window,
        arg3: *mut Window,
        arg4: *mut Window,
        arg5: *mut ::std::os::raw::c_int,
        arg6: *mut ::std::os::raw::c_int,
        arg7: *mut ::std::os::raw::c_int,
        arg8: *mut ::std::os::raw::c_int,
        arg9: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XQueryTextExtents(
        arg1: *mut Display,
        arg2: XID,
        arg3: *const ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_int,
        arg5: *mut ::std::os::raw::c_int,
        arg6: *mut ::std::os::raw::c_int,
        arg7: *mut ::std::os::raw::c_int,
        arg8: *mut XCharStruct,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XQueryTextExtents16(
        arg1: *mut Display,
        arg2: XID,
        arg3: *const XChar2b,
        arg4: ::std::os::raw::c_int,
        arg5: *mut ::std::os::raw::c_int,
        arg6: *mut ::std::os::raw::c_int,
        arg7: *mut ::std::os::raw::c_int,
        arg8: *mut XCharStruct,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XQueryTree(
        arg1: *mut Display,
        arg2: Window,
        arg3: *mut Window,
        arg4: *mut Window,
        arg5: *mut *mut Window,
        arg6: *mut ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XRaiseWindow(arg1: *mut Display, arg2: Window) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XReadBitmapFile(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: *const ::std::os::raw::c_char,
        arg4: *mut ::std::os::raw::c_uint,
        arg5: *mut ::std::os::raw::c_uint,
        arg6: *mut Pixmap,
        arg7: *mut ::std::os::raw::c_int,
        arg8: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XReadBitmapFileData(
        arg1: *const ::std::os::raw::c_char,
        arg2: *mut ::std::os::raw::c_uint,
        arg3: *mut ::std::os::raw::c_uint,
        arg4: *mut *mut ::std::os::raw::c_uchar,
        arg5: *mut ::std::os::raw::c_int,
        arg6: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XRebindKeysym(
        arg1: *mut Display,
        arg2: KeySym,
        arg3: *mut KeySym,
        arg4: ::std::os::raw::c_int,
        arg5: *const ::std::os::raw::c_uchar,
        arg6: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XRecolorCursor(
        arg1: *mut Display,
        arg2: Cursor,
        arg3: *mut XColor,
        arg4: *mut XColor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XRefreshKeyboardMapping(arg1: *mut XMappingEvent) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XRemoveFromSaveSet(arg1: *mut Display, arg2: Window) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XRemoveHost(arg1: *mut Display, arg2: *mut XHostAddress) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XRemoveHosts(
        arg1: *mut Display,
        arg2: *mut XHostAddress,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XReparentWindow(
        arg1: *mut Display,
        arg2: Window,
        arg3: Window,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XResetScreenSaver(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XResizeWindow(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_uint,
        arg4: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XRestackWindows(
        arg1: *mut Display,
        arg2: *mut Window,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XRotateBuffers(arg1: *mut Display, arg2: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XRotateWindowProperties(
        arg1: *mut Display,
        arg2: Window,
        arg3: *mut Atom,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XScreenCount(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSelectInput(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSendEvent(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_long,
        arg5: *mut XEvent,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetAccessControl(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetArcMode(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetBackground(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetClipMask(arg1: *mut Display, arg2: GC, arg3: Pixmap) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetClipOrigin(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetClipRectangles(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: *mut XRectangle,
        arg6: ::std::os::raw::c_int,
        arg7: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetCloseDownMode(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetCommand(
        arg1: *mut Display,
        arg2: Window,
        arg3: *mut *mut ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetDashes(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_int,
        arg4: *const ::std::os::raw::c_char,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetFillRule(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetFillStyle(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetFont(arg1: *mut Display, arg2: GC, arg3: Font) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetFontPath(
        arg1: *mut Display,
        arg2: *mut *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetForeground(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetFunction(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetGraphicsExposures(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetIconName(
        arg1: *mut Display,
        arg2: Window,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetInputFocus(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_int,
        arg4: Time,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetLineAttributes(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_uint,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetModifierMapping(
        arg1: *mut Display,
        arg2: *mut XModifierKeymap,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetPlaneMask(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetPointerMapping(
        arg1: *mut Display,
        arg2: *const ::std::os::raw::c_uchar,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetScreenSaver(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetSelectionOwner(
        arg1: *mut Display,
        arg2: Atom,
        arg3: Window,
        arg4: Time,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetState(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_ulong,
        arg4: ::std::os::raw::c_ulong,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetStipple(arg1: *mut Display, arg2: GC, arg3: Pixmap) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetSubwindowMode(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetTSOrigin(
        arg1: *mut Display,
        arg2: GC,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetTile(arg1: *mut Display, arg2: GC, arg3: Pixmap) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetWindowBackground(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetWindowBackgroundPixmap(
        arg1: *mut Display,
        arg2: Window,
        arg3: Pixmap,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetWindowBorder(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetWindowBorderPixmap(
        arg1: *mut Display,
        arg2: Window,
        arg3: Pixmap,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetWindowBorderWidth(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_uint,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetWindowColormap(
        arg1: *mut Display,
        arg2: Window,
        arg3: Colormap,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XStoreBuffer(
        arg1: *mut Display,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XStoreBytes(
        arg1: *mut Display,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XStoreColor(
        arg1: *mut Display,
        arg2: Colormap,
        arg3: *mut XColor,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XStoreColors(
        arg1: *mut Display,
        arg2: Colormap,
        arg3: *mut XColor,
        arg4: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XStoreName(
        arg1: *mut Display,
        arg2: Window,
        arg3: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XStoreNamedColor(
        arg1: *mut Display,
        arg2: Colormap,
        arg3: *const ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_ulong,
        arg5: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSync(arg1: *mut Display, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XTextExtents(
        arg1: *mut XFontStruct,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
        arg5: *mut ::std::os::raw::c_int,
        arg6: *mut ::std::os::raw::c_int,
        arg7: *mut XCharStruct,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XTextExtents16(
        arg1: *mut XFontStruct,
        arg2: *const XChar2b,
        arg3: ::std::os::raw::c_int,
        arg4: *mut ::std::os::raw::c_int,
        arg5: *mut ::std::os::raw::c_int,
        arg6: *mut ::std::os::raw::c_int,
        arg7: *mut XCharStruct,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XTextWidth(
        arg1: *mut XFontStruct,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XTextWidth16(
        arg1: *mut XFontStruct,
        arg2: *const XChar2b,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XTranslateCoordinates(
        arg1: *mut Display,
        arg2: Window,
        arg3: Window,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: *mut ::std::os::raw::c_int,
        arg7: *mut ::std::os::raw::c_int,
        arg8: *mut Window,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XUndefineCursor(arg1: *mut Display, arg2: Window) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XUngrabButton(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_uint,
        arg3: ::std::os::raw::c_uint,
        arg4: Window,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XUngrabKey(
        arg1: *mut Display,
        arg2: ::std::os::raw::c_int,
        arg3: ::std::os::raw::c_uint,
        arg4: Window,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XUngrabKeyboard(arg1: *mut Display, arg2: Time) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XUngrabPointer(arg1: *mut Display, arg2: Time) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XUngrabServer(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XUninstallColormap(arg1: *mut Display, arg2: Colormap) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XUnloadFont(arg1: *mut Display, arg2: Font) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XUnmapSubwindows(arg1: *mut Display, arg2: Window) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XUnmapWindow(arg1: *mut Display, arg2: Window) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XVendorRelease(arg1: *mut Display) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XWarpPointer(
        arg1: *mut Display,
        arg2: Window,
        arg3: Window,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_uint,
        arg7: ::std::os::raw::c_uint,
        arg8: ::std::os::raw::c_int,
        arg9: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XWidthMMOfScreen(arg1: *mut Screen) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XWidthOfScreen(arg1: *mut Screen) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XWindowEvent(
        arg1: *mut Display,
        arg2: Window,
        arg3: ::std::os::raw::c_long,
        arg4: *mut XEvent,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XWriteBitmapFile(
        arg1: *mut Display,
        arg2: *const ::std::os::raw::c_char,
        arg3: Pixmap,
        arg4: ::std::os::raw::c_uint,
        arg5: ::std::os::raw::c_uint,
        arg6: ::std::os::raw::c_int,
        arg7: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSupportsLocale() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetLocaleModifiers(arg1: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XOpenOM(
        arg1: *mut Display,
        arg2: *mut _XrmHashBucketRec,
        arg3: *const ::std::os::raw::c_char,
        arg4: *const ::std::os::raw::c_char,
    ) -> XOM;
}
extern "C" {
    pub fn XCloseOM(arg1: XOM) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XSetOMValues(arg1: XOM, ...) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XGetOMValues(arg1: XOM, ...) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XDisplayOfOM(arg1: XOM) -> *mut Display;
}
extern "C" {
    pub fn XLocaleOfOM(arg1: XOM) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XCreateOC(arg1: XOM, ...) -> XOC;
}
extern "C" {
    pub fn XDestroyOC(arg1: XOC);
}
extern "C" {
    pub fn XOMOfOC(arg1: XOC) -> XOM;
}
extern "C" {
    pub fn XSetOCValues(arg1: XOC, ...) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XGetOCValues(arg1: XOC, ...) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XCreateFontSet(
        arg1: *mut Display,
        arg2: *const ::std::os::raw::c_char,
        arg3: *mut *mut *mut ::std::os::raw::c_char,
        arg4: *mut ::std::os::raw::c_int,
        arg5: *mut *mut ::std::os::raw::c_char,
    ) -> XFontSet;
}
extern "C" {
    pub fn XFreeFontSet(arg1: *mut Display, arg2: XFontSet);
}
extern "C" {
    pub fn XFontsOfFontSet(
        arg1: XFontSet,
        arg2: *mut *mut *mut XFontStruct,
        arg3: *mut *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XBaseFontNameListOfFontSet(arg1: XFontSet) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XLocaleOfFontSet(arg1: XFontSet) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XContextDependentDrawing(arg1: XFontSet) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XDirectionalDependentDrawing(arg1: XFontSet) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XContextualDrawing(arg1: XFontSet) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XExtentsOfFontSet(arg1: XFontSet) -> *mut XFontSetExtents;
}
extern "C" {
    pub fn XmbTextEscapement(
        arg1: XFontSet,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XwcTextEscapement(
        arg1: XFontSet,
        arg2: *const wchar_t,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Xutf8TextEscapement(
        arg1: XFontSet,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XmbTextExtents(
        arg1: XFontSet,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *mut XRectangle,
        arg5: *mut XRectangle,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XwcTextExtents(
        arg1: XFontSet,
        arg2: *const wchar_t,
        arg3: ::std::os::raw::c_int,
        arg4: *mut XRectangle,
        arg5: *mut XRectangle,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Xutf8TextExtents(
        arg1: XFontSet,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *mut XRectangle,
        arg5: *mut XRectangle,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XmbTextPerCharExtents(
        arg1: XFontSet,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *mut XRectangle,
        arg5: *mut XRectangle,
        arg6: ::std::os::raw::c_int,
        arg7: *mut ::std::os::raw::c_int,
        arg8: *mut XRectangle,
        arg9: *mut XRectangle,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XwcTextPerCharExtents(
        arg1: XFontSet,
        arg2: *const wchar_t,
        arg3: ::std::os::raw::c_int,
        arg4: *mut XRectangle,
        arg5: *mut XRectangle,
        arg6: ::std::os::raw::c_int,
        arg7: *mut ::std::os::raw::c_int,
        arg8: *mut XRectangle,
        arg9: *mut XRectangle,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Xutf8TextPerCharExtents(
        arg1: XFontSet,
        arg2: *const ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
        arg4: *mut XRectangle,
        arg5: *mut XRectangle,
        arg6: ::std::os::raw::c_int,
        arg7: *mut ::std::os::raw::c_int,
        arg8: *mut XRectangle,
        arg9: *mut XRectangle,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XmbDrawText(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: *mut XmbTextItem,
        arg7: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn XwcDrawText(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: *mut XwcTextItem,
        arg7: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Xutf8DrawText(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: GC,
        arg4: ::std::os::raw::c_int,
        arg5: ::std::os::raw::c_int,
        arg6: *mut XmbTextItem,
        arg7: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn XmbDrawString(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: XFontSet,
        arg4: GC,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: *const ::std::os::raw::c_char,
        arg8: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn XwcDrawString(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: XFontSet,
        arg4: GC,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: *const wchar_t,
        arg8: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Xutf8DrawString(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: XFontSet,
        arg4: GC,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: *const ::std::os::raw::c_char,
        arg8: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn XmbDrawImageString(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: XFontSet,
        arg4: GC,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: *const ::std::os::raw::c_char,
        arg8: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn XwcDrawImageString(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: XFontSet,
        arg4: GC,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: *const wchar_t,
        arg8: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn Xutf8DrawImageString(
        arg1: *mut Display,
        arg2: Drawable,
        arg3: XFontSet,
        arg4: GC,
        arg5: ::std::os::raw::c_int,
        arg6: ::std::os::raw::c_int,
        arg7: *const ::std::os::raw::c_char,
        arg8: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn XOpenIM(
        arg1: *mut Display,
        arg2: *mut _XrmHashBucketRec,
        arg3: *mut ::std::os::raw::c_char,
        arg4: *mut ::std::os::raw::c_char,
    ) -> XIM;
}
extern "C" {
    pub fn XCloseIM(arg1: XIM) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetIMValues(arg1: XIM, ...) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XSetIMValues(arg1: XIM, ...) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XDisplayOfIM(arg1: XIM) -> *mut Display;
}
extern "C" {
    pub fn XLocaleOfIM(arg1: XIM) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XCreateIC(arg1: XIM, ...) -> XIC;
}
extern "C" {
    pub fn XDestroyIC(arg1: XIC);
}
extern "C" {
    pub fn XSetICFocus(arg1: XIC);
}
extern "C" {
    pub fn XUnsetICFocus(arg1: XIC);
}
extern "C" {
    pub fn XwcResetIC(arg1: XIC) -> *mut wchar_t;
}
extern "C" {
    pub fn XmbResetIC(arg1: XIC) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn Xutf8ResetIC(arg1: XIC) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XSetICValues(arg1: XIC, ...) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XGetICValues(arg1: XIC, ...) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn XIMOfIC(arg1: XIC) -> XIM;
}
extern "C" {
    pub fn XFilterEvent(arg1: *mut XEvent, arg2: Window) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XmbLookupString(
        arg1: XIC,
        arg2: *mut XKeyPressedEvent,
        arg3: *mut ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_int,
        arg5: *mut KeySym,
        arg6: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XwcLookupString(
        arg1: XIC,
        arg2: *mut XKeyPressedEvent,
        arg3: *mut wchar_t,
        arg4: ::std::os::raw::c_int,
        arg5: *mut KeySym,
        arg6: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn Xutf8LookupString(
        arg1: XIC,
        arg2: *mut XKeyPressedEvent,
        arg3: *mut ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_int,
        arg5: *mut KeySym,
        arg6: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XVaCreateNestedList(arg1: ::std::os::raw::c_int, ...) -> XVaNestedList;
}
extern "C" {
    pub fn XRegisterIMInstantiateCallback(
        arg1: *mut Display,
        arg2: *mut _XrmHashBucketRec,
        arg3: *mut ::std::os::raw::c_char,
        arg4: *mut ::std::os::raw::c_char,
        arg5: XIDProc,
        arg6: XPointer,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XUnregisterIMInstantiateCallback(
        arg1: *mut Display,
        arg2: *mut _XrmHashBucketRec,
        arg3: *mut ::std::os::raw::c_char,
        arg4: *mut ::std::os::raw::c_char,
        arg5: XIDProc,
        arg6: XPointer,
    ) -> ::std::os::raw::c_int;
}
pub type XConnectionWatchProc = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *mut Display,
        arg2: XPointer,
        arg3: ::std::os::raw::c_int,
        arg4: ::std::os::raw::c_int,
        arg5: *mut XPointer,
    ),
>;
extern "C" {
    pub fn XInternalConnectionNumbers(
        arg1: *mut Display,
        arg2: *mut *mut ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XProcessInternalConnection(arg1: *mut Display, arg2: ::std::os::raw::c_int);
}
extern "C" {
    pub fn XAddConnectionWatch(
        arg1: *mut Display,
        arg2: XConnectionWatchProc,
        arg3: XPointer,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XRemoveConnectionWatch(arg1: *mut Display, arg2: XConnectionWatchProc, arg3: XPointer);
}
extern "C" {
    pub fn XSetAuthorization(
        arg1: *mut ::std::os::raw::c_char,
        arg2: ::std::os::raw::c_int,
        arg3: *mut ::std::os::raw::c_char,
        arg4: ::std::os::raw::c_int,
    );
}
extern "C" {
    pub fn _Xmbtowc(
        arg1: *mut wchar_t,
        arg2: *mut ::std::os::raw::c_char,
        arg3: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _Xwctomb(arg1: *mut ::std::os::raw::c_char, arg2: wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XGetEventData(
        arg1: *mut Display,
        arg2: *mut XGenericEventCookie,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn XFreeEventData(arg1: *mut Display, arg2: *mut XGenericEventCookie);
}
pub type __gnuc_va_list = __builtin_va_list;
pub type va_list = __builtin_va_list;
extern "C" {
    pub fn memcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memmove(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memccpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memset(
        __s: *mut ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn memcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __memcmpeq(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn memchr(
        __s: *const ::std::os::raw::c_void,
        __c: ::std::os::raw::c_int,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strncat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcoll(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __locale_struct {
    pub __locales: [*mut __locale_data; 13usize],
    pub __ctype_b: *const ::std::os::raw::c_ushort,
    pub __ctype_tolower: *const ::std::os::raw::c_int,
    pub __ctype_toupper: *const ::std::os::raw::c_int,
    pub __names: [*const ::std::os::raw::c_char; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __locale_struct"][::std::mem::size_of::<__locale_struct>() - 232usize];
    ["Alignment of __locale_struct"][::std::mem::align_of::<__locale_struct>() - 8usize];
    ["Offset of field: __locale_struct::__locales"]
        [::std::mem::offset_of!(__locale_struct, __locales) - 0usize];
    ["Offset of field: __locale_struct::__ctype_b"]
        [::std::mem::offset_of!(__locale_struct, __ctype_b) - 104usize];
    ["Offset of field: __locale_struct::__ctype_tolower"]
        [::std::mem::offset_of!(__locale_struct, __ctype_tolower) - 112usize];
    ["Offset of field: __locale_struct::__ctype_toupper"]
        [::std::mem::offset_of!(__locale_struct, __ctype_toupper) - 120usize];
    ["Offset of field: __locale_struct::__names"]
        [::std::mem::offset_of!(__locale_struct, __names) - 128usize];
};
pub type __locale_t = *mut __locale_struct;
pub type locale_t = __locale_t;
extern "C" {
    pub fn strcoll_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __l: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strxfrm_l(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
        __l: locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strdup(__s: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strndup(
        __string: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strrchr(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strchrnul(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcspn(
        __s: *const ::std::os::raw::c_char,
        __reject: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strspn(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strpbrk(
        __s: *const ::std::os::raw::c_char,
        __accept: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strstr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strtok_r(
        __s: *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
        __save_ptr: *mut *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strcasestr(
        __haystack: *const ::std::os::raw::c_char,
        __needle: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn memmem(
        __haystack: *const ::std::os::raw::c_void,
        __haystacklen: usize,
        __needle: *const ::std::os::raw::c_void,
        __needlelen: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn __mempcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn mempcpy(
        __dest: *mut ::std::os::raw::c_void,
        __src: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strnlen(__string: *const ::std::os::raw::c_char, __maxlen: usize) -> usize;
}
extern "C" {
    pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    #[link_name = "\u{1}__xpg_strerror_r"]
    pub fn strerror_r(
        __errnum: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __buflen: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strerror_l(
        __errnum: ::std::os::raw::c_int,
        __l: locale_t,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn bcmp(
        __s1: *const ::std::os::raw::c_void,
        __s2: *const ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn bcopy(
        __src: *const ::std::os::raw::c_void,
        __dest: *mut ::std::os::raw::c_void,
        __n: ::std::os::raw::c_ulong,
    );
}
extern "C" {
    pub fn bzero(__s: *mut ::std::os::raw::c_void, __n: ::std::os::raw::c_ulong);
}
extern "C" {
    pub fn index(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn rindex(
        __s: *const ::std::os::raw::c_char,
        __c: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ffs(__i: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsl(__l: ::std::os::raw::c_long) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ffsll(__ll: ::std::os::raw::c_longlong) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strcasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn strncasecmp_l(
        __s1: *const ::std::os::raw::c_char,
        __s2: *const ::std::os::raw::c_char,
        __n: usize,
        __loc: locale_t,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn explicit_bzero(__s: *mut ::std::os::raw::c_void, __n: usize);
}
extern "C" {
    pub fn strsep(
        __stringp: *mut *mut ::std::os::raw::c_char,
        __delim: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strsignal(__sig: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn stpncpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn strlcpy(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> usize;
}
extern "C" {
    pub fn strlcat(
        __dest: *mut ::std::os::raw::c_char,
        __src: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> usize;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: ::std::os::raw::c_int,
    pub __value: __mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: ::std::os::raw::c_uint,
    pub __wchb: [::std::os::raw::c_char; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t__bindgen_ty_1"]
        [::std::mem::size_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Alignment of __mbstate_t__bindgen_ty_1"]
        [::std::mem::align_of::<__mbstate_t__bindgen_ty_1>() - 4usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wch"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wch) - 0usize];
    ["Offset of field: __mbstate_t__bindgen_ty_1::__wchb"]
        [::std::mem::offset_of!(__mbstate_t__bindgen_ty_1, __wchb) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __mbstate_t"][::std::mem::size_of::<__mbstate_t>() - 8usize];
    ["Alignment of __mbstate_t"][::std::mem::align_of::<__mbstate_t>() - 4usize];
    ["Offset of field: __mbstate_t::__count"]
        [::std::mem::offset_of!(__mbstate_t, __count) - 0usize];
    ["Offset of field: __mbstate_t::__value"]
        [::std::mem::offset_of!(__mbstate_t, __value) - 4usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos_t {
    pub __pos: __off_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos_t"][::std::mem::size_of::<_G_fpos_t>() - 16usize];
    ["Alignment of _G_fpos_t"][::std::mem::align_of::<_G_fpos_t>() - 8usize];
    ["Offset of field: _G_fpos_t::__pos"][::std::mem::offset_of!(_G_fpos_t, __pos) - 0usize];
    ["Offset of field: _G_fpos_t::__state"][::std::mem::offset_of!(_G_fpos_t, __state) - 8usize];
};
pub type __fpos_t = _G_fpos_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct _G_fpos64_t {
    pub __pos: __off64_t,
    pub __state: __mbstate_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _G_fpos64_t"][::std::mem::size_of::<_G_fpos64_t>() - 16usize];
    ["Alignment of _G_fpos64_t"][::std::mem::align_of::<_G_fpos64_t>() - 8usize];
    ["Offset of field: _G_fpos64_t::__pos"][::std::mem::offset_of!(_G_fpos64_t, __pos) - 0usize];
    ["Offset of field: _G_fpos64_t::__state"]
        [::std::mem::offset_of!(_G_fpos64_t, __state) - 8usize];
};
pub type __fpos64_t = _G_fpos64_t;
pub type __FILE = _IO_FILE;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub _prevchain: *mut *mut _IO_FILE,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_FILE"][::std::mem::size_of::<_IO_FILE>() - 216usize];
    ["Alignment of _IO_FILE"][::std::mem::align_of::<_IO_FILE>() - 8usize];
    ["Offset of field: _IO_FILE::_flags"][::std::mem::offset_of!(_IO_FILE, _flags) - 0usize];
    ["Offset of field: _IO_FILE::_IO_read_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_ptr) - 8usize];
    ["Offset of field: _IO_FILE::_IO_read_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_end) - 16usize];
    ["Offset of field: _IO_FILE::_IO_read_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_read_base) - 24usize];
    ["Offset of field: _IO_FILE::_IO_write_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_base) - 32usize];
    ["Offset of field: _IO_FILE::_IO_write_ptr"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_ptr) - 40usize];
    ["Offset of field: _IO_FILE::_IO_write_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_write_end) - 48usize];
    ["Offset of field: _IO_FILE::_IO_buf_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_base) - 56usize];
    ["Offset of field: _IO_FILE::_IO_buf_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_buf_end) - 64usize];
    ["Offset of field: _IO_FILE::_IO_save_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_base) - 72usize];
    ["Offset of field: _IO_FILE::_IO_backup_base"]
        [::std::mem::offset_of!(_IO_FILE, _IO_backup_base) - 80usize];
    ["Offset of field: _IO_FILE::_IO_save_end"]
        [::std::mem::offset_of!(_IO_FILE, _IO_save_end) - 88usize];
    ["Offset of field: _IO_FILE::_markers"][::std::mem::offset_of!(_IO_FILE, _markers) - 96usize];
    ["Offset of field: _IO_FILE::_chain"][::std::mem::offset_of!(_IO_FILE, _chain) - 104usize];
    ["Offset of field: _IO_FILE::_fileno"][::std::mem::offset_of!(_IO_FILE, _fileno) - 112usize];
    ["Offset of field: _IO_FILE::_flags2"][::std::mem::offset_of!(_IO_FILE, _flags2) - 116usize];
    ["Offset of field: _IO_FILE::_old_offset"]
        [::std::mem::offset_of!(_IO_FILE, _old_offset) - 120usize];
    ["Offset of field: _IO_FILE::_cur_column"]
        [::std::mem::offset_of!(_IO_FILE, _cur_column) - 128usize];
    ["Offset of field: _IO_FILE::_vtable_offset"]
        [::std::mem::offset_of!(_IO_FILE, _vtable_offset) - 130usize];
    ["Offset of field: _IO_FILE::_shortbuf"]
        [::std::mem::offset_of!(_IO_FILE, _shortbuf) - 131usize];
    ["Offset of field: _IO_FILE::_lock"][::std::mem::offset_of!(_IO_FILE, _lock) - 136usize];
    ["Offset of field: _IO_FILE::_offset"][::std::mem::offset_of!(_IO_FILE, _offset) - 144usize];
    ["Offset of field: _IO_FILE::_codecvt"][::std::mem::offset_of!(_IO_FILE, _codecvt) - 152usize];
    ["Offset of field: _IO_FILE::_wide_data"]
        [::std::mem::offset_of!(_IO_FILE, _wide_data) - 160usize];
    ["Offset of field: _IO_FILE::_freeres_list"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_list) - 168usize];
    ["Offset of field: _IO_FILE::_freeres_buf"]
        [::std::mem::offset_of!(_IO_FILE, _freeres_buf) - 176usize];
    ["Offset of field: _IO_FILE::_prevchain"]
        [::std::mem::offset_of!(_IO_FILE, _prevchain) - 184usize];
    ["Offset of field: _IO_FILE::_mode"][::std::mem::offset_of!(_IO_FILE, _mode) - 192usize];
    ["Offset of field: _IO_FILE::_unused2"][::std::mem::offset_of!(_IO_FILE, _unused2) - 196usize];
};
pub type cookie_read_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *mut ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_write_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __buf: *const ::std::os::raw::c_char,
        __nbytes: usize,
    ) -> __ssize_t,
>;
pub type cookie_seek_function_t = ::std::option::Option<
    unsafe extern "C" fn(
        __cookie: *mut ::std::os::raw::c_void,
        __pos: *mut __off64_t,
        __w: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type cookie_close_function_t = ::std::option::Option<
    unsafe extern "C" fn(__cookie: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_cookie_io_functions_t {
    pub read: cookie_read_function_t,
    pub write: cookie_write_function_t,
    pub seek: cookie_seek_function_t,
    pub close: cookie_close_function_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _IO_cookie_io_functions_t"]
        [::std::mem::size_of::<_IO_cookie_io_functions_t>() - 32usize];
    ["Alignment of _IO_cookie_io_functions_t"]
        [::std::mem::align_of::<_IO_cookie_io_functions_t>() - 8usize];
    ["Offset of field: _IO_cookie_io_functions_t::read"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, read) - 0usize];
    ["Offset of field: _IO_cookie_io_functions_t::write"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, write) - 8usize];
    ["Offset of field: _IO_cookie_io_functions_t::seek"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, seek) - 16usize];
    ["Offset of field: _IO_cookie_io_functions_t::close"]
        [::std::mem::offset_of!(_IO_cookie_io_functions_t, close) - 24usize];
};
pub type cookie_io_functions_t = _IO_cookie_io_functions_t;
pub type fpos_t = __fpos_t;
extern "C" {
    pub static mut stdin: *mut FILE;
}
extern "C" {
    pub static mut stdout: *mut FILE;
}
extern "C" {
    pub static mut stderr: *mut FILE;
}
extern "C" {
    pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rename(
        __old: *const ::std::os::raw::c_char,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn renameat(
        __oldfd: ::std::os::raw::c_int,
        __old: *const ::std::os::raw::c_char,
        __newfd: ::std::os::raw::c_int,
        __new: *const ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(arg1: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tmpnam_r(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn tempnam(
        __dir: *const ::std::os::raw::c_char,
        __pfx: *const ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fflush_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn freopen(
        __filename: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
        __stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fdopen(__fd: ::std::os::raw::c_int, __modes: *const ::std::os::raw::c_char)
        -> *mut FILE;
}
extern "C" {
    pub fn fopencookie(
        __magic_cookie: *mut ::std::os::raw::c_void,
        __modes: *const ::std::os::raw::c_char,
        __io_funcs: cookie_io_functions_t,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fmemopen(
        __s: *mut ::std::os::raw::c_void,
        __len: usize,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn open_memstream(
        __bufloc: *mut *mut ::std::os::raw::c_char,
        __sizeloc: *mut usize,
    ) -> *mut FILE;
}
extern "C" {
    pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
}
extern "C" {
    pub fn setvbuf(
        __stream: *mut FILE,
        __buf: *mut ::std::os::raw::c_char,
        __modes: ::std::os::raw::c_int,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setbuffer(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char, __size: usize);
}
extern "C" {
    pub fn setlinebuf(__stream: *mut FILE);
}
extern "C" {
    pub fn fprintf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfprintf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vprintf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsprintf(
        __s: *mut ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn snprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsnprintf(
        __s: *mut ::std::os::raw::c_char,
        __maxlen: ::std::os::raw::c_ulong,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vasprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __f: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn asprintf(
        __ptr: *mut *mut ::std::os::raw::c_char,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vdprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn dprintf(
        __fd: ::std::os::raw::c_int,
        __fmt: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fscanf(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn sscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
extern "C" {
    #[link_name = "\u{1}__isoc99_fscanf"]
    pub fn fscanf1(
        __stream: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_scanf"]
    pub fn scanf1(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_sscanf"]
    pub fn sscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        ...
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vfscanf(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vscanf(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn vsscanf(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vfscanf"]
    pub fn vfscanf1(
        __s: *mut FILE,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vscanf"]
    pub fn vscanf1(
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    #[link_name = "\u{1}__isoc99_vsscanf"]
    pub fn vsscanf1(
        __s: *const ::std::os::raw::c_char,
        __format: *const ::std::os::raw::c_char,
        __arg: *mut __va_list_tag,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getchar_unlocked() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgetc_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fputc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE)
        -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putc_unlocked(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putchar_unlocked(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getw(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn putw(__w: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fgets(
        __s: *mut ::std::os::raw::c_char,
        __n: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn __getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getdelim(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __delimiter: ::std::os::raw::c_int,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn getline(
        __lineptr: *mut *mut ::std::os::raw::c_char,
        __n: *mut usize,
        __stream: *mut FILE,
    ) -> __ssize_t;
}
extern "C" {
    pub fn fputs(__s: *const ::std::os::raw::c_char, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fread(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __stream: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fwrite(
        __ptr: *const ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
        __n: ::std::os::raw::c_ulong,
        __s: *mut FILE,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn fread_unlocked(
        __ptr: *mut ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fwrite_unlocked(
        __ptr: *const ::std::os::raw::c_void,
        __size: usize,
        __n: usize,
        __stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn fseek(
        __stream: *mut FILE,
        __off: ::std::os::raw::c_long,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn rewind(__stream: *mut FILE);
}
extern "C" {
    pub fn fseeko(
        __stream: *mut FILE,
        __off: __off_t,
        __whence: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ftello(__stream: *mut FILE) -> __off_t;
}
extern "C" {
    pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr(__stream: *mut FILE);
}
extern "C" {
    pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearerr_unlocked(__stream: *mut FILE);
}
extern "C" {
    pub fn feof_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn ferror_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn perror(__s: *const ::std::os::raw::c_char);
}
extern "C" {
    pub fn fileno(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fileno_unlocked(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn pclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn popen(
        __command: *const ::std::os::raw::c_char,
        __modes: *const ::std::os::raw::c_char,
    ) -> *mut FILE;
}
extern "C" {
    pub fn ctermid(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn flockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn ftrylockfile(__stream: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn funlockfile(__stream: *mut FILE);
}
extern "C" {
    pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
extern "C" {
    pub fn __ctype_get_mb_cur_max() -> usize;
}
extern "C" {
    pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
}
extern "C" {
    pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtod(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f64;
}
extern "C" {
    pub fn strtof(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> f32;
}
extern "C" {
    pub fn strtold(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
    ) -> u128;
}
extern "C" {
    pub fn strtol(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn strtoul(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn strtoq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtouq(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn strtoll(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn strtoull(
        __nptr: *const ::std::os::raw::c_char,
        __endptr: *mut *mut ::std::os::raw::c_char,
        __base: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_ulonglong;
}
extern "C" {
    pub fn l64a(__n: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn a64l(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn random() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srandom(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn initstate(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn setstate(__statebuf: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 48usize];
    ["Alignment of random_data"][::std::mem::align_of::<random_data>() - 8usize];
    ["Offset of field: random_data::fptr"][::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::std::mem::offset_of!(random_data, rptr) - 8usize];
    ["Offset of field: random_data::state"][::std::mem::offset_of!(random_data, state) - 16usize];
    ["Offset of field: random_data::rand_type"]
        [::std::mem::offset_of!(random_data, rand_type) - 24usize];
    ["Offset of field: random_data::rand_deg"]
        [::std::mem::offset_of!(random_data, rand_deg) - 28usize];
    ["Offset of field: random_data::rand_sep"]
        [::std::mem::offset_of!(random_data, rand_sep) - 32usize];
    ["Offset of field: random_data::end_ptr"]
        [::std::mem::offset_of!(random_data, end_ptr) - 40usize];
};
extern "C" {
    pub fn random_r(__buf: *mut random_data, __result: *mut i32) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srandom_r(
        __seed: ::std::os::raw::c_uint,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn initstate_r(
        __seed: ::std::os::raw::c_uint,
        __statebuf: *mut ::std::os::raw::c_char,
        __statelen: usize,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setstate_r(
        __statebuf: *mut ::std::os::raw::c_char,
        __buf: *mut random_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn rand() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand(__seed: ::std::os::raw::c_uint);
}
extern "C" {
    pub fn rand_r(__seed: *mut ::std::os::raw::c_uint) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn drand48() -> f64;
}
extern "C" {
    pub fn erand48(__xsubi: *mut ::std::os::raw::c_ushort) -> f64;
}
extern "C" {
    pub fn lrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn nrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn mrand48() -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn jrand48(__xsubi: *mut ::std::os::raw::c_ushort) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn srand48(__seedval: ::std::os::raw::c_long);
}
extern "C" {
    pub fn seed48(__seed16v: *mut ::std::os::raw::c_ushort) -> *mut ::std::os::raw::c_ushort;
}
extern "C" {
    pub fn lcong48(__param: *mut ::std::os::raw::c_ushort);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::std::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"][::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"]
        [::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"]
        [::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"][::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
extern "C" {
    pub fn drand48_r(__buffer: *mut drand48_data, __result: *mut f64) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn erand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut f64,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn nrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mrand48_r(
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn jrand48_r(
        __xsubi: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
        __result: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn srand48_r(
        __seedval: ::std::os::raw::c_long,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn seed48_r(
        __seed16v: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn lcong48_r(
        __param: *mut ::std::os::raw::c_ushort,
        __buffer: *mut drand48_data,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn arc4random() -> __uint32_t;
}
extern "C" {
    pub fn arc4random_buf(__buf: *mut ::std::os::raw::c_void, __size: usize);
}
extern "C" {
    pub fn arc4random_uniform(__upper_bound: __uint32_t) -> __uint32_t;
}
extern "C" {
    pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn calloc(
        __nmemb: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn realloc(
        __ptr: *mut ::std::os::raw::c_void,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn free(__ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn reallocarray(
        __ptr: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn alloca(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn valloc(__size: usize) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn posix_memalign(
        __memptr: *mut *mut ::std::os::raw::c_void,
        __alignment: usize,
        __size: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn aligned_alloc(
        __alignment: ::std::os::raw::c_ulong,
        __size: ::std::os::raw::c_ulong,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub fn atexit(__func: ::std::option::Option<unsafe extern "C" fn()>) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn at_quick_exit(
        __func: ::std::option::Option<unsafe extern "C" fn()>,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn on_exit(
        __func: ::std::option::Option<
            unsafe extern "C" fn(
                __status: ::std::os::raw::c_int,
                __arg: *mut ::std::os::raw::c_void,
            ),
        >,
        __arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn quick_exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn _Exit(__status: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn putenv(__string: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn setenv(
        __name: *const ::std::os::raw::c_char,
        __value: *const ::std::os::raw::c_char,
        __replace: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn unsetenv(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn clearenv() -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mktemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn mkstemp(__template: *mut ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkstemps(
        __template: *mut ::std::os::raw::c_char,
        __suffixlen: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mkdtemp(__template: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn realpath(
        __name: *const ::std::os::raw::c_char,
        __resolved: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn bsearch(
        __key: *const ::std::os::raw::c_void,
        __base: *const ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn qsort(
        __base: *mut ::std::os::raw::c_void,
        __nmemb: usize,
        __size: usize,
        __compar: __compar_fn_t,
    );
}
extern "C" {
    pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
}
extern "C" {
    pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
}
extern "C" {
    pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(
        __numer: ::std::os::raw::c_longlong,
        __denom: ::std::os::raw::c_longlong,
    ) -> lldiv_t;
}
extern "C" {
    pub fn ecvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn fcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn gcvt(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qecvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qfcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn qgcvt(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
    ) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn ecvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn fcvt_r(
        __value: f64,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qecvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn qfcvt_r(
        __value: u128,
        __ndigit: ::std::os::raw::c_int,
        __decpt: *mut ::std::os::raw::c_int,
        __sign: *mut ::std::os::raw::c_int,
        __buf: *mut ::std::os::raw::c_char,
        __len: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbtowc(
        __pwc: *mut wchar_t,
        __s: *const ::std::os::raw::c_char,
        __n: usize,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn mbstowcs(__pwcs: *mut wchar_t, __s: *const ::std::os::raw::c_char, __n: usize) -> usize;
}
extern "C" {
    pub fn wcstombs(__s: *mut ::std::os::raw::c_char, __pwcs: *const wchar_t, __n: usize) -> usize;
}
extern "C" {
    pub fn rpmatch(__response: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getsubopt(
        __optionp: *mut *mut ::std::os::raw::c_char,
        __tokens: *const *mut ::std::os::raw::c_char,
        __valuep: *mut *mut ::std::os::raw::c_char,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn getloadavg(__loadavg: *mut f64, __nelem: ::std::os::raw::c_int)
        -> ::std::os::raw::c_int;
}
pub type __jmp_buf = [::std::os::raw::c_long; 8usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __jmp_buf_tag {
    pub __jmpbuf: __jmp_buf,
    pub __mask_was_saved: ::std::os::raw::c_int,
    pub __saved_mask: __sigset_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __jmp_buf_tag"][::std::mem::size_of::<__jmp_buf_tag>() - 200usize];
    ["Alignment of __jmp_buf_tag"][::std::mem::align_of::<__jmp_buf_tag>() - 8usize];
    ["Offset of field: __jmp_buf_tag::__jmpbuf"]
        [::std::mem::offset_of!(__jmp_buf_tag, __jmpbuf) - 0usize];
    ["Offset of field: __jmp_buf_tag::__mask_was_saved"]
        [::std::mem::offset_of!(__jmp_buf_tag, __mask_was_saved) - 64usize];
    ["Offset of field: __jmp_buf_tag::__saved_mask"]
        [::std::mem::offset_of!(__jmp_buf_tag, __saved_mask) - 72usize];
};
pub type jmp_buf = [__jmp_buf_tag; 1usize];
extern "C" {
    pub fn setjmp(__env: *mut __jmp_buf_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn __sigsetjmp(
        __env: *mut __jmp_buf_tag,
        __savemask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn _setjmp(__env: *mut __jmp_buf_tag) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn longjmp(__env: *mut __jmp_buf_tag, __val: ::std::os::raw::c_int) -> !;
}
extern "C" {
    pub fn _longjmp(__env: *mut __jmp_buf_tag, __val: ::std::os::raw::c_int) -> !;
}
pub type sigjmp_buf = [__jmp_buf_tag; 1usize];
extern "C" {
    pub fn siglongjmp(__env: *mut __jmp_buf_tag, __val: ::std::os::raw::c_int) -> !;
}
pub type FT_Int16 = ::std::os::raw::c_short;
pub type FT_UInt16 = ::std::os::raw::c_ushort;
pub type FT_Int32 = ::std::os::raw::c_int;
pub type FT_UInt32 = ::std::os::raw::c_uint;
pub type FT_Fast = ::std::os::raw::c_int;
pub type FT_UFast = ::std::os::raw::c_uint;
pub type FT_Int64 = ::std::os::raw::c_long;
pub type FT_UInt64 = ::std::os::raw::c_ulong;
pub type FT_Memory = *mut FT_MemoryRec_;
pub type FT_Alloc_Func = ::std::option::Option<
    unsafe extern "C" fn(
        memory: FT_Memory,
        size: ::std::os::raw::c_long,
    ) -> *mut ::std::os::raw::c_void,
>;
pub type FT_Free_Func = ::std::option::Option<
    unsafe extern "C" fn(memory: FT_Memory, block: *mut ::std::os::raw::c_void),
>;
pub type FT_Realloc_Func = ::std::option::Option<
    unsafe extern "C" fn(
        memory: FT_Memory,
        cur_size: ::std::os::raw::c_long,
        new_size: ::std::os::raw::c_long,
        block: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FT_MemoryRec_ {
    pub user: *mut ::std::os::raw::c_void,
    pub alloc: FT_Alloc_Func,
    pub free: FT_Free_Func,
    pub realloc: FT_Realloc_Func,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FT_MemoryRec_"][::std::mem::size_of::<FT_MemoryRec_>() - 32usize];
    ["Alignment of FT_MemoryRec_"][::std::mem::align_of::<FT_MemoryRec_>() - 8usize];
    ["Offset of field: FT_MemoryRec_::user"][::std::mem::offset_of!(FT_MemoryRec_, user) - 0usize];
    ["Offset of field: FT_MemoryRec_::alloc"]
        [::std::mem::offset_of!(FT_MemoryRec_, alloc) - 8usize];
    ["Offset of field: FT_MemoryRec_::free"][::std::mem::offset_of!(FT_MemoryRec_, free) - 16usize];
    ["Offset of field: FT_MemoryRec_::realloc"]
        [::std::mem::offset_of!(FT_MemoryRec_, realloc) - 24usize];
};
pub type FT_Stream = *mut FT_StreamRec_;
#[repr(C)]
#[derive(Copy, Clone)]
pub union FT_StreamDesc_ {
    pub value: ::std::os::raw::c_long,
    pub pointer: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FT_StreamDesc_"][::std::mem::size_of::<FT_StreamDesc_>() - 8usize];
    ["Alignment of FT_StreamDesc_"][::std::mem::align_of::<FT_StreamDesc_>() - 8usize];
    ["Offset of field: FT_StreamDesc_::value"]
        [::std::mem::offset_of!(FT_StreamDesc_, value) - 0usize];
    ["Offset of field: FT_StreamDesc_::pointer"]
        [::std::mem::offset_of!(FT_StreamDesc_, pointer) - 0usize];
};
pub type FT_StreamDesc = FT_StreamDesc_;
pub type FT_Stream_IoFunc = ::std::option::Option<
    unsafe extern "C" fn(
        stream: FT_Stream,
        offset: ::std::os::raw::c_ulong,
        buffer: *mut ::std::os::raw::c_uchar,
        count: ::std::os::raw::c_ulong,
    ) -> ::std::os::raw::c_ulong,
>;
pub type FT_Stream_CloseFunc = ::std::option::Option<unsafe extern "C" fn(stream: FT_Stream)>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct FT_StreamRec_ {
    pub base: *mut ::std::os::raw::c_uchar,
    pub size: ::std::os::raw::c_ulong,
    pub pos: ::std::os::raw::c_ulong,
    pub descriptor: FT_StreamDesc,
    pub pathname: FT_StreamDesc,
    pub read: FT_Stream_IoFunc,
    pub close: FT_Stream_CloseFunc,
    pub memory: FT_Memory,
    pub cursor: *mut ::std::os::raw::c_uchar,
    pub limit: *mut ::std::os::raw::c_uchar,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FT_StreamRec_"][::std::mem::size_of::<FT_StreamRec_>() - 80usize];
    ["Alignment of FT_StreamRec_"][::std::mem::align_of::<FT_StreamRec_>() - 8usize];
    ["Offset of field: FT_StreamRec_::base"][::std::mem::offset_of!(FT_StreamRec_, base) - 0usize];
    ["Offset of field: FT_StreamRec_::size"][::std::mem::offset_of!(FT_StreamRec_, size) - 8usize];
    ["Offset of field: FT_StreamRec_::pos"][::std::mem::offset_of!(FT_StreamRec_, pos) - 16usize];
    ["Offset of field: FT_StreamRec_::descriptor"]
        [::std::mem::offset_of!(FT_StreamRec_, descriptor) - 24usize];
    ["Offset of field: FT_StreamRec_::pathname"]
        [::std::mem::offset_of!(FT_StreamRec_, pathname) - 32usize];
    ["Offset of field: FT_StreamRec_::read"][::std::mem::offset_of!(FT_StreamRec_, read) - 40usize];
    ["Offset of field: FT_StreamRec_::close"]
        [::std::mem::offset_of!(FT_StreamRec_, close) - 48usize];
    ["Offset of field: FT_StreamRec_::memory"]
        [::std::mem::offset_of!(FT_StreamRec_, memory) - 56usize];
    ["Offset of field: FT_StreamRec_::cursor"]
        [::std::mem::offset_of!(FT_StreamRec_, cursor) - 64usize];
    ["Offset of field: FT_StreamRec_::limit"]
        [::std::mem::offset_of!(FT_StreamRec_, limit) - 72usize];
};
pub type FT_StreamRec = FT_StreamRec_;
pub type FT_Pos = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FT_Vector_ {
    pub x: FT_Pos,
    pub y: FT_Pos,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FT_Vector_"][::std::mem::size_of::<FT_Vector_>() - 16usize];
    ["Alignment of FT_Vector_"][::std::mem::align_of::<FT_Vector_>() - 8usize];
    ["Offset of field: FT_Vector_::x"][::std::mem::offset_of!(FT_Vector_, x) - 0usize];
    ["Offset of field: FT_Vector_::y"][::std::mem::offset_of!(FT_Vector_, y) - 8usize];
};
pub type FT_Vector = FT_Vector_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FT_BBox_ {
    pub xMin: FT_Pos,
    pub yMin: FT_Pos,
    pub xMax: FT_Pos,
    pub yMax: FT_Pos,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FT_BBox_"][::std::mem::size_of::<FT_BBox_>() - 32usize];
    ["Alignment of FT_BBox_"][::std::mem::align_of::<FT_BBox_>() - 8usize];
    ["Offset of field: FT_BBox_::xMin"][::std::mem::offset_of!(FT_BBox_, xMin) - 0usize];
    ["Offset of field: FT_BBox_::yMin"][::std::mem::offset_of!(FT_BBox_, yMin) - 8usize];
    ["Offset of field: FT_BBox_::xMax"][::std::mem::offset_of!(FT_BBox_, xMax) - 16usize];
    ["Offset of field: FT_BBox_::yMax"][::std::mem::offset_of!(FT_BBox_, yMax) - 24usize];
};
pub type FT_BBox = FT_BBox_;
pub const FT_Pixel_Mode__FT_PIXEL_MODE_NONE: FT_Pixel_Mode_ = 0;
pub const FT_Pixel_Mode__FT_PIXEL_MODE_MONO: FT_Pixel_Mode_ = 1;
pub const FT_Pixel_Mode__FT_PIXEL_MODE_GRAY: FT_Pixel_Mode_ = 2;
pub const FT_Pixel_Mode__FT_PIXEL_MODE_GRAY2: FT_Pixel_Mode_ = 3;
pub const FT_Pixel_Mode__FT_PIXEL_MODE_GRAY4: FT_Pixel_Mode_ = 4;
pub const FT_Pixel_Mode__FT_PIXEL_MODE_LCD: FT_Pixel_Mode_ = 5;
pub const FT_Pixel_Mode__FT_PIXEL_MODE_LCD_V: FT_Pixel_Mode_ = 6;
pub const FT_Pixel_Mode__FT_PIXEL_MODE_BGRA: FT_Pixel_Mode_ = 7;
pub const FT_Pixel_Mode__FT_PIXEL_MODE_MAX: FT_Pixel_Mode_ = 8;
pub type FT_Pixel_Mode_ = ::std::os::raw::c_uint;
pub use self::FT_Pixel_Mode_ as FT_Pixel_Mode;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FT_Bitmap_ {
    pub rows: ::std::os::raw::c_uint,
    pub width: ::std::os::raw::c_uint,
    pub pitch: ::std::os::raw::c_int,
    pub buffer: *mut ::std::os::raw::c_uchar,
    pub num_grays: ::std::os::raw::c_ushort,
    pub pixel_mode: ::std::os::raw::c_uchar,
    pub palette_mode: ::std::os::raw::c_uchar,
    pub palette: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FT_Bitmap_"][::std::mem::size_of::<FT_Bitmap_>() - 40usize];
    ["Alignment of FT_Bitmap_"][::std::mem::align_of::<FT_Bitmap_>() - 8usize];
    ["Offset of field: FT_Bitmap_::rows"][::std::mem::offset_of!(FT_Bitmap_, rows) - 0usize];
    ["Offset of field: FT_Bitmap_::width"][::std::mem::offset_of!(FT_Bitmap_, width) - 4usize];
    ["Offset of field: FT_Bitmap_::pitch"][::std::mem::offset_of!(FT_Bitmap_, pitch) - 8usize];
    ["Offset of field: FT_Bitmap_::buffer"][::std::mem::offset_of!(FT_Bitmap_, buffer) - 16usize];
    ["Offset of field: FT_Bitmap_::num_grays"]
        [::std::mem::offset_of!(FT_Bitmap_, num_grays) - 24usize];
    ["Offset of field: FT_Bitmap_::pixel_mode"]
        [::std::mem::offset_of!(FT_Bitmap_, pixel_mode) - 26usize];
    ["Offset of field: FT_Bitmap_::palette_mode"]
        [::std::mem::offset_of!(FT_Bitmap_, palette_mode) - 27usize];
    ["Offset of field: FT_Bitmap_::palette"][::std::mem::offset_of!(FT_Bitmap_, palette) - 32usize];
};
pub type FT_Bitmap = FT_Bitmap_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct FT_Outline_ {
    pub n_contours: ::std::os::raw::c_ushort,
    pub n_points: ::std::os::raw::c_ushort,
    pub points: *mut FT_Vector,
    pub tags: *mut ::std::os::raw::c_uchar,
    pub contours: *mut ::std::os::raw::c_ushort,
    pub flags: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of FT_Outline_"][::std::mem::size_of::<FT_Outline_>() - 40usize];
    ["Alignment of FT_Outline_"][::std::mem::align_of::<FT_Outline_>() - 8usize];
    ["Offset of field: FT_Outline_::n_contours"]
        [::std::mem::offset_of!(FT_Outline_, n_contours) - 0usize];
    ["Offset of field: FT_Outline_::n_points"]
        [::std::mem::offset_of!(FT_Outline_, n_points) - 2usize];
    ["Offset of field: FT_Outline_::points"][::std::mem::offset_of!(FT_Outline_, points) - 8usize];
    ["Offset of field: FT_Outline_::tags"][::std::mem::offset_of!(FT_Outline_, tags) - 16usize];
    ["Offset of field: FT_Outline_::contours"]
        [::std::mem::offset_of!(FT_Outline_, contours) - 24usize];
    ["Offset of field: FT_Outline_::flags"][::std::mem::offset_of!(FT_Outline_, flags) - 32usize];
};
pub type FT_Outline = FT_Outline_;
pub type FT_Outline_MoveToFunc = ::std::option::Option<
    unsafe extern "C" fn(
        to: *const FT_Vector,
        user: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type FT_Outline_LineToFunc = ::std::option::Option<
    unsafe extern "C" fn(
        to: *const FT_Vector,
        user: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type FT_Outline_ConicToFunc = ::std::option::Option<
    unsafe extern "C" fn(
        control: *const FT_Vector,
        to: *const FT_Vector,
        user: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type FT_Outline_CubicToFunc = ::std::option::Option<
    unsafe extern "C" fn(
        control1: *const FT_Vector,
        control2: *const FT_Vector,
        to: *const FT_Vector,
        user: *mut ::std::os::raw::c_void,
